{"session": {"session_id": 1938, "state_id": 34, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2021 1st Special Session", "session_name": "67th Legislative Assembly Special Session"}, "0": {"bill_id": 1532414, "number": "HB1504", "change_hash": "b12d9f1ac092c671ba36fe8904976d08", "url": "https://legiscan.com/ND/bill/HB1504/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/11", "title": "Legislative districts and staggering of terms of members of the legislative assembly; to provide a statement of legislative intent; and to provide an effective date.", "description": "AN ACT to authorize the secretary of state to modify election deadlines and procedures; to create and enact two new sections to chapter 54-03 of the North Dakota Century Code, relating to legislative redistricting and staggering of terms of members of the legislative assembly; to repeal sections 54-03-01.12 and 54-03-01.13 of the North Dakota Century Code, relating to legislative districts and staggering of terms of members of the legislative assembly; to provide a statement of legislative intent; and to provide an effective date."}, "1": {"bill_id": 1532420, "number": "HB1505", "change_hash": "2bff5024d096d509623ce31469c9e092", "url": "https://legiscan.com/ND/bill/HB1505/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/15", "title": "The federal coronavirus capital projects fund and federal state fiscal recovery fund; to identify department of transportation funding sources; to provide an appropriation; to provide for a transfer; to provide for a report; and to provide an effective date.", "description": "AN ACT to amend section 6 of chapter 15, section 5 of chapter 18, sections 6, 7, and 8 of chapter 19, and section 1 of chapter 55 of the 2021 Session Laws, relating to the federal coronavirus capital projects fund and federal state fiscal recovery fund; to identify department of transportation funding sources; to provide an appropriation; to provide for a transfer; to provide for a report; and to provide an effective date."}, "2": {"bill_id": 1532418, "number": "HB1506", "change_hash": "8948bc8a94d111e1d1fa974f9bed1901", "url": "https://legiscan.com/ND/bill/HB1506/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/15", "title": "The beyond visual line of sight unmanned aircraft system program; to provide an exemption; to provide for a report; and to provide an effective date.", "description": "AN ACT to provide an appropriation; to provide for a transfer; to authorize full-time equivalent positions; to amend and reenact section 9 of chapter 46 of the 2021 Session Laws, relating to the beyond visual line of sight unmanned aircraft system program; to provide an exemption; to provide for a report; and to provide an effective date."}, "3": {"bill_id": 1532413, "number": "HB1507", "change_hash": "b955f3fcf3b0791cb74a6ff284ddf139", "url": "https://legiscan.com/ND/bill/HB1507/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "The duties of the superintendent of public instruction to report to the legislative management regarding contemplated curriculum in computer science and cybersecurity; and to provide an effective date.", "description": "AN ACT to amend and reenact section 15.1-02-04 of the North Dakota Century Code, relating to the duties of the superintendent of public instruction to report to the legislative management regarding contemplated curriculum in computer science and cybersecurity; and to provide an effective date."}, "4": {"bill_id": 1532561, "number": "HB1508", "change_hash": "9b07d50b0d45d6399c3b1d7f08cc18d0", "url": "https://legiscan.com/ND/bill/HB1508/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Prohibiting the teaching of critical race theory in public schools; and to provide an effective date.", "description": "AN ACT to create and enact a new section to chapter 15.1-21 of the North Dakota Century Code, relating to prohibiting the teaching of critical race theory in public schools; and to provide an effective date."}, "5": {"bill_id": 1532582, "number": "HB1509", "change_hash": "bf1f6ba6a782ef532008afbe4c66c203", "url": "https://legiscan.com/ND/bill/HB1509/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Charitable gaming tax; to provide for retroactive application; and to provide an effective date.", "description": "AN ACT to amend and reenact section 53-06.1-12 of the North Dakota Century Code, relating to charitable gaming tax; to provide for retroactive application; and to provide an effective date."}, "6": {"bill_id": 1532555, "number": "HB1510", "change_hash": "f9ada814d1204c61db3ef39d61ea54f0", "url": "https://legiscan.com/ND/bill/HB1510/2021/X1", "status_date": "2021-11-08", "status": 1, "last_action_date": "2021-11-11", "last_action": "Second reading, failed to pass, yeas 38 nays 54", "title": "Childhood immunizations; and to provide an effective date.", "description": "A BILL for an Act to create and enact chapter 14-02.7 of the North Dakota Century Code, relating to discrimination based on vaccination status or possession of an immunity passport; to amend and reenact section 23-07-17.1 of the North Dakota Century Code, relating to childhood immunizations; and to provide an effective date."}, "7": {"bill_id": 1532577, "number": "HB1511", "change_hash": "b908c74bd0ae7d9ffb8a4d821a12303a", "url": "https://legiscan.com/ND/bill/HB1511/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Limitations on requiring documentation of COVID-19 vaccinations, antibodies, and post-transmission recovery status and employer-required COVID-19 vaccinations; and to provide an effective date.", "description": "AN ACT to create and enact a new section to chapter 34-03 of the North Dakota Century Code, relating to employer-required COVID-19 vaccinations; to amend and reenact sections 23-01-05.3 and 23-12-20 of the North Dakota Century Code, relating to vaccine passports and limitations on requiring documentation of COVID-19 vaccinations, antibodies, and post-transmission recovery status; to repeal section 23-12-20 of the North Dakota Century Code and section 2 of this Act, relating to limitations on requiring documentation of COVID-19 vaccinations, antibodies, and post-transmission recovery status and employer-required COVID-19 vaccinations; and to provide an effective date."}, "8": {"bill_id": 1532574, "number": "HB1512", "change_hash": "39d41552a8a91091f8140720e7b8ffed", "url": "https://legiscan.com/ND/bill/HB1512/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "The legacy and budget stabilization fund advisory board; to provide for the selection of a chairman; and to provide for an effective date.", "description": "AN ACT to amend and reenact section 21-10-11 of the North Dakota Century Code, relating to the legacy and budget stabilization fund advisory board; to provide for the selection of a chairman; and to provide for an effective date."}, "9": {"bill_id": 1532552, "number": "HB1513", "change_hash": "07296e360e9b5daecd221fe52caa7f78", "url": "https://legiscan.com/ND/bill/HB1513/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/11", "title": "Political party reorganization after redistricting; and to provide an effective date.", "description": "AN ACT to create and enact subsection 5 of section 16.1-03-07 of the North Dakota Century Code, relating to district party organization; to amend and reenact section 16.1-03-17 of the North Dakota Century Code, relating to political party reorganization after redistricting; and to provide an effective date."}, "10": {"bill_id": 1532570, "number": "HB1514", "change_hash": "f915f1fb5f44354a9e7167960912124f", "url": "https://legiscan.com/ND/bill/HB1514/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Disciplinary actions by the board of nursing, board of pharmacy, and board of medicine; and to provide an effective date.", "description": "AN ACT to create and enact a new section to chapter 43-12.1, a new section to chapter 43-15, and a new section to chapter 43-17 of the North Dakota Century Code, relating to disciplinary actions by the board of nursing, board of pharmacy, and board of medicine; and to provide an effective date."}, "11": {"bill_id": 1532768, "number": "HB1515", "change_hash": "1361b699095c8090acde4936b642a7f2", "url": "https://legiscan.com/ND/bill/HB1515/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "An individual income tax credit; to provide an effective date; and to provide an expiration date.", "description": "AN ACT to create and enact a new section to chapter 57-38 and a new subdivision to subsection 7 of section 57-38-30.3 of the North Dakota Century Code, relating to an individual income tax credit; to provide an effective date; and to provide an expiration date."}, "12": {"bill_id": 1532775, "number": "HB1516", "change_hash": "aa9664b0133ad6d25ea3bb0d81489fc1", "url": "https://legiscan.com/ND/bill/HB1516/2021/X1", "status_date": "2021-11-09", "status": 1, "last_action_date": "2021-11-10", "last_action": "Withdrawn from further consideration", "title": "The marriage penalty credit and an income tax exclusion for social security benefits; and to provide an effective date.", "description": "A BILL for an Act to amend and reenact subsection 4 of section 57-38-01.28 and subdivision t of subsection 2 of section 57-38-30.3 of the North Dakota Century Code, relating to the marriage penalty credit and an income tax exclusion for social security benefits; and to provide an effective date."}, "13": {"bill_id": 1532565, "number": "HCR3049", "change_hash": "238cd1ed870ef2f1f284431f82cdc4a6", "url": "https://legiscan.com/ND/bill/HCR3049/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Filed with Secretary Of State 11/12", "title": "A concurrent resolution recognizing parents as the chief stakeholders of the future and education of their children.", "description": "A concurrent resolution recognizing parents as the chief stakeholders of the future and education of their children."}, "14": {"bill_id": 1532416, "number": "SB2345", "change_hash": "de0fb4a371565a10a38be4add7353c71", "url": "https://legiscan.com/ND/bill/SB2345/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/15", "title": "Funds invested by the state investment board, the inspection of juvenile court files, and the appropriation of additional amounts to the state water commission; to provide appropriations to various state agencies; to provide for a transfer; to provide for a report; to provide a limitation; to provide a statement of legislative intent; to provide an exemption; to provide an effective date; and to provide an expiration date.", "description": "AN ACT to create and enact a new section to chapter 27-20.4 and a new section to chapter 61-01 of the North Dakota Century Code, relating to records and cooperative agreements to provide services to juveniles adjudicated in tribal court and the water projects stabilization fund; to amend and reenact subsection 1 of section 21-10-06 and section 27-20.2-21 of the North Dakota Century Code and section 3 of chapter 20 of the 2021 Session Laws, relating to funds invested by the state investment board, the inspection of juvenile court files, and the appropriation of additional amounts to the state water commission; to provide appropriations to various state agencies; to provide for a transfer; to provide for a report; to provide a limitation; to provide a statement of legislative intent; to provide an exemption; to provide an effective date; and to provide an expiration date."}, "15": {"bill_id": 1532417, "number": "SB2346", "change_hash": "ebd7d6fe3a766e38bf26f409dfa48606", "url": "https://legiscan.com/ND/bill/SB2346/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "AN ACT to authorize the department of public instruction to withhold state school aid for information technology project upgrades to the state automated reporting system and the statewide longitudinal data system; to provide a statement of legislative intent; and to provide an effective date.", "description": "AN ACT to authorize the department of public instruction to withhold state school aid for information technology project upgrades to the state automated reporting system and the statewide longitudinal data system; to provide a statement of legislative intent; and to provide an effective date."}, "16": {"bill_id": 1532415, "number": "SB2347", "change_hash": "f6f3733be6648550f6a7d2fb126fa99d", "url": "https://legiscan.com/ND/bill/SB2347/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Printing legislative materials; and to provide an effective date.", "description": "AN ACT to amend and reenact sections 46-02-05, 46-02-06, 46-02-10, 46-02-20, 46-03-18, and 46-03-19 of the North Dakota Century Code, relating to printing legislative materials; and to provide an effective date."}, "17": {"bill_id": 1532419, "number": "SB2348", "change_hash": "e8d453c32e4c2088130cca794a67826b", "url": "https://legiscan.com/ND/bill/SB2348/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Criminal history records checks and the behavioral health bed management system; and to provide an effective date.", "description": "AN ACT to create and enact section 23-27-06 of the North Dakota Century Code, relating to criminal history record checks; to amend and reenact sections 12-60-24 and 50-06-41.3 of the North Dakota Century Code, relating to criminal history records checks and the behavioral health bed management system; and to provide an effective date."}, "18": {"bill_id": 1532421, "number": "SB2349", "change_hash": "dcbac3a5d42b3e9bf29b535cd661ba69", "url": "https://legiscan.com/ND/bill/SB2349/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "The use of legislative assembly rooms; and to provide an effective date.", "description": "AN ACT to amend and reenact section 48-08-04 of the North Dakota Century Code, relating to the use of legislative assembly rooms; and to provide an effective date."}, "19": {"bill_id": 1532549, "number": "SB2350", "change_hash": "f72c9ae10827796c5dff8a9260c8f055", "url": "https://legiscan.com/ND/bill/SB2350/2021/X1", "status_date": "2021-11-12", "status": 4, "last_action_date": "2021-11-12", "last_action": "Signed by Governor 11/12", "title": "Career and technical education scholarship eligibility requirements; and to provide an effective date.", "description": "AN ACT to amend and reenact section 15.1-21-02.4 of the North Dakota Century Code, relating to career and technical education scholarship eligibility requirements; and to provide an effective date."}}