{"session": {"session_id": 475, "state_id": 24, "year_start": 2011, "year_end": 2011, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2011 1st Special Session", "session_name": "2011 First Extraordinary Session"}, "0": {"bill_id": 416101, "number": "HB1", "change_hash": "d009995a9cbd4962d3da0f154a31a962", "url": "https://legiscan.com/MS/bill/HB1/2011/X1", "status_date": "2011-09-02", "status": 6, "last_action_date": "2011-09-02", "last_action": "Died In Committee", "title": "Bonds; issue for Mississippi Industry Incentive Financing Revolving Fund and revise Mississippi Advantage Jobs Act.", "description": "An Act To Amend Section 25, Chapter 533, Laws Of 2010, As Last Amended By Section 6, Chapter 480, Laws Of 2011, To Increase By $175,000,000.00 The Amount Of Bonds Authorized To Be Issued For The Mississippi Industry Incentive Financing Revolving Fund; To Amend Section 57-1-221, Mississippi Code Of 1972, To Clarify The Term \"local Governments\" Under The Mississippi Industry Incentive Financing Revolving Fund Program And To Authorize Local Governments To Sell, Lease Or Otherwise Dispose Of A Project Defined Under The Mississippi Industry Incentive Financing Revolving Fund Program Or Any Property Related To Such Project In Whole Or In Part; To Provide That Approved Business Enterprises That Receive Assistance From The Mississippi Industry Incentive Financing Revolving Fund After The Effective Date Of This Act Shall Agree To Take Reasonable Steps To Ensure That Socially And Economically Disadvantaged Individuals Have An Opportunity To Be Considered For Participation In The Performance Of Contracts And Subcontracts Financed In Whole Or In Part With Funds Provided From The Mississippi Industry Incentive Revolving Fund; To Amend Section 57-62-5, Mississippi Code Of 1972, To Expand The Definition Of The Term \"qualified Business Or Industry\" Under The Mississippi Advantage Jobs Act To Include A Corporation, Limited Liability Company, Partnership, Sole Proprietorship, Business Trust Or Other Legal Entity And Subunits Or Affiliates Thereof Which Is A Manufacturer That Provides An Average Annual Salary, Excluding Benefits Which Are Not Subject To Mississippi Income Taxes, Of At Least 110% Of The Most Recently Published State Average Annual Wage Or The Most Recently Published Average Annual Wage Of The County In Which The Qualified Business Or Industry Is Located, Whichever Is The Lesser, That Has A Minimum Of 5,000 Existing Employees As Of The Last Day Of A Calendar Year, And That The Mississippi Development Authority Determines Will Create Not Less Than 3,000 New Direct Jobs Within 48 Months Of The Date The Mda Determines That The Applicant Is Qualified To Receive Incentive Payments Under The Act; To Amend Section 57-62-9, Mississippi Code Of 1972, To Provide That Such A Qualified Business Or Industry May Elect The Date Upon Which The Ten-year Incentive Payment Will Begin And Begin Receiving Incentive Payments As Early As The Second Quarter After That Date; To Provide That Such Incentive Payments Will Be Calculated On All Jobs Above The Existing Number Of Jobs As Of The Date The Mda Determines That The Applicant Is Qualified To Receive Incentive Payments; To Provide That In The Event That Such A Qualified Business Or Industry Falls Below The Number Of Existing Jobs At The Time Of Determination That The Applicant Is Qualified To Receive The Incentive Payment, The Incentive Payment Shall Cease Until The Qualified Business Or Industry Once Again Exceeds That Number; To Provide That If After 48 Months, The Qualified Business Or Industry Has Failed To Create At Least 3,000 Jobs, Incentive Payments Shall Cease And The Qualified Business Or Industry Shall Not Be Qualified To Receive Further Incentive Payments; To Amend Section 57-62-13, Mississippi Code Of 1972, In Conformity Thereto; And For Related Purposes."}, "2": {"bill_id": 416080, "number": "HR1", "change_hash": "8b63e986149f68c04f0a37b13654adc3", "url": "https://legiscan.com/MS/bill/HR1/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Warner McBride; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative Warner Mcbride For His Legislative Legacy And Congratulating Him Upon The Occasion Of His Retirement From The Mississippi House Of Representatives."}, "3": {"bill_id": 416073, "number": "HR2", "change_hash": "5edc31da57aa0a051aed4448dcde5479", "url": "https://legiscan.com/MS/bill/HR2/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Speaker William J. \"Billy\" McCoy; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Speaker William J. \"billy\" Mccoy For His Many Years Of Outstanding And Dedicated Service To The People Of The State Of Mississippi And Wishing Him Well Upon His Retirement."}, "4": {"bill_id": 416063, "number": "HR3", "change_hash": "67a4aa0025433593c0d2f78e4193af1a", "url": "https://legiscan.com/MS/bill/HR3/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Harvey Moss; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative Harvey Moss For His Legislative Legacy And Congratulating Him Upon The Occasion Of His Retirement From The Mississippi House Of Representatives."}, "5": {"bill_id": 416055, "number": "HR4", "change_hash": "565e06240739a19776eeff1737831031", "url": "https://legiscan.com/MS/bill/HR4/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative David Norquist; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative David Norquist For His Legislative Legacy And Congratulating Him Upon The Occasion Of His Retirement From The Mississippi House Of Representatives."}, "6": {"bill_id": 416046, "number": "HR5", "change_hash": "1db07e732937448f83a25fa71204e753", "url": "https://legiscan.com/MS/bill/HR5/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Mary Ann Stevens; commend dedicated legislative career upon her retirement from the House of Representatives.", "description": "A Resolution Honoring Representative Mary Ann Stevens For Her Legislative Legacy And Congratulating Her Upon The Occasion Of Her Retirement From The Mississippi House Of Representatives."}, "7": {"bill_id": 416035, "number": "HR6", "change_hash": "b6db64592ac3b1b51185b9aff6dff7a8", "url": "https://legiscan.com/MS/bill/HR6/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative J. Shaun Walley; commend dedicated legislative service upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative J. Shaun Walley For His Legislative Legacy And Congratulating Him Upon The Occasion Of His Retirement From The Mississippi House Of Representatives."}, "8": {"bill_id": 416024, "number": "HR7", "change_hash": "76ab19cef0d69064316622f93df6ed08", "url": "https://legiscan.com/MS/bill/HR7/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Wilbert Jones; commend dedicated legislative service upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative Wilbert L. Jones For His Legislative Service To The Mississippi House Of Representatives."}, "9": {"bill_id": 416018, "number": "HR8", "change_hash": "da50af506887084d7152bd372135007f", "url": "https://legiscan.com/MS/bill/HR8/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Harvey Fillingane; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative Harvey Fillingane For His Years Of Service As A Member Of The Mississippi House Of Representatives."}, "10": {"bill_id": 416007, "number": "HR9", "change_hash": "c747eafdaa3c228560070585c7f4c191", "url": "https://legiscan.com/MS/bill/HR9/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Walter Robinson; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending Representative Walter Robinson, Jr., For His Many Years Of Service As A Member Of The Mississippi House Of Representatives."}, "11": {"bill_id": 415998, "number": "HR10", "change_hash": "bb5e8572d3ff7d3d8aaf6b919d204e43", "url": "https://legiscan.com/MS/bill/HR10/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Representative Roger Ishee; commend dedicated legislative career upon his retirement from the House of Representatives.", "description": "A Resolution Commending And Congratulating Representative Roger G. Ishee For His Many Years Of Service As A Member Of The Mississippi House Of Representatives."}, "12": {"bill_id": 415989, "number": "HR11", "change_hash": "679d6327f55abec5133e1ec32b3bf4a4", "url": "https://legiscan.com/MS/bill/HR11/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Nathan Reed Brown; commend and congratulate on receiving the honor of the Eagle Scout Award.", "description": "A Resolution Commending And Congratulating Nathan Reed Brown Of Boy Scouts Of America (bsa) Troop 26 Of Iuka, Mississippi, On The Honor Of Receiving The Eagle Scout Award."}, "13": {"bill_id": 415981, "number": "HR12", "change_hash": "77f0781f847af28491c7076198c64cf0", "url": "https://legiscan.com/MS/bill/HR12/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Estelle S. Pryor; commend historical significance of becoming first African-American female elected official in Washington County, MS.", "description": "A Resolution Commending The Dedicated Service Of Mrs. Estelle S. Pryor And Acknowledging The Historical Significance Of Her Becoming The First African-american Female Elected Official In Washington County Upon Her Election To The Office Of Circuit Clerk In 1972."}, "14": {"bill_id": 415971, "number": "HR13", "change_hash": "c97a281ea5a4062c373c861d41547e7e", "url": "https://legiscan.com/MS/bill/HR13/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Mrs. Elizabeth Ratliff Dukes; commend and congratulate upon the special occasion of her 75th birthday.", "description": "A Resolution Commending And Congratulating Mrs. Elizabeth Ratliff Dukes On The Special Occasion And The Celebration Of The 75th Anniversary Of Her Birth."}, "15": {"bill_id": 415963, "number": "HR14", "change_hash": "8c79921bee015b63402d1834f06c4442", "url": "https://legiscan.com/MS/bill/HR14/2011/X1", "status_date": "2011-09-02", "status": 4, "last_action_date": "2011-09-02", "last_action": "Enrolled Bill Signed", "title": "Locust Grove Missionary Baptist Church; commend on special occasion of its 143rd anniversary.", "description": "A Resolution Commending And Congratulating Locust Grove Missionary Baptist Church On The 143rd Year Anniversary Of Its Founding."}, "16": {"bill_id": 415951, "number": "HR15", "change_hash": "6189662153f04e91ba13a45712cc4275", "url": "https://legiscan.com/MS/bill/HR15/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-06", "last_action": "Enrolled Bill Signed", "title": "Speaker Pro Tempore J.P. Compretta; commend dedicated legislative service to the MS House of Representatives upon his retirement.", "description": "A Resolution Commending Speaker Pro Tempore Joseph Patrick \"j.p.\" Compretta For His Many Years Of Outstanding And Dedicated Service To The People Of The State Of Mississippi And Wishing Him Well Upon His Retirement."}, "17": {"bill_id": 415944, "number": "HR16", "change_hash": "da3af2a0f0de2db1298a974dacf7f56a", "url": "https://legiscan.com/MS/bill/HR16/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-06", "last_action": "Enrolled Bill Signed", "title": "Marie B. Harter; commemorate life and legacy upon her passing.", "description": "A Resolution Commemorating The Life, Legacy And Heritage Of Mrs. Marie B. Harter And Expressing Deepest Sympathy To Her Family And Friends Upon Her Passing."}, "18": {"bill_id": 415935, "number": "HR17", "change_hash": "b18683784209fee480f36dd552ed8337", "url": "https://legiscan.com/MS/bill/HR17/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-06", "last_action": "Enrolled Bill Signed", "title": "Lori D. McCalmOn; commend excellence in educational instruction upon having earned a perfect 300 QDI for student success on Algebra MCT.", "description": "A Resolution Commending The Phenomenal Approach To Teaching And Student Engagement Of Mrs. Lori Davis Mccalmon And Commending Her Excellence In Educational Instruction Upon Having Earned A Perfect 300 Qdi For Student Success On The Algebra Mct."}, "19": {"bill_id": 415925, "number": "HR18", "change_hash": "928892fb3a45a19ef55f7bde9764e353", "url": "https://legiscan.com/MS/bill/HR18/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Dr. Kathryn Warner-Stalling; commend life and legacy upon her passing.", "description": "A Resolution Commemorating The Life, Legacy And Heritage Of Dr. Kathryn Warner-stalling And Expressing Deepest Sympathy To Her Family And Friends Upon Her Passing."}, "21": {"bill_id": 415694, "number": "SR1", "change_hash": "57a653c55031d60db02d24f27410b5d8", "url": "https://legiscan.com/MS/bill/SR1/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize Senator Tommy Moffatt for the accomplishments of his service to the Mississippi Senate.", "description": "A Resolution Recognizing And Commending Mississippi Senator Tommy Moffatt For The Accomplishments Of His Career In The Mississippi Senate And For His Service To The People Of The State Of Mississippi."}, "22": {"bill_id": 415685, "number": "SR2", "change_hash": "19b727e213ee852d6e7e8c6d705aff8e", "url": "https://legiscan.com/MS/bill/SR2/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize Senator Doug E. Davis for the accomplishments of his service to the Mississippi Senate.", "description": "A Resolution Recognizing And Commending Mississippi Senator Doug E. Davis For The Accomplishments Of His Career In The Mississippi Senate And For His Service To The People Of The State Of Mississippi."}, "23": {"bill_id": 415675, "number": "SR3", "change_hash": "e43249633b9f23f24118550483128d1e", "url": "https://legiscan.com/MS/bill/SR3/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize Senator Sid Albritton for his service to the Mississippi Senate.", "description": "A Resolution Recognizing And Commending Mississippi Senator Sid Albritton For The Accomplishments Of His Career In The Mississippi Senate And For His Service To The People Of The State Of Mississippi."}, "24": {"bill_id": 415665, "number": "SR4", "change_hash": "a9a1a7cb818f9d7da18db28d230d23ce", "url": "https://legiscan.com/MS/bill/SR4/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize Senator Ezell Lee for his service to the Mississippi Senate.", "description": "A Resolution Recognizing And Commending Mississippi Senator Ezell Lee For The Accomplishments Of His Career In The Mississippi Senate And For His Service To The People Of The State Of Mississippi."}, "25": {"bill_id": 415657, "number": "SR5", "change_hash": "71bd4acf6ccb428d903496944e358c6f", "url": "https://legiscan.com/MS/bill/SR5/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize the accomplishments of House Speaker Billy McCoy.", "description": "A Resolution Recognizing The Public Service And Accomplishments Of House Speaker Billy Mccoy On The Occasion Of His Retirement."}, "26": {"bill_id": 415647, "number": "SR6", "change_hash": "5610221ff0b3f9f3271ae152ae0c12a8", "url": "https://legiscan.com/MS/bill/SR6/2011/X1", "status_date": "2011-09-02", "status": 2, "last_action_date": "2011-09-02", "last_action": "Immediate Release", "title": "Recognize Senator Tommy Dickerson for the accomplishments of his service to the Mississippi Senate.", "description": "A Resolution Recognizing And Commending Mississippi Senator Tommy Dickerson For The Accomplishments Of His Career In The Mississippi Senate And For His Service To The People Of The State Of Mississippi."}, "27": {"bill_id": 415905, "number": "SC501", "change_hash": "c019e48018aa07a9fffdd980631cb36d", "url": "https://legiscan.com/MS/bill/SC501/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend life and public service of Senator Carl J. \"Jack\" Gordon, Jr.", "description": "A Concurrent Resolution Mourning The Loss And Commending The Life And Public Service Of Senator Carl J. \"jack\" Gordon, Jr., Of Okolona, Mississippi, Master Of The State Budget, And Expressing The Sympathy Of The Legislature."}, "28": {"bill_id": 415898, "number": "SC502", "change_hash": "19810bdea9c16ff7ae3004b5591f8bb0", "url": "https://legiscan.com/MS/bill/SC502/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of Afghanistan casualty USMC Staff Sergeant Jason A. Rogers of Brandon, Mississippi.", "description": "A Concurrent Resolution Remembering The Gallant Service And Mourning The Loss Of Usmc Staff Sergeant Jason Rogers Of Brandon, Mississippi, Who Was Lost In Action In Afghanistan On April 7, 2011."}, "29": {"bill_id": 415888, "number": "SC503", "change_hash": "4e9c8234f9f2e5ff3056c5a2a0b0d714", "url": "https://legiscan.com/MS/bill/SC503/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of Afghanistan casualty U.S. Army Staff Sergeant David D. Self of Pearl, Mississippi.", "description": "A Concurrent Resolution Remembering The Gallant Service And Mourning The Loss Of United States Army Staff Sergeant David D. Self Of Pearl, Mississippi, Who Was Lost In Action In Afghanistan On May 16, 2011."}, "30": {"bill_id": 415881, "number": "SC504", "change_hash": "90e3c761e65929f51039c38bcd60468c", "url": "https://legiscan.com/MS/bill/SC504/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of Afghanistan casualty U.S. Army Sgt. Christopher Bell of Golden, Mississippi.", "description": "A Concurrent Resolution Remembering The Gallant Service And Mourning The Loss Of United States Army Staff Sergeant Christopher R. Bell Of Golden, Mississippi, Who Was Lost In Action In Afghanistan On June 4, 2011."}, "31": {"bill_id": 415869, "number": "SC505", "change_hash": "b3f0a2704aea6fca91b34818b1eb2889", "url": "https://legiscan.com/MS/bill/SC505/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend the life of former Mississippi Senator Jean D. Muirhead.", "description": "A Concurrent Resolution Mourning The Loss And Commending The Life Of Public Service Of Former Mississippi State Senator Jean Denman Muirhead."}, "32": {"bill_id": 415862, "number": "SC506", "change_hash": "e9401126691b248582f24dbc88f2c722", "url": "https://legiscan.com/MS/bill/SC506/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of Holly Springs Police Chief Robert Pearson.", "description": "A Concurrent Resolution Mourning The Loss Of Holly Springs Police Chief (retired) Robert Pearson And Expressing The Sympathy Of The Legislature."}, "33": {"bill_id": 415850, "number": "SC507", "change_hash": "d24727c22a3e04c7969a713bd81fe09f", "url": "https://legiscan.com/MS/bill/SC507/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of former U.S. Attorney and 14th Circuit Court District Attorney Dunn Lampton.", "description": "A Concurrent Resolution Mourning The Loss Of Honorable Dunn Lampton, Former United States Attorney And District Attorney For The 14th Circuit Court District, And Expressing The Sympathy Of The Legislature."}, "34": {"bill_id": 415841, "number": "SC508", "change_hash": "707ca4af4c0ba803c5c65a8a500bf0b0", "url": "https://legiscan.com/MS/bill/SC508/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Mourn the loss of Mississippi Artist Miriam Weems.", "description": "A Concurrent Resolution Mourning The Loss Of Respected Mississippi Artist Miriam Weems Of Jackson, Mississippi."}, "35": {"bill_id": 415834, "number": "SC509", "change_hash": "8320c03b8bff75e1502061f02f61d8d1", "url": "https://legiscan.com/MS/bill/SC509/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend the life and legacy of Mississippi Blues Legend David \"Honeyboy\" Edwards of Shaw, Mississippi.", "description": "A Concurrent Resolution Commending The Life And Legacy Of Mississippi Blues Legend David \"honeyboy\" Edwards From Shaw, Mississippi."}, "36": {"bill_id": 415823, "number": "SC510", "change_hash": "aaef43117c47d9ebf2e113a16b1bca93", "url": "https://legiscan.com/MS/bill/SC510/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-06", "last_action": "Enrolled Bill Signed", "title": "Authorize and support tree planting on the grounds of New Capitol in memory of those killed on 9/11/01.", "description": "A Concurrent Resolution Authorizing And Expressing Support For Planting A Tree On The Grounds Of The New Capitol Building As A 10th Anniversary Commemoration Of Those Who Were Tragically Killed On September 11, 2001."}, "37": {"bill_id": 415815, "number": "SC511", "change_hash": "e2f20ce3d0c0c255b0c731bde0382d6d", "url": "https://legiscan.com/MS/bill/SC511/2011/X1", "status_date": "2011-09-07", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Recognize Larry Gregory for service to the State of Mississippi as Executive Director of the Mississippi Gaming Commission.", "description": "A Concurrent Resolution Recognizing Larry Gregory For His Effective Service To The State Of Mississippi On The Occasion Of His Retirement As Executive Director Of The Mississippi Gaming Commission."}, "38": {"bill_id": 415806, "number": "SC512", "change_hash": "e6a2e66e117f5a3693c4c761096443b4", "url": "https://legiscan.com/MS/bill/SC512/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Recognize service of Casey Pace, Director of the Legislative Reference Bureau.", "description": "A Concurrent Resolution Recognizing The Dedicated Public Service Of Longtime Director Of The Legislative Reference Bureau Casey Pace On The Occasion Of His Retirement."}, "39": {"bill_id": 415797, "number": "SC513", "change_hash": "fe068db604961cdf6c79f827e8549ad5", "url": "https://legiscan.com/MS/bill/SC513/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend Pearl High School Track and Field Coach Woody Barnett for winning Coach of the Year.", "description": "A Concurrent Resolution Congratulating And Commending Legendary Pearl High School Track And Field Coach Woody Barnett For Winning The 2011 State Title And For Being Named State 2011 Athletic Director Of The Year And The Boys Track Coach Of The Year By The Mississippi Association Of Coaches."}, "40": {"bill_id": 415786, "number": "SC514", "change_hash": "5b5fe9941235e52d7dcc966638a118ab", "url": "https://legiscan.com/MS/bill/SC514/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Salute former Senator Con Maloney upon induction into Mississippi Sports Hall of Fame.", "description": "A Concurrent Resolution Saluting Former Senator And Longtime Minor League Baseball Team Owner And Administrator Con Maloney Upon His Induction Into The Mississippi Sports Hall Of Fame."}, "41": {"bill_id": 415778, "number": "SC515", "change_hash": "00313d4d11f34fbcb12e880447594cbb", "url": "https://legiscan.com/MS/bill/SC515/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Recognize IBM Centennial Celebration.", "description": "A Concurrent Resolution To Recognize And Commend The Business And Technology Achievements Of Ibm On The Occasion Of Its Centennial Celebration."}, "42": {"bill_id": 415767, "number": "SC516", "change_hash": "27e6711c75ff2568786ec178692c627f", "url": "https://legiscan.com/MS/bill/SC516/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend Jackson Academy \"Raiders\" Baseball Team and Coach Jay Powell for winning sixth Class AAA State Championship.", "description": "A Concurrent Resolution Commending And Congratulating The Jackson Academy \"raiders\" Baseball Team And Head Coach Jay Powell For Winning Their 6th Mississippi Association Of Independent Schools Class Aaa State Championship."}, "43": {"bill_id": 415760, "number": "SC517", "change_hash": "a2f61c7721a42d568faea7490c64cc07", "url": "https://legiscan.com/MS/bill/SC517/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Recognize MHP Captain Philip Hemphill for winning 2011 NRA National Pistol Championship.", "description": "A Concurrent Resolution Recognizing And Congratulating Captain Philip Hemphill Of The Mississippi Highway Patrol For Winning The 2011 Nra National Pistol Championship."}, "44": {"bill_id": 415750, "number": "SC518", "change_hash": "b57da2179ae4bd27d6ff35a1d86d6847", "url": "https://legiscan.com/MS/bill/SC518/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-06", "last_action": "Enrolled Bill Signed", "title": "Recognize JSU Professor John Calhoun for President Obama \"Champion of Change\" in Business Award and SBA Small Business Person of the Year.", "description": "A Concurrent Resolution Recognizing And Commending Jackson State University Business Professor John Calhoun Upon His Receipt Of The United States President Barack Obama \"champions Of Change\" In Business Award And For Being Named Mississippi Small Business Person Of The Year By The United States Small Business Administration."}, "45": {"bill_id": 415740, "number": "SC519", "change_hash": "bc94bc2126b97c36ee6dffc6f74fdf79", "url": "https://legiscan.com/MS/bill/SC519/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend City of Clinton for two Mississippi Municipal League 2011 Excellence Awards.", "description": "A Concurrent Resolution Commending And Congratulating The City Of Clinton, Mississippi, Public Works Department And Public Works Director Mike Parker For Winning The Clarion Ledger/mississippi Municipal League 2011 Excellence Award For Its Biosolids Dryer At The Southside Wastewater Treatment Plant And The Planning And Development Department For Developing The Quisenberry Library."}, "47": {"bill_id": 415722, "number": "SC521", "change_hash": "e78a0158e4ee03c8c637a546d9ab1e9f", "url": "https://legiscan.com/MS/bill/SC521/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend Corinth High School \"Warriors\" Boys Track Team for winning second consecutive State Championship.", "description": "A Concurrent Resolution Commending And Congratulating The Corinth High School \"warriors\" Boys Track Team For Winning Its Second Consecutive Mhsaa Class 3a State Championship."}, "48": {"bill_id": 415713, "number": "SC522", "change_hash": "d43d4188f70c41c63fd7d53a597a58bc", "url": "https://legiscan.com/MS/bill/SC522/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend Corinth High School Boys Golf Team for winning second consecutive State Championship.", "description": "A Concurrent Resolution Commending And Congratulating The Corinth High School \"warriors\" Boys Golf Team For Winning Its Second Consecutive Mhsaa Class 3a State Championship."}, "49": {"bill_id": 415703, "number": "SC523", "change_hash": "cb719db4b4ab67414e2e86f87166418d", "url": "https://legiscan.com/MS/bill/SC523/2011/X1", "status_date": "2011-09-06", "status": 4, "last_action_date": "2011-09-07", "last_action": "Enrolled Bill Signed", "title": "Commend life and mourn the loss of Holly Springs' Assistant Police Chief Patricia Selman.", "description": "A Concurrent Resolution Commending The Life And Mourning The Loss Of Holly Springs' Assistant Police Chief Patricia Selman."}}