{"session": {"session_id": 1037, "state_id": 24, "year_start": 2013, "year_end": 2013, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2013 1st Special Session", "session_name": "2013 First Extraordinary Session"}, "0": {"bill_id": 560671, "number": "HB1", "change_hash": "915a5d2cf6f2c7c9d67a6aa2c6088733", "url": "https://legiscan.com/MS/bill/HB1/2013/X1", "status_date": "2013-04-28", "status": 4, "last_action_date": "2013-04-28", "last_action": "Approved by Governor", "title": "Economic development; authorize incentives for certain automotive parts manufacturing projects.", "description": "An Act To Create The Gibbs-turner Economic Development Act In Honor Of Representative David Gibbs And Senator Bennie Turner; To Amend Section 57-75-5, Mississippi Code Of 1972, To Revise The Definition Of The Term \"project\" Under The Mississippi Major Economic Impact Act To Include Certain Automotive Parts Manufacturing Plants And Their Affiliates; To Amend Section 57-75-9, Mississippi Code Of 1972, To Provide That Contracts By The Mississippi Major Economic Impact Authority Or A Public Agency For Certain Contracts Related To Such Project Shall Be Exempt From The Provisions Of Section 31-7-13 And That Such Contracts May Be Awarded On The Basis Of Negotiation Under Certain Circumstances; To Amend Section 57-75-11, Mississippi Code Of 1972, To Grant The Mississippi Major Economic Impact Authority Certain Additional Powers And Duties With Regard To Such Projects; To Amend Section 57-75-15, Mississippi Code Of 1972, To Authorize The Issuance Of State General Obligation Bonds For Such Projects And To Specify The Purposes For Which The Proceeds Of Such Bonds May Be Utilized; To Amend Section 57-75-33, Mississippi Code Of 1972, To Provide That The Board Of Supervisors Of A County Or The Governing Authorities Of A Municipality May Each Enter Into An Agreement With An Enterprise Operating Such A Project Providing That The County Or Municipality Will Not Levy Any Taxes, Fees Or Assessments Upon The Enterprise Other Than Taxes, Fees Or Assessments That Are Generally Levied Upon All Taxpayers And To Authorize The Board Of Supervisors Or Governing Authorities To Enter Into A Fee-in-lieu Of Ad Valorem Taxes Agreement With The Enterprise Operating Such A Project; To Amend Section 57-75-37, Mississippi Code Of 1972, To Authorize A County In Which Such A Project Is Located To Assist The Enterprise Establishing The Project And Certain Public Agencies In Defraying Certain Costs; To Authorize Such A County To Provide Funds For Such Purposes By Appropriating Money From Its General Fund Or From The Proceeds Of General Obligation Bonds Issued By The County; To Authorize Certain Transfers And Conveyances Of Real Or Personal Property With Or Without Consideration; To Authorize Certain Public Agencies To Make Grants To Each Other In Connection With Such A Project; To Exempt The Acquisition Of Real Property For Such A Project From Certain Requirements; To Amend Section 57-99-1, Mississippi Code Of 1972, To Include Such A Project Within The Definition Of The Term \"qualified Business Or Industry\" For The Purposes Of The Law That Authorizes Incentive Payments To Such Qualified Business That Are Funded By A Certain Portion Of The Withholding Taxes Paid By The Qualified Business; To Amend Section 27-7-30, Mississippi Code Of 1972, To Provide An Income Tax Exemption For Income Arising From Such A Project; To Provide That The Income Tax Exemption Shall Not Exceed 20 Years Unless The Qualified Business Or Industry Creates Or Maintains For A Period Of 3 Years Not Less Than 1,000 Jobs, In Which Case The Exemption Period Shall Be Extended By 5 Years; To Provide That In The Event That The Annual Average Of Full-time Jobs Maintained Falls Below A Certain Amount, The Tax Exemption Shall Be Suspended Until The First Tax Year During Which The Annual Average Number Of Full-time Jobs Maintained Is Above That Amount; To Amend Section 27-31-104, Mississippi Code Of 1972, To Provide That The Annual Amount Of A Fee-in-lieu Negotiated For Certain Projects That Is Apportioned To A County Shall Not Be Less Than The Amount Necessary To Pay The Debt Service On Bonds Issued By The County For The Project; To Amend Section 27-65-101, Mississippi Code Of 1972, To Exempt From Sales Taxation Sales Or Leases Of Component Materials, Machinery And Equipment Used In The Construction Of A Building, Or Any Addition Or Improvement Thereon To An Enterprise Operating Such A Project; To Exempt From Sales Taxation Sales To Such Manufacturers Of Machinery And Equipment, And Repair Services For Such Machinery And Equipment, Fuel, Supplies, Electricity, Coal, Nitrogen And Natural Gas Used Directly In The Manufacture Of Automotive Parts Or Used To Provide Climate Control For Manufacturing Areas; To Amend Section 31-19-25, Mississippi Code Of 1972, To Provide That Certain Provisions Regarding The Issuance Of Bonds Shall Not Apply To The Sale Of Bonds By A County In Connection With Such A Project; To Amend Section 43-37-3, Mississippi Code Of 1972, In Conformity To The Provisions Of This Act; To Amend Section 21-1-59, Mississippi Code Of 1972, To Provide That The Governing Authorities Of A Municipality May Enter Into An Agreement With An Enterprise Operating Such A Project Providing That The Municipality Will Not Change Its Boundaries So As To Include Within The Limits Of Such Municipality The Project Site Of Such A Project Unless Consent Thereto Shall Be Obtained In Writing From The Enterprise Operating The Project; To Amend Section 27-31-1, Mississippi Code Of 1972, To Provide That If A Municipality Changes Its Boundaries So As To Include Within The Boundaries Of Such Municipality The Project Site Of Such A Project, All Real And Personal Property Located On The Project Site Within The Boundaries Of Such Municipality That Is Owned By A Business Enterprise Operating Such Project, Shall Be Exempt From Ad Valorem Taxation For A Period Of Time Not To Exceed 30 Years Upon Receiving Approval For Such Exemption By The Mississippi Development Authority; And For Related Purposes."}, "1": {"bill_id": 560634, "number": "HR1", "change_hash": "eadef0014be9bf601275f751c7bbbc6b", "url": "https://legiscan.com/MS/bill/HR1/2013/X1", "status_date": "2013-04-30", "status": 4, "last_action_date": "2013-04-30", "last_action": "Enrolled Bill Signed", "title": "Mrs. Sharon Walker; commend exemplary service to the Ocean Springs School Board.", "description": "A Resolution Acknowledging And Commending The Exceptionally Diligent Service Mrs. Sharon Walker Rendered To The Ocean Springs School District Board Of Trustees."}, "2": {"bill_id": 560659, "number": "HR2", "change_hash": "d5d51848e4e361e77b3854c8079e0b80", "url": "https://legiscan.com/MS/bill/HR2/2013/X1", "status_date": "2013-04-30", "status": 4, "last_action_date": "2013-04-30", "last_action": "Enrolled Bill Signed", "title": "Hurricane Creek Baptist Church; commend and congratulate on the special occasion of its 100th anniversary.", "description": "A Resolution Commending And Congratulating The Pastor And Members Of Hurricane Creek Baptist Church In Sandy Hook, Mississippi, On The Special Occasion Of Their Church's 100th Anniversary."}, "3": {"bill_id": 560548, "number": "HR3", "change_hash": "8839e8dad420b773bdeacac8d04ee5ac", "url": "https://legiscan.com/MS/bill/HR3/2013/X1", "status_date": "2013-04-30", "status": 4, "last_action_date": "2013-04-30", "last_action": "Enrolled Bill Signed", "title": "Reverend John Taylor; commend on service to the community.", "description": "A Resolution Commending Reverend John Albert Taylor, Jr., Upon His Outstanding Community Service."}, "4": {"bill_id": 560598, "number": "HR4", "change_hash": "b72d14f81d79ac52937eec4bd2067019", "url": "https://legiscan.com/MS/bill/HR4/2013/X1", "status_date": "2013-04-30", "status": 4, "last_action_date": "2013-04-30", "last_action": "Enrolled Bill Signed", "title": "Robert Sumrall; commend career of and congratulate upon retirement from LBO.", "description": "A Resolution Commending The Dedicated Service And Stellar Career Of Mr. Robert Sumrall And Congratulating Him Upon The Occasion Of His Retirement From The Legislative Budget Office."}, "5": {"bill_id": 560621, "number": "HR5", "change_hash": "e96fa68c67eb09274df63d2cf34c3cf4", "url": "https://legiscan.com/MS/bill/HR5/2013/X1", "status_date": "2013-04-30", "status": 4, "last_action_date": "2013-04-30", "last_action": "Enrolled Bill Signed", "title": "Josh Lindsey; commend and congratulate upon being named 2013 Mississippi Teacher of the Year.", "description": "A Resolution Commending And Congratulating Josh Lindsey Of Hancock High School On Being Named 2013 Mississippi Teacher Of The Year."}, "6": {"bill_id": 560585, "number": "SC501", "change_hash": "da09a0fbd9d2f7170757f287ed4b2117", "url": "https://legiscan.com/MS/bill/SC501/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Recognize the first Change of Command Ceremony for the USS MISSISSIPPI (SSN 782).", "description": "A Concurrent Resolution Recognizing The First Change Of Command Ceremony For The Uss Mississippi (ssn-782) On May 10, 2013, And Welcoming The Submarine's New Captain To Our State As An Honorary Citizen Of Mississippi."}, "7": {"bill_id": 560560, "number": "SC502", "change_hash": "09e7795c4cad00625518651eff4f5d44", "url": "https://legiscan.com/MS/bill/SC502/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Recognize Dr. Vivian M. Presley on retirement as President of Coahoma Community College.", "description": "A Concurrent Resolution Paying Tribute To Dr. Vivian M. Presley Upon The Occasion Of Her Retirement As President Of Coahoma Community College And Superintendent Of Coahoma Agricultural High School."}, "8": {"bill_id": 560684, "number": "SC503", "change_hash": "742f30a2af008e150c94ad328ee3a3f4", "url": "https://legiscan.com/MS/bill/SC503/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Recognize leadership and public service of Charlie Horhn on his retirement as District Director for Congressman Bennie Thompson.", "description": "A Concurrent Resolution Recognizing The Civic Leadership And Public Service Of Charlie Horhn On The Occasion Of His Retirement As District Director For United States Congressman Bennie G. Thompson."}, "9": {"bill_id": 560696, "number": "SC504", "change_hash": "955e15daa5f663abc76359a5238ece65", "url": "https://legiscan.com/MS/bill/SC504/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Celebrate the life of former Mississippi Senate Comptroller Sue Denny.", "description": "A Concurrent Resolution Mourning The Loss And Celebrating The Life Of Former Mississippi Senate Comptroller Sue Rose Johnsey Denny."}, "10": {"bill_id": 560610, "number": "SC505", "change_hash": "9f20a42967b66f4699eebfaf433fb018", "url": "https://legiscan.com/MS/bill/SC505/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Pay tribute to Jackson Police Department Detective Eric T. Smith.", "description": "A Concurrent Resolution Mourning The Loss And Paying Tribute To A Fallen Hero Jackson Police Department Detective Eric T. Smith."}, "11": {"bill_id": 560573, "number": "SC506", "change_hash": "595f4e21fa481e344861159cfee0a3ab", "url": "https://legiscan.com/MS/bill/SC506/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Commend life and public service of former Senator Emerson Stringer.", "description": "A Concurrent Resolution Mourning The Loss And Commending The Life And Public Service Of Former Senator Quin Emerson \"em\" Stringer Of Columbia, Mississippi, And Expressing The Sympathy Of The Legislature."}, "12": {"bill_id": 560646, "number": "SC507", "change_hash": "a42ca2fdfbe47273b92c7e57fd958798", "url": "https://legiscan.com/MS/bill/SC507/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Commend the life and public service of Hinds County Supervisor and former Representative and Senator Doug Anderson.", "description": "A Concurrent Resolution Mourning The Loss And Commending The Life And Public Service Of Longtime Hinds County Supervisor And Former Legislator Douglas \"doug\" Anderson Of Jackson, Mississippi, And Expressing The Sympathy Of The Legislature."}, "13": {"bill_id": 560538, "number": "SC508", "change_hash": "5540e51cbb31efa11985a345331185a0", "url": "https://legiscan.com/MS/bill/SC508/2013/X1", "status_date": "2013-05-01", "status": 4, "last_action_date": "2013-05-01", "last_action": "Enrolled Bill Signed", "title": "Recognize eight Oxford High School 2013 STAR Students which is a record for Mississippi schools.", "description": "A Concurrent Resolution Commending And Congratulating The 8 Oxford High School 2013 Student-teacher Achievement Recognition (star) Students Which Is A Record For Mississippi Schools."}}