{"session": {"session_id": 1462, "state_id": 24, "year_start": 2017, "year_end": 2017, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2017 1st Special Session", "session_name": "2017 First Extraordinary Session"}, "0": {"bill_id": 1017928, "number": "HB1", "change_hash": "87e943335ff83265a1d44079c561b36b", "url": "https://legiscan.com/MS/bill/HB1/2017/X1", "status_date": "2017-06-07", "status": 4, "last_action_date": "2017-06-07", "last_action": "Approved by Governor", "title": "Appropriation; Attorney General.", "description": "An Act Making An Appropriation For The Purpose Of Defraying The Expenses Of The Office Of The Attorney General For Fiscal Year 2018."}, "1": {"bill_id": 1017947, "number": "HB2", "change_hash": "771d5ba6c14a1267c0a2c49b3a5f2006", "url": "https://legiscan.com/MS/bill/HB2/2017/X1", "status_date": "2017-06-07", "status": 4, "last_action_date": "2017-06-07", "last_action": "Approved by Governor", "title": "Appropriation; Transportation, Department of.", "description": "An Act Making An Appropriation From Special Funds In The State Treasury For The Purpose Of Defraying The Expenses Of The Mississippi Department Of Transportation, For The Fiscal Year 2018; And For Related Purposes."}, "2": {"bill_id": 1017949, "number": "HB3", "change_hash": "65a37c081ef921be2d4818265159449f", "url": "https://legiscan.com/MS/bill/HB3/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Working Cash-Stabilization Reserve Fund; increase cap on balance to 10% of General Fund appropriations.", "description": "An Act To Be Known As The Fortify Act; To Amend Section 27-103-203, Mississippi Code Of 1972, To Increase The Cap On The Balance Of The Working Cash-stabilization Reserve Fund From 7.5% To 10% Of Current Fiscal Year General Fund Appropriations; To Amend Section 27-103-211, Mississippi Code Of 1972, To Provide That Unencumbered Cash Remaining At The End Of A Fiscal Year Is Not Included With The General Fund Revenue Estimate When Determining The Limit On Legislative General Fund Appropriations; To Amend Section 27-103-213, Mississippi Code Of 1972, To Revise The Distribution Formula For The Unencumbered General Fund Cash Balance At The End Of The Fiscal Year; To Amend Section 27-104-13, Mississippi Code Of 1972, To Clarify That The Joint Legislative Budget Committee Adopts The General Fund Revenue Estimate; To Require The Legislative Budget Office To Prepare A Multiyear Financial Plan Beginning With Fiscal Year 2021; To Amend Sections 27-103-125, 27-103-139 And 37-61-33, Mississippi Code Of 1972, To Conform To The Preceding Provisions; And For Related Purposes."}, "3": {"bill_id": 1017967, "number": "HB4", "change_hash": "2f2e5aa02b68eed5dc47a7f12b470f89", "url": "https://legiscan.com/MS/bill/HB4/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "FORTIFY Act; create.", "description": "An Act To Be Known As The Fortify Act; To Amend Section 27-103-203, Mississippi Code Of 1972, To Increase The Cap On The Balance Of The Working Cash-stabilization Reserve Fund From 7.5% To 10% Of Current Fiscal Year General Fund Appropriations; To Amend Section 27-103-211, Mississippi Code Of 1972, To Provide That Unencumbered Cash Remaining At The End Of A Fiscal Year Is Not Included With The General Fund Revenue Estimate When Determining The Limit On Legislative General Fund Appropriations; To Amend Section 27-103-213, Mississippi Code Of 1972, To Revise The Distribution Formula For The Unencumbered General Fund Cash Balance At The End Of The Fiscal Year; To Amend Section 27-104-13, Mississippi Code Of 1972, To Clarify That The Joint Legislative Budget Committee Adopts The General Fund Revenue Estimate; To Require The Legislative Budget Office To Prepare A Multiyear Financial Plan Beginning With Fiscal Year 2021; To Amend Sections 27-103-125 And 27-103-139, Mississippi Code Of 1972, To Conform To The Preceding Provisions; And For Related Purposes."}, "4": {"bill_id": 1017989, "number": "HB5", "change_hash": "732cbf2a9ef3ae6577ce267b7528dcac", "url": "https://legiscan.com/MS/bill/HB5/2017/X1", "status_date": "2017-06-07", "status": 4, "last_action_date": "2017-06-07", "last_action": "Approved by Governor", "title": "Secretary of State; revise FY17 appropriation to require to make payments due under Point Cadet Settlement Agreement.", "description": "An Act To Amend Chapter 25, Laws Of 2016 (senate Bill No. 2916), To Revise The Appropriation To The Office Of The Secretary Of State For Fiscal Year 2017 To Direct The Secretary Of State To Make The Payments Due In Accordance With The Point Cadet Compromise And Settlement Agreement."}, "5": {"bill_id": 1017978, "number": "HB6", "change_hash": "34f71daa5e55619c9b20a51df9bdc05f", "url": "https://legiscan.com/MS/bill/HB6/2017/X1", "status_date": "2017-06-07", "status": 4, "last_action_date": "2017-06-07", "last_action": "Approved by Governor", "title": "Appropriation; Secretary of State for making distribution to local governments for back taxes owed.", "description": "An Act Making An Appropriation To The Secretary Of The State For The Purpose Of Making Distributions To Local Governments For Back Taxes Owed For The 2017 Fiscal Year; And Making A Reappropriation To The Secretary Of State For The Purpose Of Reauthorizing The Expenditure Of State General Funds That Are Unexpended As Of June 30, 2017, For The Same Purposes As Authorized For Expenditures From The Land Records Maintenance Fund, For Fiscal Year 2018."}, "6": {"bill_id": 1017973, "number": "HR1", "change_hash": "ceb5f044bd4e3b46a0945be7ecd674c9", "url": "https://legiscan.com/MS/bill/HR1/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Representative Karl Oliver; urge at least two-thirds to vote to expel as a member of the Mississippi House.", "description": "A Resolution Urging At Least Two-thirds Of The Members Of The House Of Representatives To Vote To Expel Representative Karl Oliver Due To The Incendiary And Racially Offensive Public Statements He Made Regarding \"lynching\" Of \"leadership\" Responsible For Removal Of Confederate Statues In New Orleans."}, "7": {"bill_id": 1017993, "number": "HR2", "change_hash": "66cde947c22f1a2fc202b87afdf17e4f", "url": "https://legiscan.com/MS/bill/HR2/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Lincoln County Deputy Sheriff Donald \"William\" Durr; commend the life of upon his passing in the line of duty.", "description": "A Resolution Commending The Life And Legacy Of Fallen Lincoln County Deputy Sheriff Donald \"william\" Durr And Expressing Deepest Sympathy To His Family And Friends Upon His Passing."}, "8": {"bill_id": 1017961, "number": "HR3", "change_hash": "926216a389d03b81b751995012a82720", "url": "https://legiscan.com/MS/bill/HR3/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Rhonda Thomas; commend upon retirement as Victims Assistance Coordinator after 23 years.", "description": "A Resolution Commending Rhonda Thomas For Her Many Years Of Dedicated Service To The Citizens Of Leake, Neshoba, Newton And Scott Counties And Congratulating Her Upon Her Retirement As Victims Assistance Coordinator For The District Attorney's Office Of The Eighth Circuit Court District Of The State Of Mississippi After 23 Years Of Exemplary Service."}, "9": {"bill_id": 1017992, "number": "HR4", "change_hash": "e2a9478583ec0ba67e5a4fc33ddf0740", "url": "https://legiscan.com/MS/bill/HR4/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Sgt. Kyle Clayton Thomas; commemorate meritorious service and express sympathy upon passing.", "description": "A Resolution Commemorating The Life, Legacy And Meritorious Service Of Sergeant Kyle Clayton Thomas As A National Guardsman And Expressing Sympathy To His Family Upon His Passing."}, "10": {"bill_id": 1017985, "number": "HR5", "change_hash": "00ac3a619dac9d5ae16c37e9bbe8212a", "url": "https://legiscan.com/MS/bill/HR5/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Ward Emling; commend upon the occasion of his retirement from the Mississippi Film Office.", "description": "A Resolution Paying Tribute To The Career And Contributions Of Mr. Ward Emling, The Longest-serving National And International Film Commissioner, Upon The Occasion Of His Retirement After 30 Years As Director Of The Mississippi Film Office."}, "11": {"bill_id": 1018037, "number": "HR6", "change_hash": "cf37772c54a903450f18c1c323e08014", "url": "https://legiscan.com/MS/bill/HR6/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Public Historically Black Universities and Colleges within the state; urge certain support of.", "description": "A Resolution Urging Support Of Mississippi's Public Historically Black Colleges And Universities And Urging Action To Protect And Upgrade Such Colleges And Universities."}, "12": {"bill_id": 1017963, "number": "HC1", "change_hash": "8cac0490a2d54331dbf5dc65e6c279e2", "url": "https://legiscan.com/MS/bill/HC1/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "United Nations Day; recognize and observe on October 24, 2017.", "description": "A Concurrent Resolution To Acknowledge And Observe October 24, 2017, As \"united Nations Day\" And To Encourage The Citizens Of Mississippi To Commemorate Its Observance On October 24, 2017."}, "13": {"bill_id": 1017957, "number": "HC2", "change_hash": "bc1d389ed0af64c24a79067521f85923", "url": "https://legiscan.com/MS/bill/HC2/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Forest Baptist Church; commend and congratulate on the occasion of its 150th anniversary.", "description": "A Concurrent Resolution Commending And Congratulating Forest Baptist Church Upon The Occasion Of Its Sesquicentennial Anniversary, Acknowledging The Celebration Of 150 Years Of Devout Faith And Spiritual Excellence."}, "14": {"bill_id": 1017971, "number": "HC3", "change_hash": "aa4df672f5d52e8a2c7573ff0d087b44", "url": "https://legiscan.com/MS/bill/HC3/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Mayor Greg Butler; commend his public service upon his retirement as Mayor of the City of Morton.", "description": "A Concurrent Resolution Commending The Distinguished Career And Meritorious Leadership And Service That Mayor Greg Butler Provided As Mayor Of The City Of Morton Upon The Occasion Of His Retirement."}, "15": {"bill_id": 1017982, "number": "HC4", "change_hash": "23bd90cc7217687bed74c40b10b84834", "url": "https://legiscan.com/MS/bill/HC4/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Sgt. Kyle C. Thomas; commemorate meritorious service and express sympathy upon passing.", "description": "A Concurrent Resolution Commemorating The Life, Legacy And Meritorious Service Of Sergeant Kyle Clayton Thomas As A National Guardsman And Expressing Sympathy To His Family Upon His Passing."}, "16": {"bill_id": 1017942, "number": "SB2001", "change_hash": "c8f58609d81568623bd6149232409376", "url": "https://legiscan.com/MS/bill/SB2001/2017/X1", "status_date": "2017-06-23", "status": 4, "last_action_date": "2017-06-23", "last_action": "Approved by Governor", "title": "Deposit of state agency special funds into the State General Fund; make technical amendments.", "description": "An Act To Amend Section 27-104-203, Mississippi Code Of 1972, To Authorize State Agencies To Charge Each Other For Services If Federal Grants, Pass-through Funds, Cost Allocation Charges, Surplus Property Charges Or Project Fees Are Involved; To Amend Section 27-104-205, Mississippi Code Of 1972, To Provide That Certain Special Funds Shall Be Exempt From The Requirement That All Special Funds Are To Be Deposited Into The State General Fund; To Amend Sections 7-3-59, 23-15-169.7, 23-15-5 And 79-29-1203, Mississippi Code Of 1972, To Clarify That The End Of Year Balance Of The Help Mississippi Vote Fund And The Elections Support Fund Shall Be Deposited Into The State General Fund And The Program Shall Be Administered From Appropriations From The State General Fund; To Amend Section 7-5-305, Mississippi Code Of 1972, To Clarify That The Expenses Of The Insurance Integrity Enforcement Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Sections 9-11-35 And 21-23-23, Mississippi Code Of 1972, To Provide That The Mississippi Department Of Revenue Shall Administer The Justice Court Collections Payment Program And The Municipal Court Collections Payment Program; To Delete The Justice Court Collections Special Fund; To Delete The Municipal Court Collections Special Fund; To Amend Section 11-46-17, Mississippi Code Of 1972, To Provide That The Tort Claims Board Shall Be Exempt From The Requirement That Special Funds Are To Be Deposited Into The State General Fund And From The Prohibition Against Charging Fees; To Amend Sections 25-31-41 And 99-19-72, Mississippi Code Of 1972, To Clarify That The District Attorneys Operation Fund Shall Be Deposited Into The State General Fund And The Expenses Of The District Attorneys Shall Be Defrayed By Appropriation From The State General Fund; To Amend Sections 27-19-99 And 27-19-155, Mississippi Code Of 1972, To Provide That License Plates And Decal Fees Shall Be Deposited Into The State General Fund; To Amend Section 27-19-179, Mississippi Code Of 1972, To Clarify That The Expenses Of The Department Of Revenue License Tag Acquisition Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 27-104-21, Mississippi Code Of 1972, To Provide That Revenue From The Statewide Cost Allocation (swca) Plan Shall Only Be Used By The Department Of Finance And Administration For The Maintenance Of State-owned Property; To Amend Section 29-1-95, Mississippi Code Of 1972, To Provide That The Proceeds From Tax Sales In The Land Records Maintenance Fund Administered By The Secretary Of State Used To Pay Taxes Due To Local Governmental Entities Shall Be Exempt From The Requirement That All Special Funds Are To Be Deposited Into The State General Fund; To Amend Sections 37-26-3 And 37-26-9, Mississippi Code Of 1972, To Clarify That The Expenses Of The State Court Education Fund And The State Prosecutor Education Fund And The State Court Constituents Fund And The State Court Security Systems Fund Programs Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 37-26-11, Mississippi Code Of 1972, To Clarify That The Expenses Of The Children's Advocacy Centers Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 43-19-61, Mississippi Code Of 1972, To Clarify That The Expenses Of The Legal Division Of The Child Support Unit Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer And To Delete Reference To Certain Trust Funds; To Amend Section 43-47-39, Mississippi Code Of 1972, To Clarify That The Expenses Of The Vulnerable Persons Unit Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 45-2-21, Mississippi Code Of 1972, To Clarify That The Expenses Of The Law Enforcement Officers And Firefighters Disabilities Benefits Fund Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 45-6-21, Mississippi Code Of 1972, To Clarify That The Expenses Of The Motorcycle Officers Training Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 53-1-77, Mississippi Code Of 1972, To Clarify That The Expenses Of The Emergency Plugging Program And The Oil And Gas Conservation Fund Program Shall Be Defrayed By Appropriation From The State General Fund With Certain Exceptions, And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 27-103-303, Mississippi Code Of 1972, To Increase The Individual Project Cap On Expenditures From The Capital Expense Fund; To Amend Section 71-3-73, Mississippi Code Of 1972, To Provide That The Assessments Authorized For The Second Injury Trust Fund Shall Be Exempt From The Requirement That Special Funds Are To Be Deposited Into The State General Fund; To Amend Sections 71-3-95, 71-3-97, 71-3-99 And 71-3-100, Mississippi Code Of 1972, To Clarify That The Expenses Of The Mississippi Workers' Compensation Commission Shall Be Defrayed By Appropriation From The State General Fund; To Amend Sections 73-31-7, 73-75-11 And 73-75-27, Mississippi Code Of 1972, To Provide That Effective July 1, 2018, The Mississippi Autism Board Be Assigned To The State Board Of Psychology For Administrative Support, And To Clarify That The Expenses Of The Behavior Analyst Licensure Law Shall Continue To Be Defrayed From Assessments Deposited In A Special Fund; To Amend Section 75-57-119, Mississippi Code Of 1972, To Clarify That The Propane Education And Research Fund Shall Be Exempt From The Requirement That Special Funds Are To Be Deposited Into The State General Fund; To Amend Section 75-63-81, Mississippi Code Of 1972, To Provide That The Preneed Contracts Loss Recovery Fund Shall Be Exempt From The Requirement That Special Funds Be Diverted Into The State General Fund And To Provide That No Such Funds May Be Used In The Administration Of This Program; To Amend Section 77-1-6, Mississippi Code Of 1972, To Clarify That The Public Service Commission Regulation Fund Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 77-3-87, Mississippi Code Of 1972, To Clarify That The Amount Of The Public Utilities Regulatory Assessment Shall Not Exceed The Total Legislative Appropriation And That The Proceeds Of Such Assessment Shall Be Deposited Into The State Treasury For The Credit Of The General Fund; To Amend Section 77-3-721, Mississippi Code Of 1972, To Clarify That The Mississippi Telephone Solicitation Regulation Fund Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 93-21-31, Mississippi Code Of 1972, To Clarify That The Expenses Of The Domestic Violence Division Of The Office Of Attorney General Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 97-3-54.8, Mississippi Code Of 1972, To Clarify That The Expenses Of The Relief For Victims Of Human Trafficking Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Sections 97-33-51 And 97-33-101, Mississippi Code Of 1972, To Clarify That The Charitable Bingo Fund Shall Be Diverted Into The State General Fund And The Charitable Bingo Law Shall Be Administered By Appropriation From The State General Fund; To Amend Section 97-45-25, Mississippi Code Of 1972, To Clarify That The Expenses Of The Attorney General's Cyber Crime Central Special Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; To Amend Section 99-41-29, Mississippi Code Of 1972, To Clarify That The Expenses Of The Crime Victims Compensation Fund Program Shall Be Defrayed By Appropriation From The State General Fund And All Fees Authorized Under This Program Shall Be Deposited Into The State General Fund As Determined By The State Fiscal Officer; And For Related Purposes."}, "17": {"bill_id": 1017951, "number": "SB2002", "change_hash": "68aaf8877b82996d567d372d382a0765", "url": "https://legiscan.com/MS/bill/SB2002/2017/X1", "status_date": "2017-06-23", "status": 4, "last_action_date": "2017-06-23", "last_action": "Approved by Governor", "title": "State budgets and reserve funds; create Financial and Operational Responses That Invigorate Future Years (FORTIFY) Act.", "description": "An Act To Create The \"financial And Operational Responses That Invigorate Future Years Act (fortify Act)\"; To Amend Section 27-103-203, Mississippi Code Of 1972, As Amended By Senate Bill No. 2649, 2017 Regular Session, To Increase The Cap On The Working Cash-stabilization Reserve Fund From 7.5% To 10% Of Current Fiscal Year General Fund Appropriations; To Amend Section 27-103-211, Mississippi Code Of 1972, As Amended By Senate Bill No. 2649, 2017 Regular Session, To Clarify That Unencumbered Cash Remaining At The End Of A Fiscal Year Is Not Included With The General Fund Revenue Estimate When Determining The Limit On The Legislative General Fund Appropriation; To Amend Section 27-103-213, Mississippi Code Of 1972, To Revise The Distribution Method Of Unencumbered Cash Balance; To Amend Section 27-104-13, Mississippi Code Of 1972, To Clarify That The Joint Legislative Budget Committee Adopts The General Fund Revenue Estimate; To Require The Legislative Budget Office To Prepare A Multiyear Financial Plan; To Amend Sections 27-103-125 And 27-103-139, Mississippi Code Of 1972, To Conform To The Preceding Provisions; And For Related Purposes."}, "18": {"bill_id": 1017936, "number": "SB2003", "change_hash": "b803092f40a14cc36fcb89efa14ba640", "url": "https://legiscan.com/MS/bill/SB2003/2017/X1", "status_date": "2017-06-07", "status": 4, "last_action_date": "2017-06-07", "last_action": "Approved by Governor", "title": "Appropriation; Transportation, Department of - State Aid Road Construction, Office of.", "description": "An Act Making An Appropriation For The Support And Maintenance Of The Office Of State Aid Road Construction Of The Mississippi Department Of Transportation For Fiscal Year 2018."}, "19": {"bill_id": 1017946, "number": "SR1", "change_hash": "d8861d31e8cd024632a4fcd28181ca9b", "url": "https://legiscan.com/MS/bill/SR1/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Pay tribute to contributions of Ward Emling upon the occasion of his retirement after 30 years as Director of Mississippi Film Office.", "description": "A Resolution Paying Tribute To The Career And Contributions Of Ward Emling, The Longest-serving National And International Film Commissioner, Upon The Occasion Of His Retirement After 30 Years As Director Of The Mississippi Film Office."}, "20": {"bill_id": 1018004, "number": "SR2", "change_hash": "b4135dd9b196ff707d8c687a3cda983b", "url": "https://legiscan.com/MS/bill/SR2/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Extend deepest sympathy to surviving family of Lincoln County Deputy Sheriff William Durr.", "description": "A Resolution Expressing The Profound Sorrow On The Loss Of Lincoln County Deputy Sheriff William Durr While On Official Duty And Extending Our Deepest Sympathy To His Bereaved Family."}, "21": {"bill_id": 1018017, "number": "SR3", "change_hash": "350b5a54e9b4f51a7541ff2ba9b4e9b3", "url": "https://legiscan.com/MS/bill/SR3/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend life of Mississippi National Guard casualty, Sergeant Kyle Thomas.", "description": "A Resolution Remembering The Gallant Service And Commending The Life Of Mississippi Army National Guard Sergeant Kyle Thomas Of Amory, Mississippi, Who Was Lost In A Training Exercise In California On Monday, May 29, 2017."}, "22": {"bill_id": 1018026, "number": "SR4", "change_hash": "e02604260fd8b2da15e7c879b6e915d7", "url": "https://legiscan.com/MS/bill/SR4/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Pay tribute to the memory of longtime Mental Health Administrator Dr. Paul Cotten, Sr.", "description": "A Resolution Paying Tribute To The Memory Of Longtime Mental Health Administrator And Ellisville Community Leader Dr. Paul Cotten, Sr., And Extending The Condolences Of The Mississippi Legislature To His Surviving Family On His Passing."}, "23": {"bill_id": 1018014, "number": "SR5", "change_hash": "306f13d601721b23f1471eafdb98029a", "url": "https://legiscan.com/MS/bill/SR5/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Pay tribute to Ole Miss Softball Team &amp; Mike Smith for winning SEC Championship and Regional for the first time in school history.", "description": "A Resolution Paying Tribute To The Ole Miss Softball Team, Head Coach Mike Smith And Star Pitcher Kaitlin Lee For Winning The Sec Championship, Hosting And Winning The Ncaa Regional Championship, And Advancing To The Super Regionals For The First Time In School History."}, "24": {"bill_id": 1018025, "number": "SR6", "change_hash": "b1470b60549d8627f0de1f75461512a6", "url": "https://legiscan.com/MS/bill/SR6/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Congratulate MSU First Baseman Brent Rooker as winner of C Spire Ferriss Trophy and as first Bulldog SEC Player of the Year.", "description": "A Resolution Congratulating Mississippi State University Spectacular First Baseman Brent Rooker For Winning The 2017 C Spire Ferriss Trophy, As The First Bulldog Named Sec Player Of The Year, First Team All-american Baseball America Player Of Year And First Sec Player To Set Triple Crown Statistical Records."}, "25": {"bill_id": 1018009, "number": "SR7", "change_hash": "754bfeb4033710dcd521480e9ae9ef8b", "url": "https://legiscan.com/MS/bill/SR7/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend Ole Miss Sophomore Braden Thornberry for winning the 2017 Men's NCAA Individual Golf National Championship.", "description": "A Resolution Commending And Congratulating Ole Miss Sophomore Standout Braden Thornberry For Winning The University's First-ever 2017 Men's Ncaa Individual Golf National Championship."}, "26": {"bill_id": 1018007, "number": "SR8", "change_hash": "0ff5cdc047dc61cb02195addc5aca397", "url": "https://legiscan.com/MS/bill/SR8/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend MDCPS Commissioner David A. Chandler for National Foster Care Program Progress Award.", "description": "A Resolution Commending Mississippi Department Of Child Protection Services Commissioner David A. Chandler Upon His Receipt Of The National Council For Adoption Babineaux Award For Exceptional Leadership On Behalf Of Children In Mississippi's Foster Care System."}, "27": {"bill_id": 1018020, "number": "SR9", "change_hash": "2618a222f6a2820dfbcc5387b3ed3a3b", "url": "https://legiscan.com/MS/bill/SR9/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Congratulate Southern Pipe &amp; Supply in Meridian as FORTUNE Magazine Top 100 Company.", "description": "A Resolution Congratulating Southern Pipe &amp; Supply In Meridian, Mississippi, Upon Being Named By Fortune Magazine As A \"top 100 Medium-sized Company To Work For In The United States.\""}, "28": {"bill_id": 1018011, "number": "SR10", "change_hash": "fb96da95c8cbf2165f22338b10de6e4f", "url": "https://legiscan.com/MS/bill/SR10/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize distinguished prosecutorial service of Hon. Felicia Adams as first African-American U.S. Attorney for Northern District.", "description": "A Resolution Recognizing The Distinguished Prosecutorial Service Of United States Attorney For The Northern District Of Mississippi Felicia C. Adams Who Was The First African-american Attorney To Serve In This Post."}, "29": {"bill_id": 1018046, "number": "SR11", "change_hash": "ed3343cc20fe0e2b66afefd34920bf1d", "url": "https://legiscan.com/MS/bill/SR11/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize distinguished prosecutorial service of Hon. Gregory Davis as first African-American U.S. Attorney for Southern District.", "description": "A Resolution Recognizing The Distinguished Prosecutorial Service Of United States Attorney For The Southern District Of Mississippi Gregory K. Davis Who Was The First African-american Attorney To Serve In This Post."}, "30": {"bill_id": 1018052, "number": "SR12", "change_hash": "dcce0400af2c9eb6639f09576a1d1502", "url": "https://legiscan.com/MS/bill/SR12/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize legacy of leadership and service of Coldwater Mayor Vernon Jackson.", "description": "A Resolution Recognizing The Legacy Of Leadership And Public Service And Military Service Of Coldwater, Mississippi, Mayor Vernon Jackson As He Retires From Office."}, "31": {"bill_id": 1018034, "number": "SR13", "change_hash": "0ae855e2a6a22717645149fec14d26e0", "url": "https://legiscan.com/MS/bill/SR13/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize legacy of leadership and service of Mary Houston, the first female Mayor of the Town of Potts Camp, Mississippi.", "description": "A Resolution Recognizing The Legacy Of Leadership And Public Service Of Mary Houston, The First Female Mayor Of The Town Of Potts Camp, Mississippi, As She Retires From Office."}, "32": {"bill_id": 1018028, "number": "SR14", "change_hash": "b040b4fe5b4c7a4862308a160119c9db", "url": "https://legiscan.com/MS/bill/SR14/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize legacy of leadership and service of Alderman Richard Minor of Byhalia.", "description": "A Resolution Recognizing The Legacy Of Leadership And Public Service Of Alderman Richard Minor Of Byhalia, Mississippi, As He Retires From Office."}, "33": {"bill_id": 1018031, "number": "SR15", "change_hash": "234e074b55787d93032c742d2f9ef09d", "url": "https://legiscan.com/MS/bill/SR15/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize 150th Anniversary of Strawberry Missionary Baptist Church in Marshall County, Mississippi.", "description": "A Resolution Congratulating And Extending Greetings To Reverend Arthur Fitzpatrick And The Congregation Of Strawberry Missionary Baptist Church In Marshall County, Mississippi, On The Occasion Of Its 150th Anniversary Celebration (1867-2017)."}, "34": {"bill_id": 1017999, "number": "SR16", "change_hash": "9c3adaa15d91e2f8ddb0529e5c21e8e9", "url": "https://legiscan.com/MS/bill/SR16/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend Pearl River Central High School \"Blue Angels\" Dance Team for winning consecutive MHSAA State Competitions.", "description": "A Resolution Commending And Congratulating The Pearl River Central High School \"blue Angels\" Dance Team And Coach Sadie Penton For Winning Mhsaa State Varsity Dance Competitions In Four Consecutive Years (2013-2016)."}, "35": {"bill_id": 1017997, "number": "SR17", "change_hash": "b0c6eb6bfe605f254039f12cbb2c4984", "url": "https://legiscan.com/MS/bill/SR17/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend Pearl River Central \"Blue Devils\" Baseball Team for first-ever State Championship.", "description": "A Resolution Commending And Congratulating The Pearl River Central \"blue Devils\" Baseball Team And Coach Neil Walther For Winning Their First-ever State 5a Championship."}, "36": {"bill_id": 1017995, "number": "SR18", "change_hash": "5394dbc7bb9f37c5975780d432c5669a", "url": "https://legiscan.com/MS/bill/SR18/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize the 35th Anniversary of Caterpillar, Inc., operations in Mississippi.", "description": "A Resolution Saluting And Extending The Congratulations Of The Mississippi Legislature To Caterpillar, Inc., On Its 35th Anniversary Of Operations In Mississippi."}, "37": {"bill_id": 1018022, "number": "SR19", "change_hash": "2085f9f647035fb0db6c975a3eca345b", "url": "https://legiscan.com/MS/bill/SR19/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend Tupelo High School \"Golden Wave\" Baseball Team for MHSAA Class 6A State Championship.", "description": "A Resolution Commending And Congratulating The Tupelo High School \"golden Wave\" Baseball Team And Head Coach Justin Reed For Winning Their First Mhsaa Class 6a State Championship In 24 Years."}, "38": {"bill_id": 1018044, "number": "SR20", "change_hash": "d606b4576937a3579f3c9b984b1acfdb", "url": "https://legiscan.com/MS/bill/SR20/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend 25 Senior Class Eagle Scouts from Jackson Academy.", "description": "A Resolution Congratulating The 25 Eagle Scouts From The 2016-2017 Senior Class At Jackson Academy And Commending The Important Scouting Tradition At This Excellent Institution."}, "39": {"bill_id": 1018002, "number": "SR21", "change_hash": "f473e06b60a2441ec15fcefac507ff90", "url": "https://legiscan.com/MS/bill/SR21/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize legacy of leadership and service of longtime Mayor V.O. Smith of Collins, Mississippi.", "description": "A Resolution Recognizing The Legacy Of Leadership And Public Service Of Collins, Mississippi, Mayor V.o. Smith As He Leaves Office."}, "40": {"bill_id": 1018049, "number": "SR22", "change_hash": "38db0c2eb814d07f759bb6aff05b6181", "url": "https://legiscan.com/MS/bill/SR22/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize Holly Springs, Mississippi, on the 180th Anniversary of this historic North Mississippi trade center.", "description": "A Resolution Joining The Citizens Of Holly Springs, Mississippi, In Celebrating The 180th Anniversary Of The City."}, "41": {"bill_id": 1018054, "number": "SR23", "change_hash": "df3392d025513b274519ed5492a3af6f", "url": "https://legiscan.com/MS/bill/SR23/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Recognize U.S. Navy Seabees on their Diamond (75th) Anniversary Celebration.", "description": "A Resolution Recognizing The U.s. Navy Seabees On The Occasion Of Their Diamond (75th) Anniversary Celebration."}, "42": {"bill_id": 1018042, "number": "SR24", "change_hash": "5814dc0c0dede02fb7c351919dd7e7ee", "url": "https://legiscan.com/MS/bill/SR24/2017/X1", "status_date": "2017-06-05", "status": 2, "last_action_date": "2017-06-05", "last_action": "Adopted", "title": "Commend Columbia Academy \"Cougars\" Baseball Team for MAIS AAA State Championship.", "description": "A Resolution Commending And Congratulating The Columbia Academy \"cougars\" Baseball Team And Coach Heath Smith For Their First Mais Aaa State Championship In 21 Seasons."}, "43": {"bill_id": 1017930, "number": "SC501", "change_hash": "7dfd960b38cc61dcbbb5cf6ea871e5b5", "url": "https://legiscan.com/MS/bill/SC501/2017/X1", "status_date": "2017-06-05", "status": 6, "last_action_date": "2017-06-05", "last_action": "Died In Committee", "title": "Extend deepest sympathy of Legislature to surviving family of Lincoln County Deputy Sheriff William Durr.", "description": "A Concurrent Resolution Expressing The Profound Sorrow Of The Legislature On The Loss Of Lincoln County Deputy Sheriff William Durr While On Official Duty And Extending Our Deepest Sympathy To His Bereaved Family."}, "53": {"bill_id": 1017950, "number": "SC511", "change_hash": "e3c7203a373ef0a626d65747118d1c83", "url": "https://legiscan.com/MS/bill/SC511/2017/X1", "status_date": "2017-06-06", "status": 6, "last_action_date": "2017-06-06", "last_action": "Died On Calendar", "title": "Recognize distinguished prosecutorial service of Hon. Gregory Davis as first African-American US Attorney for Southern District.", "description": "A Concurrent Resolution Recognizing The Distinguished Prosecutorial Service Of United States Attorney For The Southern District Of Mississippi Gregory K. Davis Who Was The First African-american Attorney To Serve In This Post."}, "65": {"bill_id": 1017941, "number": "SC523", "change_hash": "96b85d01291fdb99bd77072abba68a0b", "url": "https://legiscan.com/MS/bill/SC523/2017/X1", "status_date": "2017-06-06", "status": 6, "last_action_date": "2017-06-06", "last_action": "Died In Committee", "title": "Call upon Representative Karl Oliver (District 46) to resign from the Mississippi Legislature.", "description": "A Concurrent Resolution Expressing Profound Outrage At The Recent Facebook Remarks By Mississippi Representative Karl Oliver (district 46) And Calling Upon Representative Oliver To Resign From The Mississippi Legislature Immediately."}}