{"session": {"session_id": 1605, "state_id": 24, "year_start": 2018, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2018 1st Special Session", "session_name": "2018 First Extraordinary Session"}, "0": {"bill_id": 1125586, "number": "HB1", "change_hash": "bd134f9b92149dcab7c7c57daf7cd564", "url": "https://legiscan.com/MS/bill/HB1/2018/X1", "status_date": "2018-08-29", "status": 4, "last_action_date": "2018-08-29", "last_action": "Approved by Governor", "title": "Mississippi Infrastructure Modernization Act of 2018; create.", "description": "An Act To Create The Mississippi Infrastructure Modernization Act Of 2018; To Amend Section 27-67-31, Mississippi Code Of 1972, To Provide That A Portion Of State Use Tax Revenue Shall Be Deposited Into Special Funds In The State Treasury And Used To Assist Municipalities And Counties In Paying Costs Associated With Repair, Maintenance And Reconstruction Of Roads, Streets And Bridges; To Provide That A Portion Of State Use Tax Revenue Shall Be Deposited Into The Local System Bridge Replacement And Rehabilitation Fund; To Amend Section 65-37-15, Mississippi Code Of 1972, To Authorize Funds In The Local System Bridge Replacement And Rehabilitation Fund To Be Used For Local Bridges In Certain Circumstances; To Require The Mississippi Department Of Transportation To Direct By Written Notice Any Local Governing Boards To Close Any Bridge Under Its Jurisdiction That Must Be Closed To Prevent The Reduction In Federal Transportation Funding To The State; To Impose An Annual Tax On Electric Vehicles And Hybrid Vehicles In Addition To Any Other Taxes For Which The Vehicles Are Liable; To Provide That The Tax On Electric Vehicles And Hybrid Vehicles Shall Be Paid To The County Tax Collector At The Same Time And In The Same Manner As The Annual Highway Privilege Tax Is Paid; To Provide That The Tax Collector Shall Remit The Proceeds Of The Taxes To The Department Of Revenue And That The Department Shall Apportion The Proceeds Of The Taxes Among The Various Purposes Specified For Gasoline And Diesel Fuel Taxes In The Same Proportion That Those Taxes Were Apportioned For Those Purposes During The Previous State Fiscal Year; To Amend Section 1, Chapter 479, Laws Of 2015, To Authorize The Issuance Of Additional Revenue Bonds Under Such Law And To Provide That The Proceeds Of The Additional Bonds Shall Be Deposited Into The Emergency Road And Bridge Repair Fund And The 2018 Transportation And Infrastructure Improvements Fund Created In This Act; To Create In The State Treasury A Special Fund To Be Known As The \"emergency Road And Bridge Repair Fund\"; To Provide That Money In The Fund Shall Be Utilized By The Mississippi Department Of Transportation, With The Advice Of The Emergency Road And Bridge Repair Fund Advisory Board; To Provide Funding For Emergency Repairs To Roads, Streets And Highways In This State And Emergency Bridge Repairs On Public Roads, Streets And Highways In This State; To Create The Emergency Road And Bridge Repair Fund Advisory Board And Provide For Its Membership; To Provide That The Emergency Road And Bridge Repair Fund Advisory Board Shall Provide Nonbinding Advice To The Department Of Transportation Regarding The Expenditure Of Money In The Emergency Road And Bridge Repair Fund; To Create In The State Treasury A Special Fund To Be Known As The \"2018 Transportation And Infrastructure Improvements Fund\"; To Provide That Monies In The Fund Shall Be For Infrastructure Projects And/or Other Projects That Are Economically Beneficial That Are Otherwise Provided By Law To Be Funded By Monies In This Fund; To Amend Section 49-17-407, Mississippi Code Of 1972, To Delete The Provision That Provides For The Abatement Of The Environmental Protection Fee Levied On Bonded Distributors Of Motor Fuel When The Unobligated Balance In The Mississippi Groundwater Protection Trust Fund Reaches Or Exceeds $10,000,000.00; To Provide That When The Unobligated Balance In The Mississippi Groundwater Protection Trust Fund Reaches Or Exceeds $10,000,000.00, The Department Of Revenue Shall Deposit The Revenue Derived From The Environmental Protection Fee Into The State Highway Fund; To Amend Section 75-76-129, Mississippi Code Of 1972, To Require Fees Collected Through December 31, 2028, Under The Gaming Control Act As A Result Of Wagers On Sporting Events Shall Be Deposited Into The State Highway Fund To Be Used Solely For The Repair And Maintenance Of State Highways; To Amend Section 19-11-27, Mississippi Code Of 1972, To Allow County Boards Of Supervisors To Expend Monies During 2019 On Deficient Bridges Of The County In The State Aid Road System Or The Local System Road Program That Have A Sufficiency Rating Of Less Than Fifty During The Last Term Of Office Of Such Boards; To Require The Department Of Audit To Audit Or Enter Into Contracts For A Performance Audit Of Any Projects Under The Mississippi Department Of Transportation; And For Related Purposes."}, "1": {"bill_id": 1125614, "number": "HB2", "change_hash": "b2b5b9ae4916307191cacc2c03309071", "url": "https://legiscan.com/MS/bill/HB2/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died In Committee", "title": "Gaming; create state lottery to fund higher education scholarship program.", "description": "An Act To Establish A State Lottery To Be Known As The \"mississippi Lottery For Education,\" A State Lottery To Be Administered By The Mississippi Gaming Commission; To Provide The Powers And Duties Of The Mississippi Gaming Commission Regarding The Administration Of The State Lottery; To Provide That The Purpose Of The Lottery Is To Fund The Mississippi Hope Scholarship Program; To Create The Mississippi Hope Scholarship Trust Fund; To Provide For The Allocation Of The Proceeds Collected From The Sale Of Lottery Tickets In The State, After Deducting Certain Administrative And Prize Expenses; To Require Forty-five Percent Of The Proceeds Collected From The Sale Of Lottery Tickets In The State To Be Allocated As Prize Money; To Require A Percentage Of The Proceeds From The Sale Of Lottery Tickets Within A County To Be Distributed To That County; To Require The Remainder Of The Net Proceeds To Be Deposited Into The Mississippi Hope Scholarship Trust Fund; To Amend Sections 37-106-5, 67-1-71, 75-76-3, 75-76-5, 97-33-9, 97-33-11, 97-33-13, 97-33-21, 97-33-23, 97-33-31, 97-33-33, 97-33-35, 97-33-37, 97-33-39, 97-33-41, 97-33-43, 97-33-45, 97-33-47 And 97-33-49, Mississippi Code Of 1972, In Conformity To The Provisions Of This Act; And For Related Purposes."}, "2": {"bill_id": 1125618, "number": "HB3", "change_hash": "62d03090b1239abbba0e55ebb53e038c", "url": "https://legiscan.com/MS/bill/HB3/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died In Committee", "title": "Taxpayer Pay Raise Act; freeze decreases in income and franchise tax rates and freeze increase in federal employment tax deductions.", "description": "An Act To Amend Section 27-7-5, Mississippi Code Of 1972, To Remove The Provisions That Decrease The Income Tax Rates For Calendar Years 2019 And Thereafter; To Amend Section 27-7-18, Mississippi Code Of 1972, To Remove The Provisions That Increase The Portion Of The Federal Self-employment Taxes Assessed Against Self-employed Individuals That May Be Allowed As An Adjustment To Gross Income Under The State Income Tax Law In Taxable Years Ending In 2019 And Thereafter; To Amend Sections 27-13-5 And 27-13-7, Mississippi Code Of 1972, To Remove The Provisions That Decrease The Franchise Tax Rate For Tax Years Beginning On Or After January 1, 2019; To Repeal Section 5, Chapter 499, Laws Of 2016, Which Repeals The Corporation Franchise Law From And After January 1, 2028; And For Related Purposes."}, "3": {"bill_id": 1125652, "number": "HR1", "change_hash": "4e74558d0f60a976b71b2fe93d4e8ea4", "url": "https://legiscan.com/MS/bill/HR1/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Mrs. Aretha Franklin; commend the life and musical legacy of upon her passing.", "description": "A Resolution Mourning The Loss And Commemorating The Life And Stellar Music Career Of The Irrefutable Queen Of Soul And Rhythm And Blues Legend Mrs. Aretha Louise Franklin And Expressing Deepest Sympathy To Her Family And Friends Upon Her Passing."}, "4": {"bill_id": 1125644, "number": "HR2", "change_hash": "d924544d67d2428a9bb765a9ad363362", "url": "https://legiscan.com/MS/bill/HR2/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Bertha Hill; commend life upon her passing.", "description": "A Resolution Mourning The Loss And Commemorating The Life, Legacy And Service Of Mrs. Bertha Ree Mcdonald Hill And Expressing Deepest Sympathy To Her Family And Friends Upon Her Passing."}, "5": {"bill_id": 1125658, "number": "HR3", "change_hash": "2b5c5ab5a8d47a67f50089db17f7fc08", "url": "https://legiscan.com/MS/bill/HR3/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Dr. Patrick Louis Pierce; commend life and legacy upon his passing.", "description": "A Resolution Mourning The Loss And Commemorating The Life And Legacy Of Dr. Patrick Louis Pierce."}, "6": {"bill_id": 1125640, "number": "HR4", "change_hash": "d205a205c8bbff8b238ad3d651bd2d28", "url": "https://legiscan.com/MS/bill/HR4/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Asya Branch; commend upon being crowned Miss Mississippi 2018.", "description": "A Resolution Commending Ms. Asya Branch Upon Being Crowned Miss Mississippi 2018."}, "7": {"bill_id": 1125664, "number": "HR5", "change_hash": "d9b82f26e127f1463d278cfb0dd1cf05", "url": "https://legiscan.com/MS/bill/HR5/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Thomas C. Tolliver Jr.; commend life and legacy upon his passing.", "description": "A Resolution Mourning The Loss And Commemorating The Life And Legacy Of Mr. Thomas C. Tolliver Jr. And Expressing Sincere And Deepest Sympathy To His Family And Friends Upon His Passing."}, "8": {"bill_id": 1125727, "number": "HR6", "change_hash": "789c69b78bd4dad75c9309749d7c7753", "url": "https://legiscan.com/MS/bill/HR6/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Honorable U.S. Senator John Sidney McCain III; commend distinguished career and esteemed public service upon his passing.", "description": "A Resolution Mourning The Loss And Commending The Distinguished Life, Public Service And Esteemed Career Of War Patriot, National Hero And American Politician Extraordinaire, The Honorable United States Senator John Sidney Mccain Iii, And Expressing Deepest Sympathy To His Family, Colleagues, Constituents And Friends Upon His Passing."}, "9": {"bill_id": 1125767, "number": "HR7", "change_hash": "2f31ea7b539cb275a4d8346f1034079a", "url": "https://legiscan.com/MS/bill/HR7/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Judge Edward C. Fenwick; commend upon the occasion of his retirement.", "description": "A Resolution Commending Judge Edward C. Fenwick For His Outstanding Professional Accomplishments Upon The Occasion Of His Retirement From The Sixth Chancery Court District Of Mississippi."}, "10": {"bill_id": 1125770, "number": "HR8", "change_hash": "29e2f12e11a1fb8c7bec6563a6887f4e", "url": "https://legiscan.com/MS/bill/HR8/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Peggy Oswalt; commend upon the occasion of her retirement from Renasant Insurance.", "description": "A Resolution Commending The Distinguished Career And Meritorious Leadership And Service That Mrs. Peggy Oswalt Provided As An Insurance Agent At Renasant Insurance Upon The Occasion Of Her Retirement."}, "11": {"bill_id": 1125575, "number": "SB2001", "change_hash": "4c7d7d749dbf66b1039eb44ed110daff", "url": "https://legiscan.com/MS/bill/SB2001/2018/X1", "status_date": "2018-08-31", "status": 4, "last_action_date": "2018-08-31", "last_action": "Approved by Governor", "title": "Lottery; create and establish the Mississippi Lottery Corporation to administer the lottery.", "description": "An Act To Create The Alyce G. Clarke Mississippi Lottery Law To Establish A State Lottery; To Create The Mississippi Lottery Corporation To Administer The State Lottery; To Provide That The Affairs Of The Corporation Shall Be Administered And Governed By A Board Of Directors Appointed By The Governor With The Advice And Consent Of The Senate; To Provide The Terms Of Office And Powers And Duties Of The Board; To Provide That The Mississippi Lottery Corporation Shall Be Managed By A President Selected By The Board With The Approval Of The Governor; To Provide That The President Shall Serve At The Pleasure Of The Board; To Provide For The Powers And Duties Of The President; To Authorize The Board To Employ Legal Counsel; To Require Background Investigation Of Applicants For Employment With The Corporation; To Provide For The Disposition Of Proceeds Received From The Sale Of Lottery Tickets; To Provide For Appeals By Retailers, Vendors Or Applicants Aggrieved By Decisions Of The President Or The Board Of Directors; To Prohibit The Sale Of Lottery Tickets To Anyone Under The Age Of 21; To Provide The Manner In Which Prizes May Be Paid And To Authorize The Voluntary Assignment Of Prizes; To Provide For The Selection Of Lottery Ticket Retailers And The Requirements That Must Be Met To Become A Retailer; To Provide That The Proceeds From The Sale Of Lottery Tickets And Received By A Lottery Retailer Shall Constitute A Trust; To Place Certain Requirements On Vendors Of Goods Or Services Necessary For The Implementation Of The State Lottery; To Provide For Criminal Background Investigations By The Mississippi Department Of Public Safety On Potential Vendors, Potential Retailers And Certain Employees Of The Corporation; To Make Unlawful Certain Acts With Regard To The State Lottery; To Provide For The Disposition Of Proceeds Received From The Sale Of Lottery Tickets; To Provide That The Net Proceeds Collected From The Sale Of Lottery Tickets Shall Be Deposited Into A Lottery Proceeds Fund Created In The State Treasury For Various Purposes; To Amend Section 7-7-211, Mississippi Code Of 1972, To Authorize The Department Of Audit To Review And Approve Any Independent Auditor Selected By The Mississippi Lottery Corporation To Conduct An Annual Audit Of The Corporation And To Conduct Audits Or Investigations Of The Mississippi Lottery Corporation If In The Opinion Of The State Auditor Conditions Justify Such Audits Or Investigations; To Amend Sections 25-9-107, 25-11-103, 25-41-3, 31-7-13, 67-1-71, 97-33-9, 97-33-11, 97-33-13, 97-33-21, 97-33-23, 97-33-31, 97-33-33, 97-33-35, 97-33-37, 97-33-39, 97-33-41, 97-33-43, 97-33-45, 97-33-47 And 97-33-49, Mississippi Code Of 1972, In Conformity To The Provisions Of This Act; And For Related Purposes."}, "12": {"bill_id": 1125737, "number": "SB2002", "change_hash": "2a9a7dffea51f22464577240db848b4a", "url": "https://legiscan.com/MS/bill/SB2002/2018/X1", "status_date": "2018-09-05", "status": 4, "last_action_date": "2018-09-05", "last_action": "Approved by Governor", "title": "BP Settlement Funds; deposit into State BP Settlement Fund and Gulf Coast Restoration Fund.", "description": "An Act Amend Section 27-103-302, Mississippi Code Of 1972, To Provide That From And After September 1, 2018, All Bp Oil Spill Settlement Funds Received By The State Shall Be Deposited Into The State Bp Settlement Fund And The Gulf Coast Restoration Fund; To Create A Special Fund In The State Treasury To Be Designated As The \"state Bp Settlement Fund\"; To Create A Special Fund In The State Treasury To Be Designated As The \"gulf Coast Restoration Fund\" (gcrf); To Provide That Monies In The Gcrf Shall Be Used, Upon Appropriation By The Legislature, To Provide Assistance To Applicants Through Programs Or Projects Authorized By This Act; To Provide That Monies In The Gcrf Shall Be Used Only For Programs Or Projects That Are Located In The Gulf Coast Region As Defined In The Federal Restore Act; To Create The Gulf Coast Restoration Fund Advisory Board To Provide Advice To Mda When Reviewing Applications For Assistance Under This Act; To Provide That The Mississippi Development Authority (mda) Shall Be The Administrator Of The Gcrf; To Authorize Mda To Carry Out Any Powers And Duties Authorized In This Act And Provide That Mda Shall Handle All Of The Day-to-day Matters Relating To The Gcrf; To Limit The Amount Of The Annual Administration Expenses Of Mda In Carrying Out Its Duties Under This Act; To Specify The Applicants Who Are Eligible For Assistance Under This Act; To Provide That Mda Shall Establish Criteria, Rules And Procedures For Accepting And Reviewing Applications For Assistance Under This Act; To Provide That Mda Shall Review, Compile, And Score All Timely Received Applications And Shall Present The Applications And Its Recommendations For Assistance To Individual Projects To The Legislature No Later Than December 1 Of The Year; To Provide That The Legislature Shall Determine Individual Projects That Will Be Funded By Separate Line Items In An Appropriation Bill; To Provide That Applications For Assistance Will Be Received Through Web Portals Set Up By Mda; To Authorize Mda To Establish Programs For Making Loans, Loan Guarantees, Grants And Any Other Financial Assistance To Applicants Whose Projects Are Approved For Assistance; To Specify The Applicants Who Are Eligible For Assistance Under These Programs; To Provide That Mda Shall Establish Programs And An Application Process To Provide Assistance To Applicants Who Prioritize Certain Types Of Projects; To Provide That Assistance Provided Under This Act May Not Be Used To Finance 100% Of The Cost Of Any Project; To Provide That Contracts Executed By Mda With Recipients Of Assistance Under This Act Must Include Provisions Requiring A Performance Report On The Contracted Activities; To Provide For Financial Audits Of Recipients Of Assistance Under This Act And Provide For Performance Audits Of Mda's Administration Of The Gcrf Under This Act; To Require Mda To File An Annual Report With Certain Legislative Officials And Lbo That Includes Detailed Information Regarding Receipts And Expenditures Of The Funds Received And Provided As Assistance Under This Act; To Require The State Treasurer To Transfer A Certain Amount Of Funds From The Budget Contingency Fund To The 2018 Transportation And Infrastructure Improvements Fund, Mississippi Highway-railroad Grade Crossing Safety Account And The Mississippi Railroad Improvements Fund; To Amend Section 9, House Bill No. 1, First Extraordinary Session Of 2018, To Provide That Money In The 2018 Transportation And Infrastructure Improvements Fund, Shall Be Disbursed, In The Discretion Of The Department Of Finance And Administration, For Certain Projects; To Specify The Projects For Which Money May Be Disbursed; And For Related Purposes."}, "13": {"bill_id": 1125789, "number": "SR1", "change_hash": "a2b1061fafcdf1118b3906fae6d29b62", "url": "https://legiscan.com/MS/bill/SR1/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Mourn the loss of Brad Dye and commend service.", "description": "A Resolution Mourning The Loss And Commending The Life And Public Service Of Bradford Johnson Dye, Jr., Long-time Legislator And Former Lieutenant Governor From Charleston, Mississippi, And Expressing The Sympathy Of The Legislature."}, "14": {"bill_id": 1125777, "number": "SR2", "change_hash": "13003aed217ba3fb6dea8fee72464b36", "url": "https://legiscan.com/MS/bill/SR2/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Mourn the loss of former State Senator and State Representative Dr. Bill Canon and commend his service.", "description": "A Resolution Mourning The Loss And Commending The Life And Public Service Of Former State Senator And State Representative Dr. William \"bill\" Canon Of Columbus, Mississippi, And Expressing The Sympathy Of The Senate."}, "15": {"bill_id": 1125792, "number": "SR3", "change_hash": "7b409e54b9e7b95487406bf9e524487c", "url": "https://legiscan.com/MS/bill/SR3/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Extend condolences of Senate and commend legacy of former Biloxi Mayor and Gulf Coast Civic Leader A.J. Holloway, Jr.", "description": "A Resolution Extending The Condolences Of The Senate To The Bereaved Family And Friends Of Former Biloxi Mayor And Mississippi Gulf Coast Civic Leader A.j. Holloway, Jr., And Commending His Legacy."}, "16": {"bill_id": 1125780, "number": "SR4", "change_hash": "8a5cef65505fdec1e58b84a5c512b742", "url": "https://legiscan.com/MS/bill/SR4/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Extend the \"RESPECT\" of the Mississippi Senate for the life and contributions of Aretha Franklin, the \"Queen of Soul.\"", "description": "A Resolution Extending The Eternal \"respect\" Of The Senate For The Life And Accomplishments Of Aretha Franklin, The \"queen Of Soul,\" And Expressing The Condolences Of The Mississippi Senate To Her Family Upon Her Passing."}, "17": {"bill_id": 1125784, "number": "SR5", "change_hash": "dc6108d896bdc3977ba509f002421e1d", "url": "https://legiscan.com/MS/bill/SR5/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Extend the condolences of the Senate on the passing of Circuit Judge Henry Lackey.", "description": "A Resolution Extending The Condolences Of The Senate To The Bereaved Family Of Retired Third District Circuit Judge Henry Lackey From Calhoun City, Mississippi, And Recognizing His Professional Legacy."}, "18": {"bill_id": 1125787, "number": "SR6", "change_hash": "aba11d5263f0f5e2f3ee61e924d6db9a", "url": "https://legiscan.com/MS/bill/SR6/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Extend condolences of Senate to the family of Mississippi's Goodwill Ambassador Paul Ott Carruth.", "description": "A Resolution Extending The Condolences Of The Mississippi Senate To The Bereaved Family Of Goodwill Ambassador Paul Ott Carruth Of Lake Dixie Springs, Mississippi, Who Reached Millions Of Students And Citizens With His Message About Wildlife Conservation And Family Values."}, "19": {"bill_id": 1125781, "number": "SR7", "change_hash": "3ef269b8bac855107d66439e83616647", "url": "https://legiscan.com/MS/bill/SR7/2018/X1", "status_date": "2018-08-29", "status": 2, "last_action_date": "2018-08-29", "last_action": "Adopted", "title": "Mourn the loss of Wilkinson County Chancery Clerk Thomas C. Tolliver, Jr.", "description": "A Resolution Mourning The Loss And Commending The Life And Public Service Of Thomas C. Tolliver, Jr., Of Wilkinson County, Mississippi, The Longest-tenured-serving Chancery Clerk In The State Of Mississippi At The Time Of His Death."}, "20": {"bill_id": 1125778, "number": "SR8", "change_hash": "5035049d2f34750113ec1a0ce854263b", "url": "https://legiscan.com/MS/bill/SR8/2018/X1", "status_date": "2018-08-29", "status": 2, "last_action_date": "2018-08-29", "last_action": "Adopted", "title": "Commend life and honor the military, civic and public service of U.S. Senator John McCain.", "description": "A Resolution Commending The Life And Remembering The Military, Civic And Dedicated Public Service Of United States Senator John Sidney Mccain, Iii, And Extending The Condolences Of The Senate On His Passing."}, "21": {"bill_id": 1125785, "number": "SR9", "change_hash": "533432a366967ec1ad21f3ae6c8eee94", "url": "https://legiscan.com/MS/bill/SR9/2018/X1", "status_date": "2018-08-29", "status": 6, "last_action_date": "2018-08-29", "last_action": "Died On Calendar", "title": "Mourn the passing of Mississippi Gulf Coast Civic and Business Leader Anthony Joseph Topazi.", "description": "A Resolution Mourning The Passing Of Mississippi Gulf Coast Civic And Business Leader Anthony Joseph Topazi And Commending His Life And Public Service."}, "24": {"bill_id": 1125571, "number": "SC503", "change_hash": "c0043930fccf4dec177f296f7360b8fb", "url": "https://legiscan.com/MS/bill/SC503/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Extend condolences of Legislature to the family of Mississippi's Goodwill Ambassador Paul Ott Carruth.", "description": "A Concurrent Resolution Extending The Condolences Of The Mississippi Legislature To The Bereaved Family Of Goodwill Ambassador Paul Ott Carruth Of Lake Dixie Springs, Mississippi, Who Reached Millions Of Students And Citizens With His Message About Wildlife Conservation And Family Values."}, "25": {"bill_id": 1125573, "number": "SC504", "change_hash": "37f10eb83b596f892c4abfc5a7de0cb7", "url": "https://legiscan.com/MS/bill/SC504/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Extend the condolences of the Legislature on the passing of Circuit Judge Henry Lackey.", "description": "A Concurrent Resolution Extending The Condolences Of The Legislature To The Bereaved Family Of Retired Third District"}, "26": {"bill_id": 1125577, "number": "SC505", "change_hash": "3a8353619f4b653599d368d06a3e1ed8", "url": "https://legiscan.com/MS/bill/SC505/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Extend the \"RESPECT\" of the Legislature for the life and contributions of Aretha Franklin, the \"Queen of Soul.\"", "description": "A Concurrent Resolution Extending The Eternal \"respect\" Of The Legislature For The Life And Accomplishments Of Aretha Franklin, The \"queen Of Soul,\" And Expressing The Condolences Of The Mississippi Legislature To Her Family Upon Her Passing."}, "27": {"bill_id": 1125567, "number": "SC506", "change_hash": "f597e6f73598b928cadc0d086dbbcdc8", "url": "https://legiscan.com/MS/bill/SC506/2018/X1", "status_date": "2018-08-30", "status": 4, "last_action_date": "2018-08-30", "last_action": "Enrolled Bill Signed", "title": "Extend condolences of Legislature and commend legacy of former Biloxi Mayor and Gulf Coast Civic Leader A.J. Holloway, Jr.", "description": "A Concurrent Resolution Extending The Condolences Of The Legislature To The Bereaved Family And Friends Of Former Biloxi Mayor And Mississippi Gulf Coast Civic Leader A.j. Holloway, Jr., And Commending His Legacy."}}