{"session": {"session_id": 1639, "state_id": 24, "year_start": 2019, "year_end": 2019, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2019 Regular Session", "session_name": "2019 Regular Session"}, "250": {"bill_id": 1150931, "number": "HB251", "change_hash": "f61424a30e3f8a3bb815bc738a175d89", "url": "https://legiscan.com/MS/bill/HB251/2019", "status_date": "2019-02-05", "status": 6, "last_action_date": "2019-02-05", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; create.", "description": "An Act To Create The \"mississippi Civil Rights Act\"; To Provide Certain Definitions; To Provide That The Right For Persons To Be Free From Discrimination Is A Civil Right; To Provide Remedies For Persons Discriminated Against; And For Related Purposes."}, "1175": {"bill_id": 1169968, "number": "HB1176", "change_hash": "b1b00b679fc71537c9d96a7a319f3bc6", "url": "https://legiscan.com/MS/bill/HB1176/2019", "status_date": "2019-02-05", "status": 6, "last_action_date": "2019-02-05", "last_action": "Died In Committee", "title": "Teachers; provide protection from suspension or termination for refusing to refer to students preferred gender identity if different from biological assignment at birth.", "description": "An Act To Amend Section 37-9-59, Mississippi Code Of 1972, To Prohibit Any Superintendent Of Schools, His Administrative Designee Or Any Principal From Dismissing Or Suspending Any Licensed School Employee For Referring To Any Individual Student's Immutable Biological Sex As Objectively Determined By Anatomy And Genetics At Birth; To Prohibit Any Superintendent Of Schools, His Administrative Designee Or Any Principal From Requiring Licensed School Employees To Comply With Directives To Refer To A Student Based On The Student's Preferred Identity Association Against The Licensed Employee's Religious Belief Or Moral Conviction; To Bring Forward Sections 11-62-3, 11-62-5, 11-62-7, 11-62-9, 11-62-11, 11-62-13 And 11-62-15, Mississippi Code Of 1972, Which Are Provisions Of The \"protecting Freedom Of Conscience From Government Discrimination Act,\" For The Purpose Of Possible Amendments; To Amend Section 11-62-17, Mississippi Code Of 1972, In Conformity To The Preceding Provisions By Including Employees Of Public School Districts And Charter Schools In The Definition Of State Government; And For Related Purposes."}, "2404": {"bill_id": 1165365, "number": "SB2414", "change_hash": "a2e3bb5122017700062efb4333de1282", "url": "https://legiscan.com/MS/bill/SB2414/2019", "status_date": "2019-02-05", "status": 6, "last_action_date": "2019-02-05", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; enact.", "description": "An Act To Create The Mississippi Civil Rights Act; To Provide That The Right Of A Person To Be Free From Discrimination Because Of Race, Color, Religion, National Origin, Immigrant Status, Sex, Sexual Orientation, Gender Identity, Disability, Or Familial Status Is A Civil Right; To Provide Remedies For Violations; And For Related Purposes."}}