{"session": {"session_id": 1728, "state_id": 24, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2020 Regular Session", "session_name": "2020 Regular Session"}, "709": {"bill_id": 1334789, "number": "HB710", "change_hash": "62d2418c553eb8eba49159715882832e", "url": "https://legiscan.com/MS/bill/HB710/2020", "status_date": "2020-03-03", "status": 6, "last_action_date": "2020-03-03", "last_action": "Died In Committee", "title": "State service employees; prohibit sexual orientation or gender identity discrimination of.", "description": "An Act To Amend Section 25-9-149, Mississippi Code Of 1972, To Prohibit Persons Seeking Employment In State Service, Or Persons Employed In State Service, From Being Discriminated Against On The Basis Of Sexual Orientation Or Gender Identity; And For Related Purposes."}, "763": {"bill_id": 1334863, "number": "HB764", "change_hash": "4262287ea6524c829939e38caddc73b9", "url": "https://legiscan.com/MS/bill/HB764/2020", "status_date": "2020-03-03", "status": 6, "last_action_date": "2020-03-03", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; create.", "description": "An Act To Create The Mississippi Civil Rights Act; To Provide That The Right Of A Person To Be Free From Discrimination Because Of Race, Color, Religion, National Origin, Immigrant Status, Sex, Sexual Orientation, Gender Identity, Disability Or Familial Status Is A Civil Right; To Amend Sections 25-9-149, 43-33-723 And 13-5-2, Mississippi Code Of 1972, To Conform To The Preceding Provisions; And For Related Purposes."}, "764": {"bill_id": 1334583, "number": "HB765", "change_hash": "d32460c14c154dea0d4682977bb2cde7", "url": "https://legiscan.com/MS/bill/HB765/2020", "status_date": "2020-03-03", "status": 6, "last_action_date": "2020-03-03", "last_action": "Died In Committee", "title": "Mississippi Home Corporation Act; prohibit sexual orientation or gender identity discrimination from occurring in connection with.", "description": "An Act To Amend Section 43-33-723, Mississippi Code Of 1972, To Prohibit Discrimination On The Basis Of Sexual Orientation Or Gender Identity By Any Qualified Sponsor, Lender Or Agent Or Employee Thereof In Connection With Any Housing Development Or Eligible Loan Under The Mississippi Home Corporation Act; And For Related Purposes."}, "1993": {"bill_id": 1370238, "number": "HC75", "change_hash": "bf99c597d03fd3c64ad37b3a369b8bd8", "url": "https://legiscan.com/MS/bill/HC75/2020", "status_date": "2020-10-02", "status": 6, "last_action_date": "2020-10-02", "last_action": "Died In Committee", "title": "Suspend deadlines for introduction; Law enforcement; regulate with penalties for misconduct.", "description": "A Concurrent Resolution Suspending The Deadlines For The Purpose Of Requesting The Drafting, And The Introduction, Consideration And Passage, Of A Bill Entitled \"an Act To Require Each Law Enforcement Officer In This State To Wear Body Cameras At All Times While On Duty As A Law Enforcement Officer; To Require Each Law Enforcement Vehicle To Have Cameras For The Purposes Of Recording All Interactions Of Law Enforcement With Non-law Enforcement; To Provide Penalties For Any Law Enforcement Agency That Fails To Provide Such Body Or Vehicle Cameras; To Require That Such Body Or Vehicle Cameras Remain On And Operational During All Times An Officer Is On Duty As A Law Enforcement Officer; To Prohibit Interruption Of Video Footage Of Body And Vehicle Cameras; To Provide Penalties For The Officer And The Law Enforcement Agency For Such Violations; To Create A Rebuttable Presumption Of The Crime Of Murder, Manslaughter Or Aggravated Assault By Law Enforcement When A Person Is Killed By Law Enforcement, Dies As A Result Of Actions Of Law Enforcement Or Is Severely Injured As A Result Of Actions By Law Enforcement; To Create Enhanced Penalties For Such Actions If Such Actions Are Motivated By Race; To Describe How Video From The Cameras Must Be Retained By Law Enforcement Agencies; To Authorize Who May Obtain A Copy Of A Recording; To Provide Remedies For Violations Of This Act; To Require All Law Enforcement Agencies To Provide Racial-bias Training; To Require Each Law Enforcement Agency To Have An Online Law Enforcement Misconduct Registry; To Require Such Registry To Be Free, Public And Easily Accessible To Any Person; To Require The Registry To List All Complaints Or Acts Of Misconduct In An Itemized Fashion Listing With The Name Of Each Officer And The Complaints And Acts Attached; To Amend Sections 99-19-301, 99-19-303, 99-19-305 And 99-19-307, To Clarify That Crimes Committed By Law Enforcement Against Any Person Based On Race, Color, Ancestry, Ethnicity, Religion, National Origin, Gender, Sexual Orientation, Gender Identity Or Disability; And For Related Purposes.\""}, "2553": {"bill_id": 1342262, "number": "SB2549", "change_hash": "bf957dd75b4ccaccfbc8994d649284ef", "url": "https://legiscan.com/MS/bill/SB2549/2020", "status_date": "2020-03-03", "status": 6, "last_action_date": "2020-03-03", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; enact.", "description": "An Act To Create The Mississippi Civil Rights Act; To Provide That The Right Of A Person To Be Free From Discrimination Because Of Race, Color, Religion, National Origin, Immigrant Status, Sex, Sexual Orientation, Gender Identity, Disability, Or Familial Status Is A Civil Right; To Provide Remedies For Violations; And For Related Purposes."}}