{"session": {"session_id": 1809, "state_id": 24, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "805": {"bill_id": 1411736, "number": "HB806", "change_hash": "103758d21231e4e6a5b5fb9b40dfc4eb", "url": "https://legiscan.com/MS/bill/HB806/2021", "status_date": "2021-02-02", "status": 6, "last_action_date": "2021-02-02", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; create.", "description": "An Act To Create The Mississippi Civil Rights Act; To Provide That The Right Of A Person To Be Free From Discrimination Because Of Race, Color, Religion, National Origin, Immigrant Status, Sex, Sexual Orientation, Gender Identity, Disability Or Familial Status Is A Civil Right; To Amend Sections 25-9-149, 43-33-723 And 13-5-2, Mississippi Code Of 1972, To Conform To The Preceding Provisions; And For Related Purposes."}, "806": {"bill_id": 1411796, "number": "HB807", "change_hash": "74c9ad457d0c81cbe229db45ca3a03a1", "url": "https://legiscan.com/MS/bill/HB807/2021", "status_date": "2021-02-02", "status": 6, "last_action_date": "2021-02-02", "last_action": "Died In Committee", "title": "State service employees; prohibit sexual orientation or gender identity discrimination of.", "description": "An Act To Amend Section 25-9-149, Mississippi Code Of 1972, To Prohibit Persons Seeking Employment In State Service, Or Persons Employed In State Service, From Being Discriminated Against On The Basis Of Sexual Orientation Or Gender Identity; And For Related Purposes."}, "807": {"bill_id": 1411671, "number": "HB808", "change_hash": "1113838380b405e0c9b0b125394ced15", "url": "https://legiscan.com/MS/bill/HB808/2021", "status_date": "2021-02-02", "status": 6, "last_action_date": "2021-02-02", "last_action": "Died In Committee", "title": "Mississippi Home Corporation Act; prohibit sexual orientation or gender identity discrimination under.", "description": "An Act To Amend Section 43-33-723, Mississippi Code Of 1972, To Prohibit Discrimination On The Basis Of Sexual Orientation Or Gender Identity By Any Qualified Sponsor, Lender Or Agent Or Employee Thereof In Connection With Any Housing Development Or Eligible Loan Under The Mississippi Home Corporation Act; And For Related Purposes."}, "1769": {"bill_id": 1396033, "number": "SB2089", "change_hash": "4aec14403be9f51b119a006f1bbdf50a", "url": "https://legiscan.com/MS/bill/SB2089/2021", "status_date": "2021-02-02", "status": 6, "last_action_date": "2021-02-02", "last_action": "Died In Committee", "title": "Mississippi Civil Rights Act; enact.", "description": "An Act To Create The Mississippi Civil Rights Act; To Provide That The Right Of A Person To Be Free From Discrimination Because Of Race, Color, Religion, National Origin, Immigrant Status, Sex, Sexual Orientation, Gender Identity, Disability, Or Familial Status Is A Civil Right; To Provide Remedies For Violations; And For Related Purposes."}, "1891": {"bill_id": 1397429, "number": "SB2211", "change_hash": "1885e3eeaddb75283eb8750abd2d606c", "url": "https://legiscan.com/MS/bill/SB2211/2021", "status_date": "2021-02-02", "status": 6, "last_action_date": "2021-02-02", "last_action": "Died In Committee", "title": "Juries; prohibit peremptory challenges based on certain factors.", "description": "An Act To Prohibit A Party From Using A Peremptory Challenge To Remove A Prospective Juror On The Basis Of The Prospective Juror's Race, Ethnicity, Gender, Gender Identity, Sexual Orientation, National Origin, Or Religious Affiliation, Or The Perceived Membership Of The Prospective Juror In Any Of Those Groups; To Authorize A Party, Or The Trial Court On Its Own Motion, To Object To The Use Of A Peremptory Challenge Based On These Criteria; To Require The Party Exercising The Challenge, Upon Objection, To State The Reasons The Peremptory Challenge Has Been Exercised; To Require The Court To Evaluate The Reasons Given And, If The Court Grants The Objection, Authorize The Court To Take Certain Actions, Including, But Not Limited To, Starting A New Jury Selection, Declaring A Mistrial At The Request Of The Objecting Party, Seating The Challenged Juror, Or Providing Another Remedy As The Court Deems Appropriate; To Provide For A De Novo Standard Of Review By An Appellate Court Reviewing The Denial Of An Objection; To Provide That The Act Applies To Criminal Jury Trials In Which Jury Selection Begins On Or After January 1, 2022; To Provide That The Act Applies To Civil Jury Trials In Which Jury Selection Begins On Or After January 1, 2025; And For Related Purposes."}}