{"session": {"session_id": 20, "state_id": 48, "year_start": 2009, "year_end": 2009, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2009 Regular Session", "session_name": "2009 Regular Session"}, "428": {"bill_id": 26360, "number": "HB2454", "change_hash": "44de8bbbbb2c64115aa8697f1586277b", "url": "https://legiscan.com/WV/bill/HB2454/2009", "status_date": "2009-02-16", "status": 1, "last_action_date": "2009-02-16", "last_action": "To House Energy, Industry and Labor, Economic Development and Small Business", "title": "Prohibiting discrimination based upon age and sexual orientation", "description": "The purpose of this bill is to add &quot;sexual orientation&quot; to the categories covered by the Human Rights Act, prohibiting discrimination in employment and places of public accommodations. This bill also adds &quot;age&quot; and &quot;sexual orientation&quot; to the categories covered by the Fair Housing Act prohibiting discrimination in housing.  It also defines &quot;sexual orientation&quot;  as &quot;heterosexuality, bisexuality, homosexuality or gender identity or expression, whether actual or perceived&quot;."}, "851": {"bill_id": 25891, "number": "SB134", "change_hash": "dea6c087a2ab5bfeb6f366a94a7f4e9b", "url": "https://legiscan.com/WV/bill/SB134/2009", "status_date": "2009-02-11", "status": 1, "last_action_date": "2009-02-11", "last_action": "To Judiciary", "title": "Relating to unlawful discriminatory practices generally", "description": "The purpose of this bill is to add &quot;sexual orientation&quot; to the categories covered by the Human Rights Act prohibiting discrimination in employment and places of public accommodations. This bill also adds &quot;age&quot; and &quot;sexual orientation&quot; to the categories covered by the Fair Housing Act prohibiting discrimination in housing.  It defines &quot;sexual orientation&quot; as &quot;heterosexuality, bisexuality, homosexuality or gender identity or expression, whether actual or perceived&quot;; and adds to &#167;5-11A-3 a definition of &quot;age&quot; as meaning the age of forty or above ."}, "955": {"bill_id": 25713, "number": "SB238", "change_hash": "0a4709aa7772a1fe8ee5a53544b6d26f", "url": "https://legiscan.com/WV/bill/SB238/2009", "status_date": "2009-03-13", "status": 2, "last_action_date": "2009-03-16", "last_action": "To House Judiciary", "title": "Prohibiting discrimination based upon age or sexual orientation", "description": "The purpose of this bill is to  add &quot;sexual orientation&quot; to the categories covered by the Human Rights Act prohibiting discrimination in employment and places of public accommodations. This bill also provides clarification as to an exemption from the &quot;sexual orientation&quot; employment-based proscriptions of this bill for &quot;religious institutions&quot; and offers, for the purposes of this article, a definition thereof.  This bill also adds &quot;age&quot; and &quot;sexual orientation&quot; to the categories covered by the Fair Housing Act prohibiting discrimination in housing. It defines &quot;sexual orientation&quot; as &quot;heterosexuality, bisexuality, homosexuality or gender identity, whether actual or perceived.&quot;"}}