{"session": {"session_id": 1457, "state_id": 48, "year_start": 2017, "year_end": 2017, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2017 1st Special Session", "session_name": "2017 1st Special Session"}, "0": {"bill_id": 1011025, "number": "HB101", "change_hash": "e323c66c8089bf54f3fa3e7c99f70603", "url": "https://legiscan.com/WV/bill/HB101/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-04", "last_action": "To House Finance", "title": "Raising salaries for classroom teachers", "description": "The purpose of this bill is to raise the salary for classroom teachers."}, "1": {"bill_id": 1011000, "number": "HB102", "change_hash": "4b008c4f580b01faeb699238d54745a7", "url": "https://legiscan.com/WV/bill/HB102/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-04", "last_action": "To House Finance", "title": "Increasing DMV fees and motor fuel excise taxes", "description": "The purpose of this bill is to increase the funding for the State Road Fund by increasing Division of Motor Vehicles administrative fees and motor fuel excise taxes, changing the flat rate component of the motor fuel excise tax, increase the minimum average wholesale price of motor fuels for purposes of the five percent variable fuel tax on a certain date, increasing administrative DMV fees every five years on September 1 based on the US Department of Labor, Bureau of Labor Statistics most current Consumer Price Index, imposing annual registration fee for certain alternative fuel vehicles and specified effective dates.Â ."}, "2": {"bill_id": 1011039, "number": "HB103", "change_hash": "10f1777c8af1452d115c62462d9116bd", "url": "https://legiscan.com/WV/bill/HB103/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-04", "last_action": "To House Finance", "title": "Relating generally to the West Virginia Parkways Authority", "description": "The purpose of this bill is to grant authority to the Parkways Authority to issue revenue bonds and refunding bonds for the purpose of financing parkway projects within the state constructed or improved by the Department of Transportation or the authority or refunding bonds issued in connection with any parkway project, to clarify notice and public meeting requirements and procedures for fixing or increasing tolls or fees, to study and implement, if feasible, a single fee program, and to authorize electronic toll collection as a method of collecting and enforcing any tolls that may be charged for transit over any parkway project."}, "3": {"bill_id": 1011011, "number": "HB104", "change_hash": "8944468cc4c2519b027313e78cce8c46", "url": "https://legiscan.com/WV/bill/HB104/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-04", "last_action": "Motion to reject bill pursuant to House Rule 103 adopted (Roll No. 607)", "title": "Relating generally to taxation", "description": "The purpose of this bill is to provide increased funding for the General Revenue Fund by imposing severance tax on the privilege of producing coal and natural gas at graduated rates after June 30, 2017; increasing the rate of the consumers sales and service tax and use tax to 7 percent beginning July 1, 2017; imposing sales and use taxes on telecommunication services and ancillary telecommunication services beginning July 1, 2017. Eliminating exemptions from sales tax as of July 1, 2017, for services provided by health and fitness clubs and providers of primary opinion research and making technical corrections; exempting military retirement from personal income tax after December 31, 2018; imposing a temporary additional personal income tax on persons with West Virginia taxable incomes of $300,000 or more; collapsing the number of bracket in the personal income tax, specifying new rates of tax for taxable years beginning on and after specified first day of January 1, 2019 and providing for phase-out of personal income tax over period of years when certain conditions exist. The credits against personal and corporation net income taxes for qualified rehabilitation expenditures made after December 31, 2017 are increased; rules are provided for claiming credit and for disallowance of credit. The rate of the corporation net income tax is temporarily increased to 7.5 percent for taxable years beginning on or after January 1, 2018 but before January 1, 2020."}, "4": {"bill_id": 1011099, "number": "HB105", "change_hash": "0237a8eb7bc42bec03f419dfceb44b55", "url": "https://legiscan.com/WV/bill/HB105/2017/X1", "status_date": "2017-05-05", "status": 1, "last_action_date": "2017-05-05", "last_action": "To House Finance", "title": "Limiting the number of days that members of the Legislature may receive compensation during an extended and extraordinary session", "description": "The purpose of this bill is to limit the compensation of members of the Legislature to no more than five days in a special session where a budget bill has not been enacted."}, "5": {"bill_id": 1013827, "number": "HB106", "change_hash": "521624d9d614327b62723885bbb0634d", "url": "https://legiscan.com/WV/bill/HB106/2017/X1", "status_date": "2017-05-18", "status": 2, "last_action_date": "2017-06-16", "last_action": "Resolution adopted to extend conference", "title": "Relating generally to the furlough of public employees during declared fiscal emergency", "description": "Relating generally to the furlough of public employees during declared fiscal emergency"}, "6": {"bill_id": 1014220, "number": "HB107", "change_hash": "56b0c88f3b7c339d044b38ab1ffa36df", "url": "https://legiscan.com/WV/bill/HB107/2017/X1", "status_date": "2017-05-19", "status": 2, "last_action_date": "2017-06-13", "last_action": "Conference time expired", "title": "Relating generally to the Tax Reform Act of 2017", "description": "Relating generally to the Tax Reform Act of 2017"}, "7": {"bill_id": 1014144, "number": "HB108", "change_hash": "d73a6b241c1c57831406a7de0e481013", "url": "https://legiscan.com/WV/bill/HB108/2017/X1", "status_date": "2017-05-16", "status": 1, "last_action_date": "2017-05-16", "last_action": "To House Finance", "title": "Increasing the funding for the State Road Fund", "description": "The purpose of this bill is to increase the funding for the State Road Fund.Â The bill increases Division of Motor Vehicles administrative fees and motor fuel excise taxes, increase rate of consumers sales and service tax on sales of motor vehicles, increases the minimum average wholesale price of motor fuels for purposes of the five percent variable fuel tax on a certain date, and increases administrative DMV fees every five years on September 1 based on the US Department of Labor, Bureau of Labor Statistics most current Consumer Price Index, imposing annual registration fee for certain alternative fuel vehicles and specified effective dates.Â"}, "8": {"bill_id": 1014184, "number": "HB109", "change_hash": "34cbe475082ff75ac935ea3ace24100a", "url": "https://legiscan.com/WV/bill/HB109/2017/X1", "status_date": "2017-05-16", "status": 1, "last_action_date": "2017-05-16", "last_action": "To House Finance", "title": "Making medical cannabis subject to the consumer sales and service tax", "description": "The purpose of this bill is to allow the collection of sales tax on medical cannabis."}, "9": {"bill_id": 1015038, "number": "HB110", "change_hash": "5060f1cc8df2da05fac701784281c9d7", "url": "https://legiscan.com/WV/bill/HB110/2017/X1", "status_date": "2017-05-19", "status": 1, "last_action_date": "2017-06-13", "last_action": "Motion to table motion to discharge from committee adopted (Roll No. 646)", "title": "Relating to taxation", "description": "The purpose of this bill is to create a fair and equitable solution to the budget crisis in West Virginia.Â The bill increases the sales and use taxes to 6.75 percent and broadens the base of the sales tax.Â It ends the transfer of sales tax revenue to the road fund.Â It creates a fair share surcharge for wealthy West Virginians. It grants a $750 tax credit to full-time, classroom teachers.Â It modifies certain exemptions from sales and use taxes and exempts veterans’ military benefits from personal income tax. It creates an Earned Income Tax Credit to put more money in the hands of working people who earn low wages. Finally, it increases the rate of corporate net income tax by one percent."}, "10": {"bill_id": 1017006, "number": "HB111", "change_hash": "fb02efa59dc16502e4ae329775583b45", "url": "https://legiscan.com/WV/bill/HB111/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 2, Acts, 1st Extraordinary Session, 2017", "title": "Relating generally to tax procedures and administration", "description": "The purpose of this bill is to require a notice of lien to include the lien expiration date, providing for additional circumstances in which the Tax Commissioner may withdraw tax liens; and providing for the release, withdrawal and termination of lien under certain circumstances."}, "11": {"bill_id": 1017015, "number": "HB112", "change_hash": "0e960ece627e1ededdadb858c3389ced", "url": "https://legiscan.com/WV/bill/HB112/2017/X1", "status_date": "2017-05-23", "status": 1, "last_action_date": "2017-06-05", "last_action": "Tabled on 1st reading, Special Calendar", "title": "Relating to the Volunteer Fire Department Workers' Compensation", "description": "The purpose of this bill is to extend the Volunteer Fire Department Workers' Compensation Premium Subsidy Fund untill June 30, 2020."}, "12": {"bill_id": 1017025, "number": "HB113", "change_hash": "8c404c9877adf86affceee63b816685f", "url": "https://legiscan.com/WV/bill/HB113/2017/X1", "status_date": "2017-06-26", "status": 5, "last_action_date": "2017-06-26", "last_action": "Vetoed by Governor 6/23/17 - Senate Journal", "title": "Relating to the sale of Jackie Withrow Hospital by the DHHR", "description": "Relating to the sale of Jackie Withrow Hospital by the DHHR"}, "13": {"bill_id": 1017001, "number": "HB114", "change_hash": "7340f9d246bbb59984d205da373c813f", "url": "https://legiscan.com/WV/bill/HB114/2017/X1", "status_date": "2017-05-23", "status": 1, "last_action_date": "2017-05-23", "last_action": "To House Finance", "title": "Relating to the sale of Hopemont Hospital by the Department of Health and Human Resources", "description": "The purpose of this bill is to require the selling of Hopemont Hospital by the Secretary of the Department of Health and Human Resources.Â"}, "14": {"bill_id": 1016990, "number": "HB115", "change_hash": "a7d618eba72c80be86364a5a504ea100", "url": "https://legiscan.com/WV/bill/HB115/2017/X1", "status_date": "2017-05-23", "status": 1, "last_action_date": "2017-06-15", "last_action": "Tabled on 3rd reading, Special Calendar", "title": "Budget Bill", "description": "Budget Bill"}, "15": {"bill_id": 1016996, "number": "HB116", "change_hash": "6ab92b71c06c7d6ca25d619556a7201a", "url": "https://legiscan.com/WV/bill/HB116/2017/X1", "status_date": "2017-05-23", "status": 1, "last_action_date": "2017-05-23", "last_action": "To House Health and Human Resources", "title": "Relating to physician assistants", "description": "The purpose of this bill is to modify laws relating to physician assistants, including modifying board membership, substituting “collaborating” for “supervising” physician, define terms, modify the prescriptive authority of physician assistants, eliminating the continuous national certification requirement, prohibiting an insurance plan from limiting the practice on physician assistants; adding requirements to practice agreement, granting physician assistants signatory authority on certain forms and making conforming amendments."}, "16": {"bill_id": 1017038, "number": "HB117", "change_hash": "4dd02e8f2c0cca8cd6a43fcd7e1ea757", "url": "https://legiscan.com/WV/bill/HB117/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 4, Acts, 1st Extraordinary Session, 2017", "title": "Relating to West Virginia Health Care Authority", "description": "Relating to West Virginia Health Care Authority"}, "17": {"bill_id": 1017027, "number": "HB118", "change_hash": "50c77010d90df96c17d54c2e6148b5e9", "url": "https://legiscan.com/WV/bill/HB118/2017/X1", "status_date": "2017-05-24", "status": 1, "last_action_date": "2017-05-24", "last_action": "To House Finance", "title": "Making appropriations of public money out of the Treasury in accordance with section fifty-one, article VI of the Constitution", "description": "Making appropriations of public money out of the Treasury in accordance with section fifty-one, article VI of the Constitution"}, "18": {"bill_id": 1017974, "number": "HB119", "change_hash": "3bfeca39d27929d6b30f8b18a7377c29", "url": "https://legiscan.com/WV/bill/HB119/2017/X1", "status_date": "2017-06-05", "status": 1, "last_action_date": "2017-06-05", "last_action": "To House Finance", "title": "Discontinuing the West Virginia Greyhound Breeding Development Fund", "description": "The purpose of this bill is to discontinue the West Virginia Racing Commission special account known as the West Virginia Greyhound Breeding Development Fund; to transfer all moneys in the West Virginia Greyhound Breeding Development Fund to the state Excess Lottery Revenue Fund for appropriation by the Legislature; to require that all moneys previously required to be directed to the West Virginia Greyhound Breeding Development Fund be redirected to the state Excess Lottery Revenue Fund for appropriation by the Legislature; requiring that upon transfer of moneys from the West Virginia Greyhound Breeding Development Fund to the state Excess Lottery Revenue Fund, a certain amount be withheld and deposited in the special account known as the “administration, promotion, education, capital improvement and greyhound adoption programs to include spaying and neutering account;” to require that all moneys previously required to be directed into any fund or paid for the purpose of funding purses, awards or provide any other funding for greyhound races be redirected to the state Excess Lottery Revenue Fund for appropriation by the Legislature; to eliminate the requirement that an applicant for a dog racing license race a minimum number of dates to qualify for such license; to eliminate the requirement that an applicant for a dog racing license race a minimum number of dates to or to contract to receive telecasts and accept wagers; to eliminate the requirement that a video lottery licensee at a dog track must hold a racing license to renew a video lottery license or racetrack table games license; to eliminate the requirement, for a video lottery licensee at a dog track, that operational video lottery must be located in the same building or structure as a racetrack and area where pari-mutuel wagering is permitted; to eliminate the requirement that an applicant for a video lottery license or license renewal at a dog track must provide evidence of the existence of an agreement regarding proceeds from lottery terminals with certain parties; to eliminate the requirement that an applicant for a racetrack table games license at a dog track must race a certain number of days to qualify for such license; and to eliminate the requirement that a video lottery licensee at a dog track must hold a racing license to conduct simulcast racing."}, "19": {"bill_id": 1017994, "number": "HB120", "change_hash": "90da70133fa4a36872f2bfaafe4ef74a", "url": "https://legiscan.com/WV/bill/HB120/2017/X1", "status_date": "2017-06-05", "status": 1, "last_action_date": "2017-06-05", "last_action": "To House Government Organization", "title": "Establishing the Fleet Management Office within the Department of Administration", "description": "The purpose of this bill is to create and maintain a centralized state vehicle inventory system. The bill establishes the Fleet Management Office within the Department of Administration. The bill creates the state Vehicle Title, Registration and Relicensing Project of 2017. The bill requires reporting by spending units utilizing state vehicles. The bill provides the new article’s scope and establishes exemptions. The bill provides for new officers and establishes their powers, duties and responsibilities. The bill defines terms. The bill continues the Fleet Management Office Fund. The bill requires the Fleet Management Office to coordinate with other agencies. The bill provides for annual reports of vehicle use by spending units. The bill requires annual reports to the Governor and the Joint Committee on Government and Finance. The bill provides for enforcement. The bill requires legislative compliance audits. The bill provides a deadline date for the expiration of current state vehicle license plates. The bill creates new state vehicle license plates. The bill provides for notice to spending units regarding the expiration of title, registrations and license plates. The bill requires a standardized naming convention for the tile, registration and licensing of all state vehicles. The bill requires annual renewal of the state vehicle registrations. The bill provides exemptions from reporting for certain undercover vehicles. The bill authorizes rule making and emergency rule making."}, "20": {"bill_id": 1018956, "number": "HB121", "change_hash": "92852b708cd63fdca0cbbb19917d276a", "url": "https://legiscan.com/WV/bill/HB121/2017/X1", "status_date": "2017-06-09", "status": 1, "last_action_date": "2017-06-09", "last_action": "To House Judiciary", "title": "Requiring unclaimed prize money be deposited into the General Revenue Fund", "description": "The purpose of this bill is to provide for unclaimed prize money to be deposited into the General Revenue if not claimed within the one hundred and eighty days after the drawing or the announced end of a game."}, "21": {"bill_id": 1019415, "number": "HB122", "change_hash": "f5959d089bae91f68a780a3af8aceb66", "url": "https://legiscan.com/WV/bill/HB122/2017/X1", "status_date": "2017-06-14", "status": 1, "last_action_date": "2017-06-14", "last_action": "To House Government Organization", "title": "Terminating the Women’s Commission", "description": "The purpose of this bill is to terminate the Women’s Commission and discontinue its functions."}, "22": {"bill_id": 1019446, "number": "HB123", "change_hash": "c27993553c40eaf8af8e581df96e08a2", "url": "https://legiscan.com/WV/bill/HB123/2017/X1", "status_date": "2017-06-14", "status": 1, "last_action_date": "2017-06-14", "last_action": "To House Finance", "title": "Imposing, administering and collecting a license tax on successful bidders for road construction contracts", "description": "Imposing, administering and collecting a license tax on successful bidders for road construction contracts"}, "23": {"bill_id": 1014709, "number": "HCR1", "change_hash": "7ce78191fa2f3b17f3a7b5062d743380", "url": "https://legiscan.com/WV/bill/HCR1/2017/X1", "status_date": "2017-05-18", "status": 1, "last_action_date": "2017-05-18", "last_action": "To House Rules", "title": "Establishing a Select Committee on Taxation and Budget Matters", "description": "Establishing a Select Committee on Taxation and Budget Matters"}, "24": {"bill_id": 1010916, "number": "SB1001", "change_hash": "22735f51b262a1348c36733f3e0a18fd", "url": "https://legiscan.com/WV/bill/SB1001/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-05", "last_action": "Referred to Rules on 2nd reading", "title": "Raising salary for classroom teachers", "description": "Raising salary for classroom teachers"}, "25": {"bill_id": 1010879, "number": "SB1002", "change_hash": "667185c89972da65fbc22ef0860fe0bd", "url": "https://legiscan.com/WV/bill/SB1002/2017/X1", "status_date": "2017-05-04", "status": 1, "last_action_date": "2017-05-05", "last_action": "Referred to Rules on 2nd reading", "title": "Increasing DMV fees and motor fuel excise tax", "description": "Increasing DMV fees and motor fuel excise tax"}, "26": {"bill_id": 1010956, "number": "SB1003", "change_hash": "3342ebe33b86c899071ffa2bb06d6b00", "url": "https://legiscan.com/WV/bill/SB1003/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 5, Acts, 1st Extraordinary Session, 2017", "title": "Relating generally to WV Parkways Authority", "description": "Relating generally to WV Parkways Authority"}, "28": {"bill_id": 1014062, "number": "SB1005", "change_hash": "5a58feaea724fe8e457704ead9e11be3", "url": "https://legiscan.com/WV/bill/SB1005/2017/X1", "status_date": "2017-05-16", "status": 1, "last_action_date": "2017-05-16", "last_action": "To Judiciary", "title": "Relating to furlough of public employees", "description": "10.0pt;color:windowtext'>The purpose of this bill is to create new sections and a new article of West Virginia Code authorizing the furlough of public employees, WV House and Senate employees, Joint Committee on Government and Finance employees, Legislative Auditor employees, Constitutional office employees and employees of the WV Supreme Court of Appeals.Â It also establishes the conditions under which furlough is to occur; defines terms, and permitting declaration and termination of the fiscal emergency.Â"}, "29": {"bill_id": 1014025, "number": "SB1006", "change_hash": "c8607dfd33a780b1569239ccfa129c19", "url": "https://legiscan.com/WV/bill/SB1006/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 6, Acts, 1st Extraordinary Session, 2017", "title": "Increasing funding for State Road Fund", "description": "The purpose of this bill is to increase the funding for the State Road Fund.Â The bill increases Division of Motor Vehicles administrative fees and motor fuel excise taxes, increase rate of consumers sales and service tax on sales of motor vehicles, increases the minimum average wholesale price of motor fuels for purposes of the five percent variable fuel tax on a certain date, and increases administrative DMV fees every five years on September 1 based on the US Department of Labor, Bureau of Labor Statistics most current Consumer Price Index, imposing annual registration fee for certain alternative fuel vehicles and specified effective dates.Â"}, "30": {"bill_id": 1014100, "number": "SB1007", "change_hash": "2914c389b44466885943602d44aedecd", "url": "https://legiscan.com/WV/bill/SB1007/2017/X1", "status_date": "2017-05-16", "status": 2, "last_action_date": "2017-05-17", "last_action": "To House Finance", "title": "Tax Reform Act of 2017", "description": "Tax Reform Act of 2017"}, "31": {"bill_id": 1017010, "number": "SB1008", "change_hash": "4d3374ac64efa86569c005966751717c", "url": "https://legiscan.com/WV/bill/SB1008/2017/X1", "status_date": "2017-05-24", "status": 1, "last_action_date": "2017-05-24", "last_action": "To Finance", "title": "Relating to public school support and county levy rates", "description": "The purpose of this bill is to increase regular levy rates, and allow counties meeting certain requirements to decrease levy rates to the extent the rate exceeds the county's total basic foundation program, and to set forth maximum levies for general current expense purposes to be used annually beginning with the 2018-2019 school year."}, "33": {"bill_id": 1017017, "number": "SB1010", "change_hash": "1b096fb5e53be054648e77cac84514ad", "url": "https://legiscan.com/WV/bill/SB1010/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 7, Acts, 1st Extraordinary Session, 2017", "title": "Relating to Volunteer Fire Department Workers' Compensation Premium Subsidy Fund", "description": "The purpose of this bill is to extend the Volunteer Fire Department Workers’ Compensation Premium Subsidy Fund until June 30, 2020."}, "34": {"bill_id": 1017033, "number": "SB1011", "change_hash": "f525aca2e088363c9b0b349180c15608", "url": "https://legiscan.com/WV/bill/SB1011/2017/X1", "status_date": "2017-05-24", "status": 2, "last_action_date": "2017-06-16", "last_action": "House received Senate message", "title": "Selling Hopemont Hospital", "description": "Selling Hopemont Hospital"}, "35": {"bill_id": 1017003, "number": "SB1012", "change_hash": "a1acf687d6cb40e5eb5b72f7bc74d701", "url": "https://legiscan.com/WV/bill/SB1012/2017/X1", "status_date": "2017-05-24", "status": 1, "last_action_date": "2017-05-24", "last_action": "To Health and Human Resources", "title": "Selling Jackie Withrow Hospital", "description": "The purpose of this bill is to require the selling of Jackie Withrow Hospital by the Secretary of the Department of Health and Human Resources."}, "37": {"bill_id": 1017011, "number": "SB1014", "change_hash": "897ca9de6f1275f4a31a39a2d4f2d6b2", "url": "https://legiscan.com/WV/bill/SB1014/2017/X1", "status_date": "2017-07-20", "status": 4, "last_action_date": "2017-07-20", "last_action": "Chapter 3, Acts, 1st Extraordinary Session, 2017", "title": "Relating generally to physician assistants", "description": "Relating generally to physician assistants"}, "38": {"bill_id": 1017020, "number": "SB1015", "change_hash": "460ad135d5c07e0b570cb7aaa090ef91", "url": "https://legiscan.com/WV/bill/SB1015/2017/X1", "status_date": "2017-05-24", "status": 1, "last_action_date": "2017-05-24", "last_action": "To Health and Human Resources", "title": "Relating generally to Health Care Authority", "description": "10.0pt;color:windowtext'>The purpose of this bill is to authorize the secretary, through the Health Care Authority, to request health care facilities file with the Health Care Authority health care financial disclosures; remove restrictive language associated with an exemption to the certificate of need process; and authorize the Health Care Authority to assess and collect a fee, assess a penalty for failure to file required financial documents, define terms. Â"}, "39": {"bill_id": 1019414, "number": "SB1016", "change_hash": "5d503b179ad49baf8c41f43e0681ce1c", "url": "https://legiscan.com/WV/bill/SB1016/2017/X1", "status_date": "2017-06-14", "status": 1, "last_action_date": "2017-06-14", "last_action": "To Finance", "title": "Relating generally to license tax on successful bidders for road construction contracts", "description": "Relating generally to license tax on successful bidders for road construction contracts"}, "40": {"bill_id": 1019637, "number": "SB1017", "change_hash": "07dafd1b1999407412eaa112cba92bea", "url": "https://legiscan.com/WV/bill/SB1017/2017/X1", "status_date": "2017-06-15", "status": 2, "last_action_date": "2017-06-16", "last_action": "Communicated to Senate", "title": "Relating generally to Tax Reform Act of 2017", "description": "Relating generally to Tax Reform Act of 2017"}, "42": {"bill_id": 1020014, "number": "SB1019", "change_hash": "66a74a158c52c464d200e1f6de615e8b", "url": "https://legiscan.com/WV/bill/SB1019/2017/X1", "status_date": "2017-06-16", "status": 1, "last_action_date": "2017-06-16", "last_action": "To Finance", "title": "Increasing tax credit for rehabilitated building investment", "description": "Increasing tax credit for rehabilitated building investment"}, "43": {"bill_id": 1010799, "number": "SR101", "change_hash": "2fe38f6c061231f7a09aa6f6f01b6b93", "url": "https://legiscan.com/WV/bill/SR101/2017/X1", "status_date": "2017-05-04", "status": 4, "last_action_date": "2017-05-04", "last_action": "Completed legislative action", "title": "Notifying House Senate has assembled in extraordinary session", "description": "Notifying House Senate has assembled in extraordinary session"}, "44": {"bill_id": 1010722, "number": "SR102", "change_hash": "35136345adb518d2843223dffb79cb01", "url": "https://legiscan.com/WV/bill/SR102/2017/X1", "status_date": "2017-05-04", "status": 4, "last_action_date": "2017-05-04", "last_action": "Completed legislative action", "title": "Notifying Governor Legislature has assembled in extraordinary session", "description": "Notifying Governor Legislature has assembled in extraordinary session"}, "45": {"bill_id": 1013775, "number": "SR103", "change_hash": "e3e6a84b3157192cf237b5704ad753ca", "url": "https://legiscan.com/WV/bill/SR103/2017/X1", "status_date": "2017-05-15", "status": 4, "last_action_date": "2017-05-15", "last_action": "Completed legislative action", "title": "Recognizing Huntington as grand prize winner in America's Best Communities competition", "description": "Recognizing Huntington as grand prize winner in America's Best Communities competition"}, "46": {"bill_id": 1019996, "number": "SR104", "change_hash": "c28ee92aa9c87bf21e560c8a7b080f37", "url": "https://legiscan.com/WV/bill/SR104/2017/X1", "status_date": "2017-06-17", "status": 4, "last_action_date": "2017-06-17", "last_action": "Completed legislative action", "title": "Memorializing life of Honorable John C. Yoder", "description": "Memorializing life of Honorable John C. Yoder"}, "47": {"bill_id": 1020988, "number": "SR105", "change_hash": "6c3624e1cee8fda108ece4e6d3453c77", "url": "https://legiscan.com/WV/bill/SR105/2017/X1", "status_date": "2017-06-26", "status": 4, "last_action_date": "2017-06-26", "last_action": "Completed legislative action", "title": "Notifying House of Delegates Senate is ready to adjourn sine die", "description": "Notifying House of Delegates Senate is ready to adjourn sine die"}, "48": {"bill_id": 1020926, "number": "SR106", "change_hash": "dd06fa58e2db17fb1db596272be76e78", "url": "https://legiscan.com/WV/bill/SR106/2017/X1", "status_date": "2017-06-26", "status": 4, "last_action_date": "2017-06-26", "last_action": "Completed legislative action", "title": "Notifying Governor Legislature is ready to adjourn sine die", "description": "Notifying House of Delegates Senate is ready to adjourn sine die"}, "50": {"bill_id": 1011792, "number": "SCR101", "change_hash": "6e27fbf91f22d1940c6a91787df726e9", "url": "https://legiscan.com/WV/bill/SCR101/2017/X1", "status_date": "2017-05-05", "status": 4, "last_action_date": "2017-05-05", "last_action": "House Message received", "title": "Providing for adjournment of Legislature until May 15, 2017", "description": "Providing for adjournment of Legislature until May 15, 2017"}, "51": {"bill_id": 1017022, "number": "SCR102", "change_hash": "f4c725f7583f2c87211ba23fe9048810", "url": "https://legiscan.com/WV/bill/SCR102/2017/X1", "status_date": "2017-05-24", "status": 4, "last_action_date": "2017-05-24", "last_action": "House Message received", "title": "Providing for adjournment of Legislature until June 5, 2017", "description": "Providing for adjournment of Legislature until June 5, 2017"}, "52": {"bill_id": 1018971, "number": "SCR103", "change_hash": "dab84d511b2a117f3f950db0814be644", "url": "https://legiscan.com/WV/bill/SCR103/2017/X1", "status_date": "2017-06-09", "status": 4, "last_action_date": "2017-06-12", "last_action": "House received Senate message", "title": "Suspending provisions of Joint Rule 3 relating to committee of conference on House Bill 107", "description": "Suspending provisions of Joint Rule 3 relating to committee of conference on House Bill 107"}, "53": {"bill_id": 1019664, "number": "SCR104", "change_hash": "884ba410544915f01560e529bd89a2ee", "url": "https://legiscan.com/WV/bill/SCR104/2017/X1", "status_date": "2017-06-16", "status": 4, "last_action_date": "2017-06-16", "last_action": "House Message received", "title": "Suspending provisions of Joint Rule 3 relating to committee of conference on House Bill 106", "description": "Suspending provisions of Joint Rule 3 relating to committee of conference on House Bill 106"}, "54": {"bill_id": 1019973, "number": "SCR105", "change_hash": "ba36760a7db196b061290a2ffe800aba", "url": "https://legiscan.com/WV/bill/SCR105/2017/X1", "status_date": "2017-06-16", "status": 4, "last_action_date": "2017-06-17", "last_action": "House Message received", "title": "Suspending provisions of Joint Rule 3 relating to conference committee on House Bill 106", "description": "Suspending provisions of Joint Rule 3 relating to conference committee on House Bill 106"}}