{"session": {"session_id": 1536, "state_id": 48, "year_start": 2018, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2018 Regular Session", "session_name": "2018 Regular Session"}, "792": {"bill_id": 1070243, "number": "HB4281", "change_hash": "0187b2ae8c71119e3a65d24e75973d56", "url": "https://legiscan.com/WV/bill/HB4281/2018", "status_date": "2018-01-24", "status": 1, "last_action_date": "2018-01-24", "last_action": "To House Judiciary", "title": "Prohibiting civil rights violations based on gender identity, or sexual orientation", "description": "The purpose of this bill is to prohibit civil rights violations based on gender identity, or sexual orientation. The bill provides that evidence of constitutionally protected speech or associations is not admissible in criminal prosecutions except in certain situations. The bill provides for sentencing alternatives for persons convicted of violations. And, the amendments to this section are to be known as the “Justice Through Grace in Communities Act”."}, "830": {"bill_id": 1072757, "number": "HB4319", "change_hash": "a56e1660c0e6b155df672dbfc906ccd7", "url": "https://legiscan.com/WV/bill/HB4319/2018", "status_date": "2018-01-26", "status": 1, "last_action_date": "2018-01-26", "last_action": "To House Industry and Labor", "title": "Adding “sexual orientation” and “gender identity” to the categories covered by the Human Rights Act", "description": "The purpose of this bill is to add “sexual orientation” and “gender identity” to the categories covered by the Human Rights Act, prohibiting discrimination in employment and places of public accommodation. The bill adds “age”, “sexual orientation” and “gender identity” to the categories covered by the Fair Housing Act prohibiting discrimination in housing. The bill defines “sexual orientation” and “gender identity”."}}