{"session": {"session_id": 1051, "state_id": 37, "year_start": 2013, "year_end": 2013, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2013 1st Special Session", "session_name": "2013 1st Special Session"}, "0": {"bill_id": 609533, "number": "HB3601", "change_hash": "7095575de1d9bfec8522f74318306447", "url": "https://legiscan.com/OR/bill/HB3601/2013/X1", "status_date": "2013-10-08", "status": 4, "last_action_date": "2013-10-08", "last_action": "Chapter 5, (2013 Laws): Effective date January 1, 2014.", "title": "Relating to taxation; prescribing an effective date; and providing for revenue raising that requires approval by a three-fifths majority.", "description": "Increases corporate excise tax rate on taxable income between $1 million and $10 million. Eliminates personal exemption credit for taxpayer with federal adjusted gross income of $100,000 or more for single return, or $200,000 or more for joint return. Modifies income tax treatment of senior medical expenses. Converts itemized deduction to subtraction from federal taxable income. Phases out amount of subtraction based on income. Increases age restriction over time. Applies to tax years beginning on or after January 1, 2013. Increases percentage of federal earned income credit allowable as credit against Oregon personal income tax. Applies to tax years beginning on or after January 1, 2014. Exempts existing interest charge domestic international sales corporations from corporate minimum tax. Imposes tax on commission received by domestic international sales corporation. Creates subtraction from federal taxable income for dividend received from domestic international sales corporation. and provides reduced corporate excise tax rate.Ù Applies to tax years beginning on or after January 1, 2013. Allows for reduced rates of personal income tax imposed on nonpassive income attributable to partnership or S corporation if certain conditions are met. Applies to tax years beginning on or after January 1, 2015. Adjusts certain rates if revenue loss attributable to reduced rates departs from target percentage. Incrementally increases tax on cigarettes over five years. Distributes tax revenues from increase on cigarette tax to Oregon Health Authority for mental health programs. First applies to distributions of cigarettes occurring on or after January 1, 2014. Increases rate above which revenue from corporate excise tax for tax years beginning on or after January 1, 2013, and before January 1, 2017, is to be deposited in Oregon Rainy Day Fund. Takes effect on 91st day following adjournment sine die."}, "1": {"bill_id": 609479, "number": "HB5101", "change_hash": "9ea817ac7168ca13474e36acaea0362e", "url": "https://legiscan.com/OR/bill/HB5101/2013/X1", "status_date": "2013-10-08", "status": 4, "last_action_date": "2013-10-08", "last_action": "Chapter 1, (2013 Laws): Effective date October 8, 2013.", "title": "Relating to state financial administration; appropriating money; and declaring an emergency.", "description": "Increases biennial appropriation to Department of Education for State School Fund. Modifies amount department may spend from State School Fund for fiscal year beginning July 1, 2014. Increases biennial appropriation to Department of Community Colleges and Workforce Development for Community College Support Fund. Increases biennial appropriation to Oregon Department of Administrative Services for Oregon University System to limit tuition increases. Increases biennial appropriation to Department of Human Services for aging and people with disabilities and developmental disabilities programs. Appropriates moneys from General Fund to Emergency Board for allocations during biennium to state agencies to fund senior services. Increases biennial appropriation to Department of Transportation for Public Transit Division's Elderly and People with Disabilities Transportation Program. Increases limitation on biennial expenditures of Oregon Health Authority for community mental health services. Declares emergency, effective on passage."}, "2": {"bill_id": 609420, "number": "HCR51", "change_hash": "156e5caf1751641c05ae14b298e30846", "url": "https://legiscan.com/OR/bill/HCR51/2013/X1", "status_date": "2013-10-07", "status": 4, "last_action_date": "2013-10-07", "last_action": "Filed with Secretary of State.", "title": "Adjourning sine die special session of Seventy-seventh Legislative Assembly.", "description": "Adjourns sine die special session of Seventy-seventh Legislative Assembly."}, "3": {"bill_id": 609357, "number": "SB861", "change_hash": "5cc6bf0e40603f5c0bd8d96d77902292", "url": "https://legiscan.com/OR/bill/SB861/2013/X1", "status_date": "2013-10-09", "status": 4, "last_action_date": "2013-10-09", "last_action": "Effective date, October 8, 2013.", "title": "Relating to cost-of-living adjustments under the Public Employees Retirement System; and declaring an emergency.", "description": "Modifies cost-of-living adjustment under Public Employees Retirement System. Directs Public Employees Retirement Board to make annual supplementary payments to members or member's beneficiaries with yearly allowance or yearly pension or benefit of $20,000 or less. Directs board to develop formula for determining whether it is reasonably prudent to make annual supplementary payments to members and member's beneficiaries with yearly allowance or yearly pension or benefit of more than $20,000 and not more than $60,000Ù. Directs board to report to Legislative Assembly with recommendations relating to cost-of-living adjustment and supplementary payments.Ù Sunsets supplementary payments on December 31, 2019. Directs board to report to Governor, President of Senate and Speaker of House of Representatives on recommendations relating to cost-of-living adjustment and supplementary payments. Provides for expedited review by Supreme Court upon petition by adversely affected party. Declares emergency, effective on passage."}, "4": {"bill_id": 609560, "number": "SB862", "change_hash": "30e0665849352938ed8141f6139699ff", "url": "https://legiscan.com/OR/bill/SB862/2013/X1", "status_date": "2013-10-09", "status": 4, "last_action_date": "2013-10-09", "last_action": "Effective date, October 8, 2013.", "title": "Relating to public employee retirement; and declaring an emergency.", "description": "Excludes certain increases in salary made by employer to pay for insurance coverage from calculation of final average salary for members of Oregon Public Service Retirement Plan. Provides that retirement allowance or other distribution payable to member of Public Employees Retirement System who is convicted of felony is subject to execution, garnishment, attachment or other process to collect portion of money award included in judgment in criminal action. Modifies options available to members of Legislative Assembly under Public Employees Retirement System. Provides for expedited review by Supreme Court upon petition by adversely affected party. Declares emergency, effective on passage."}, "5": {"bill_id": 609432, "number": "SB863", "change_hash": "ad3959d63f7ea202032b83bb324899b7", "url": "https://legiscan.com/OR/bill/SB863/2013/X1", "status_date": "2013-10-09", "status": 4, "last_action_date": "2013-10-09", "last_action": "Effective date, October 8, 2013.", "title": "Relating to preemption of the local regulation of agriculture; and declaring an emergency.", "description": "Makes legislative finding and declaration that regulation of agricultural seed, flower seed, nursery seed and vegetable seed and products of agricultural seed, flower seed, nursery seed and vegetable seed be reserved to state. Prohibits enactment or enforcement of local laws or measures to regulate agricultural seed, flower seed, nursery seed and vegetable seed or products of agricultural seed, flower seed, nursery seed and vegetable seed. Declares emergency, effective on passage."}}