{"session": {"session_id": 1795, "state_id": 37, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "3rd Special Session", "session_title": "2020 3rd Special Session", "session_name": "2020 3rd Special Session"}, "0": {"bill_id": 1388583, "number": "HB4401", "change_hash": "5a57e549888896448679e7582162b0c0", "url": "https://legiscan.com/OR/bill/HB4401/2020/X3", "status_date": "2020-12-23", "status": 4, "last_action_date": "2020-12-23", "last_action": "Chapter 3, (2020 Laws): Effective date December 23, 2020.", "title": "Relating to residential tenancies; declaring an emergency.", "description": "Requires Housing and Community Services Department to provide distributions to certain residential landlords for unpaid rent after April 1, 2020. Requires Housing and Community Services Department to provide distributions to certain residential landlords for unpaid rent after April 1, 2020. Requires department to report to Legislative Assembly on grants by September 15, 2021. Sunsets January 2, 2023. Extends until December 31, 2020, emergency period during which residential evictions for nonpayment are prohibited. Extends until June 30, 2021, prohibitions of terminations without cause, emergency period and repayment date for nonpayment by tenants declaring financial hardships. Extends 72- and 144-hour notices for nonpayment of rent to 10- and 13-day notices and increases penalty for landlord's retaliatory conduct until June 30, 2021. Tolls statute of limitations for residential landlords' claims for nonpayment through June 30, 2021. Declares emergency, effective on passage."}, "1": {"bill_id": 1388590, "number": "HB4402", "change_hash": "52cf4218b3e958ed49a813f635066bc6", "url": "https://legiscan.com/OR/bill/HB4402/2020/X3", "status_date": "2020-12-23", "status": 4, "last_action_date": "2020-12-23", "last_action": "Chapter 4, (2020 Laws): Effective date December 23, 2020.", "title": "Relating to claims arising during the COVID-19 emergency period; declaring an emergency.", "description": "Limits liability of school districts, union high schools, education service districts, public charter schools, private schools providing instruction to any grade from kindergarten through grade 12 and community colleges for certain claims arising during COVID-19 emergency period. Limits liability of school districts, union high schools, education service districts, public charter schools, private schools providing instruction to any grade from kindergarten through grade 12 and community colleges for certain claims arising during COVID-19 emergency period. Prohibits certain private employers from engaging in retaliatory conduct relating to protected activities taken by employee during COVID-19 emergency period. Declares emergency, effective on passage."}, "2": {"bill_id": 1388579, "number": "SB1801", "change_hash": "11e8a1bb7be028fdcee5a17eec87732e", "url": "https://legiscan.com/OR/bill/SB1801/2020/X3", "status_date": "2020-12-23", "status": 4, "last_action_date": "2020-12-23", "last_action": "Governor signed.", "title": "Relating to consumable items; and declaring an emergency.", "description": "Allows holder of full on-premises sales license to sell and deliver mixed drinks or single serving of wine in sealed containers for off-premises consumption. Allows holder of full on-premises sales license to sell and deliver mixed drinks or single serving of wine in sealed containers for off-premises consumption. Requires Oregon Liquor Control Commission to adopt rules providing that not more than two mixed drinks or single servings of wine may be ordered per substantial food item ordered. Limits fees that third-party food platform may charge restaurant. Exempts restaurants located in specified jurisdictions from limits on fees. Establishes private right of action against third-party food platform for specified violation. Defines \"third-party food platform.\" Requires third-party food platform to meet certain requirements within seven days of effective date. Sunsets 60 days after date on which declaration of state of emergency issued by Governor on March 8, 2020, and any extension of declaration, is no longer in effect. Declares emergency, effective on passage."}, "3": {"bill_id": 1388572, "number": "SB1802", "change_hash": "e7edccaf0b54f6743d18950dbc2404aa", "url": "https://legiscan.com/OR/bill/SB1802/2020/X3", "status_date": "2020-12-21", "status": 6, "last_action_date": "2020-12-21", "last_action": "At President's desk upon adjournment.", "title": "Relating to civil claims arising during the COVID-19 emergency period; declaring an emergency.", "description": "Limits liability of health care providers, health maintenance organizations and hospitals for certain claims arising during COVID-19 emergency period. Limits liability of health care providers, health maintenance organizations and hospitals for certain claims arising during COVID-19 emergency period. Declares emergency, effective on passage."}, "4": {"bill_id": 1388575, "number": "SB1803", "change_hash": "d50f6345076c116b20d18fd5b0187490", "url": "https://legiscan.com/OR/bill/SB1803/2020/X3", "status_date": "2020-12-21", "status": 6, "last_action_date": "2020-12-21", "last_action": "In committee upon adjournment.", "title": "Relating to health care provided during the COVID-19 emergency period; declaring an emergency.", "description": "Limits liability of hospitals, health maintenance organizations, health care providers and locations where health care services are provided for certain claims arising during COVID-19 emergency period. Limits liability of hospitals, health maintenance organizations, health care providers and locations where health care services are provided for certain claims arising during COVID-19 emergency period. Declares emergency, effective on passage."}, "5": {"bill_id": 1388567, "number": "SB5731", "change_hash": "8722e881cf802d40190ac3b5a70e4f42", "url": "https://legiscan.com/OR/bill/SB5731/2020/X3", "status_date": "2020-12-23", "status": 4, "last_action_date": "2020-12-23", "last_action": "Governor signed.", "title": "Relating to state financial administration; and declaring an emergency.", "description": "Appropriates moneys from General Fund to Emergency Board for allocations during current biennium. Appropriates moneys from General Fund to Emergency Board for allocations during current biennium. Appropriates moneys to Housing and Community Services Department for certain expenses. Declares emergency, effective on passage."}, "6": {"bill_id": 1388586, "number": "SCR231", "change_hash": "0cc32ada7df24c755b35d3f8c2b454cc", "url": "https://legiscan.com/OR/bill/SCR231/2020/X3", "status_date": "2020-12-23", "status": 4, "last_action_date": "2020-12-23", "last_action": "Filed With Secretary of State.", "title": "Adjourning sine die 2020 third special session of Eightieth Legislative Assembly.", "description": "Adjourns sine die 2020 third special session of Eightieth Legislative Assembly. Adjourns sine die 2020 third special session of Eightieth Legislative Assembly."}}