{"session": {"session_id": 1763, "state_id": 37, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "2nd Special Session", "session_title": "2020 2nd Special Session", "session_name": "2020 2nd Special Session"}, "0": {"bill_id": 1375809, "number": "HB4301", "change_hash": "05fa980f5728b8663f14701f80174a2e", "url": "https://legiscan.com/OR/bill/HB4301/2020/X2", "status_date": "2020-10-01", "status": 4, "last_action_date": "2020-10-01", "last_action": "Chapter 3, (2020 Laws): Effective date September 1, 2020.", "title": "Relating to the use of force; declaring an emergency.", "description": "Provides that peace officer or corrections officer may not use force that impedes normal breathing or circulation of blood of another person by applying pressure on throat or neck except in specified circumstances. Provides that peace officer or corrections officer may not use force that impedes normal breathing or circulation of blood of another person by applying pressure on throat or neck except in specified circumstances. Modifies justification defenses available to peace officer who uses physical force or deadly physical force upon another person. Requires peace officer to give verbal warning, and reasonable opportunity to comply, before using physical force or deadly physical force if reasonable opportunity to do so exists. Requires peace officer to consider alternatives to physical force or deadly physical force if reasonable opportunity to do so exists. Declares emergency, effective on passage."}, "1": {"bill_id": 1375810, "number": "HB4302", "change_hash": "8b43cbb7c70cf3054a63a1c00e16cad4", "url": "https://legiscan.com/OR/bill/HB4302/2020/X2", "status_date": "2020-10-01", "status": 4, "last_action_date": "2020-10-01", "last_action": "Chapter 4, (2020 Laws): Effective date January 1, 2021.", "title": "Relating to geological permits.", "description": "Establishes and modifies fees and requirements relating to permits for mineral exploration, mining operations, exclusion certificates, gas and oil drilling and exploration and geothermal well drilling operation. Establishes and modifies fees and requirements relating to permits for mineral exploration, mining operations, exclusion certificates, gas and oil drilling and exploration and geothermal well drilling operation. Limits number and distribution of onshore exploration sites and oil, gas and geothermal wells."}, "2": {"bill_id": 1375808, "number": "HB4303", "change_hash": "97336e16c0a2dd5d72a383fd952f505d", "url": "https://legiscan.com/OR/bill/HB4303/2020/X2", "status_date": "2020-10-01", "status": 4, "last_action_date": "2020-10-01", "last_action": "Chapter 7, (2020 Laws): Effective date September 20, 2020.", "title": "Relating to state financial administration; declaring an emergency; providing for transfer of moneys from the Education Stability Fund that requires approval by a three-fifths majority.", "description": "Directs State Treasurer to transfer moneys from Education Stability Fund to State School Fund. Directs State Treasurer to transfer moneys from Education Stability Fund to State School Fund. Declares emergency, effective on passage."}, "3": {"bill_id": 1375807, "number": "HB4304", "change_hash": "cae3d27d58a16af032977f42d7ab4b03", "url": "https://legiscan.com/OR/bill/HB4304/2020/X2", "status_date": "2020-08-10", "status": 3, "last_action_date": "2020-08-24", "last_action": "President signed.", "title": "Relating to state financial administration; declaring an emergency.", "description": "Modifies requirements relating to certain fiscal reports. Modifies requirements relating to certain fiscal reports. Establishes, modifies and repeals certain transfers of moneys from funds and accounts to General Fund. Modifies law relating to costs for Oregon transparency website. Directs Oregon Department of Administrative Services to report on certain terms in certain collective bargaining agreements. Modifies authorized debt service payments. Directs Public Employees Retirement Board to submit proposals for crediting amounts to funds or accounts. Repeals transfers of certain moneys to certain funds. Directs Legislative Assembly to reflect balances of General Fund appropriations made to judicial and legislative departments, and adjustments thereto, in appropriation measures. Establishes and modifies programs for economic development. Modifies procedure for payment to children's advocacy centers. Modifies permissible uses of moneys in certain Department of Justice account. Modifies permissible uses for certain moneys allocated to Housing and Community Services Department. Transfers moneys for department purposes. Provides for distribution of certain federal moneys by department. Repeals certain pilot programs within Housing and Community Services Department and Department of Human Services. Abolishes Wildfire Damage Housing Relief Account. Permits use of certain revenues for operating costs of Oregon Department of Aviation. Modifies operative date for provisions relating to in-home care. Modifies procedure for expenditures from Water Supply Development Account. Authorizes use of Early Learning Account for construction of facilities. Specifies amounts transferred to education accounts. Authorizes use of Connect Oregon Fund for Coos Bay rail project. Authorizes contract for study related to wildfire costs. Encourages recipients of grants from Student Investment Account to prioritize use of grant moneys for purpose of meeting students' mental or behavioral health needs. Authorizes school district or public charter school that submitted grant application or entered into grant agreement for moneys from Student Investment Account for 2020-2021 school year to submit amended grant application or amended grant agreement. Declares emergency, effective on passage."}, "5": {"bill_id": 1375800, "number": "HCR221", "change_hash": "2b91fcb293bf997ca087faee3ea1556a", "url": "https://legiscan.com/OR/bill/HCR221/2020/X2", "status_date": "2020-09-03", "status": 4, "last_action_date": "2020-09-03", "last_action": "Filed with Secretary of State.", "title": "Amending Legislative Branch Personnel Rule 27 and adopting Legislative Branch Personnel Rule 27-A.", "description": "Modifies obligation to make conduct reports under rule. Modifies obligation to make conduct reports under rule. Directs Legislative Equity Officer or, at officer's request, investigator to perform facial review on conduct reports and conduct complaints prior to investigation being undertaken. Provides exception. Provides that committee on conduct is to make recommendations on remedial measures to be imposed on partisan staff only if independent investigator has determined that rule violation has occurred. Extends time period committees on conduct have to conduct hearings, and to recommend and impose remedial measures on partisan staff. Expands numbers of alternates who serve on committees on conduct. Directs that complainants and identified impacted parties in matter be recused from service on committees on conduct when committee considers matter. Sunsets December 31, 2025."}, "6": {"bill_id": 1375805, "number": "SB1701", "change_hash": "d12e64bd7c06d0b96d2cb96c71cb516c", "url": "https://legiscan.com/OR/bill/SB1701/2020/X2", "status_date": "2020-10-06", "status": 4, "last_action_date": "2020-10-06", "last_action": "Effective date, September 1, 2020.", "title": "Relating to unemployment insurance benefits; declaring an emergency.", "description": "Provides that unemployed individual receiving unemployment insurance benefits for weeks ending before January 1, 2022, who has earnings from less than full-time employment may earn greater of $300 or one-third of individual's weekly benefit amount before individual's weekly benefit amount is reduced. Provides that unemployed individual receiving unemployment insurance benefits for weeks ending before January 1, 2022, who has earnings from less than full-time employment may earn greater of $300 or one-third of individual's weekly benefit amount before individual's weekly benefit amount is reduced. Declares emergency, effective on passage."}, "8": {"bill_id": 1375803, "number": "SB1703", "change_hash": "c8a9ea5617dd62ada808fd0b3991023b", "url": "https://legiscan.com/OR/bill/SB1703/2020/X2", "status_date": "2020-10-06", "status": 4, "last_action_date": "2020-10-06", "last_action": "Effective date, September 1, 2020.", "title": "Relating to emergency disclosure by the Department of Revenue of certain tax information to state agencies; declaring an emergency.", "description": "Provides temporarily that during statutorily declared emergency Governor may authorize Director of Department of Revenue to disclose certain information set forth in tax report or return to Director of Employment Department if Director of Department of Revenue determines that administration of any federal or state law or program requires disclosure to enable Employment Department to verify identity or income level of any person for purposes related to emergency or any consequences of emergency. Provides temporarily that during statutorily declared emergency Governor may authorize Director of Department of Revenue to disclose certain information set forth in tax report or return to any state agency] Director of Employment Department if Director of Department of Revenue determines that administration of any federal or state law or program , including, but not limited to, administration of unemployment insurance laws and programs by Employment Department,] requires disclosure to enable agency] Employment Department to verify identity or income level of any person for purposes related to emergency or any consequences of emergency. Declares emergency, effective on passage."}, "12": {"bill_id": 1375802, "number": "SCR221", "change_hash": "66bdfc33c56e99d3bb20eb7d3b87290a", "url": "https://legiscan.com/OR/bill/SCR221/2020/X2", "status_date": "2020-08-25", "status": 4, "last_action_date": "2020-08-25", "last_action": "Filed With Secretary of State.", "title": "Adjourning sine die the 2020 second special session of the Eightieth Legislative Assembly.", "description": "Adjourns sine die 2020 second special session of Eightieth Legislative Assembly. Adjourns sine die 2020 second special session of Eightieth Legislative Assembly."}}