{"session": {"session_id": 1752, "state_id": 37, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2020 1st Special Session", "session_name": "2020 1st Special Session"}, "22": {"bill_id": 1371328, "number": "SB1606", "change_hash": "93c8ed08e8fba1ac43de69b8ee051852", "url": "https://legiscan.com/OR/bill/SB1606/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to health care; and declaring an emergency.", "description": "Prohibits hospital from conditioning admission or treatment, or suggesting that treatment is conditioned, on patient having POLST or executing advance directive or other instruction regarding administration, withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration. Prohibits hospital from conditioning admission or treatment, or suggesting that treatment is conditioned, on patient having POLST or executing advance directive or other instruction regarding administration, withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration. Requires hospital to permit presence of support person for person with disability in emergency department and during hospital stay under specified conditions. Allows hospital to impose conditions to ensure safety of patient, support person and staff. Authorizes civil penalty or revocation or suspension of license] for violations of specified provisions. Requires health care provider to immediately notify state protection and advocacy organization if, during state of emergency or public health emergency, person acting on behalf of patient with intellectual or developmental disability authorizes withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration or transfer of patient to hospice care or if patient is denied services, care, equipment or treatment based on crisis care guidance.] Requires notification to Department of Human Services case manager, if any, and state protection and advocacy organization] before withholding or withdrawing from person with intellectual or developmental disability life-sustaining procedures or artificially administered nutrition and hydration during state of emergency or state of public health emergency]. Creates unlawful practice of denying medical treatment or restricting or limiting allocation of medical resources to protected class or based on patient's race, color, national origin, sex, sexual orientation, gender identity, age or disability.] Declares emergency, effective on passage."}}