{"session": {"session_id": 1752, "state_id": 37, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2020 1st Special Session", "session_name": "2020 1st Special Session"}, "0": {"bill_id": 1371326, "number": "HB4201", "change_hash": "c93a57a371774559c287b4bdfc824c67", "url": "https://legiscan.com/OR/bill/HB4201/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 1, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to the use of force by police officers; and declaring an emergency.", "description": "Establishes Joint Committee on Transparent Policing and Use of Force Reform. Requires law enforcement agency to notify Attorney General when police officer uses physical force resulting in death or qualifying physical injury. Requires Attorney General to appoint special investigator to lead investigation upon receipt of notification. Directs Attorney General to prosecute violations of law related to use of physical force. Directs Attorney General to release reports from investigation if criminal proceedings are not initiated.] Establishes Joint Committee on Transparent Policing and Use of Force Reform. Directs committee to examine policies related to use of force and transparency in policing and recommend legislation to committees of Legislative Assembly related to judiciary on or before December 31, 2020. Sunsets committee on December 31, 2020. Declares emergency, effective on passage."}, "1": {"bill_id": 1371312, "number": "HB4202", "change_hash": "30191e121e00019c015a12d9a034c25b", "url": "https://legiscan.com/OR/bill/HB4202/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 2, (2020 Laws): Effective date September 25, 2020.", "title": "Relating to taxation; and prescribing an effective date.", "description": "Modifies administrative provisions of corporate activity tax. Modifies administrative provisions of corporate activity tax. Exempts from taxation certain sales of milk and manufactured dwelling park nonprofit cooperatives. Allows unitary group taxpayer to exclude members lacking ties to state. Defines \"cost inputs\" for taxpayer engaged in farming operation, for purpose of calculating subtraction. Establishes methods for taxpayer engaged in farming operation to demonstrate percentage of goods sold in state compared to outside state for purposes of determining commercial activity. Specifies that taxpayer is required to register only one time. Provides that returns and allowances are allowed as offset against commercial activity in year that returns or allowances are made. Prescribes methods for apportionment of subtraction. Establishes penalties for failure to file annual return or failure to pay tax by due date of annual return. Requires minimum payment per quarter but bars penalty if taxpayer makes payment equal to required installment for corresponding quarter of prior year. Applies to tax years beginning on or after January 1, 2020. Takes effect on 91st day following adjournment sine die."}, "2": {"bill_id": 1371311, "number": "HB4203", "change_hash": "e59e5da7c18e635103c89eae2ef68d41", "url": "https://legiscan.com/OR/bill/HB4203/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 3, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to use of force by peace officers; and declaring an emergency.", "description": "Provides that peace officer may not use force that impedes normal breathing or circulation of blood of another person by applying pressure on throat or neck, unless peace officer may use deadly physical force. Provides that peace officer may not use force that limits ability of person to breathe, including but not limited to choke holds] impedes normal breathing or circulation of blood of another person by applying pressure on throat or neck, unless peace officer may use deadly physical force. Directs Board on Public Safety Standards and Training to adopt rules prohibiting training of police officers and reserve officers to use force that impedes normal breathing or circulation of blood of another person by applying pressure on throat or neck, except as defensive maneuver. Declares emergency, effective on passage."}, "3": {"bill_id": 1371306, "number": "HB4204", "change_hash": "29d953f300f092d8dc77a262b3624c2d", "url": "https://legiscan.com/OR/bill/HB4204/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 4, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to strategies to protect Oregonians from the effects of the COVID-19 pandemic; and declaring an emergency.", "description": "Establishes temporary limitations on lenders being able to enforce default remedies on obligations secured by mortgages, trust deeds, land sale contracts or other instruments. Establishes temporary limitations on lenders being able to enforce default remedies on obligations secured by mortgages, trust deeds, land sale contracts or other instruments. Provides for certain exemptions. Requires lenders to defer payments if lender and borrower do not otherwise agree on loan mitigation, deferral or other foreclosure avoidance measure and permits borrower to pay deferred amounts at end of loan term. Provides that lender may adjust escrow impound payment and take into account deficiencies or shortages that result from deferring borrower's payments. Requires borrower to provide notice to lenders if borrower cannot make periodic installment payment. Specifies notice requirements for residential and commercial borrowers. Prohibits lenders from collecting various fees, penalties and charges during emergency period and from undertaking specified practices. Requires courts to dismiss foreclosure proceedings brought during emergency period without prejudice. Permits borrower that suffers ascertainable loss of money or property because lender took prohibited action to bring action for actual damages. Requires lender to provide written notice to borrower of borrower's rights for accommodation under Act. Declares emergency, effective on passage."}, "4": {"bill_id": 1371322, "number": "HB4205", "change_hash": "54f7d4b7c8d17ebcead38494f805b424", "url": "https://legiscan.com/OR/bill/HB4205/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 5, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to duties of police officers regarding prohibited behavior; and declaring an emergency.", "description": "Requires police officer or reserve officer to intervene to prevent or stop another officer engaged in certain misconduct, unless intervening officer cannot intervene safely. Directs Department of Public Safety Standards and Training to adopt rules requiring police officer to intervene to stop another police officer from engaging in act that is unethical or that violates law, rules or policy. Directs department to adopt rules requiring police officer to report to appropriate authority when any police officer engages in act that is unethical or that violates law, rules or policy.] Requires police officer or reserve officer to intervene to prevent or stop another officer engaged in certain misconduct, unless intervening officer cannot intervene safely. Requires police officer or reserve officer who witnesses another officer engaged in certain misconduct to report misconduct to supervisor within 72 hours after witnessing misconduct. Prohibits discrimination or retaliation against officer who intervenes or reports as required. Directs Department of Public Safety Standards and Training to report annually to appropriate committee of Legislative Assembly on rules adopted by department to implement requirements. Declares emergency, effective on passage."}, "5": {"bill_id": 1371325, "number": "HB4206", "change_hash": "9a9a1a83660ef54871733816e94cc9a7", "url": "https://legiscan.com/OR/bill/HB4206/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 6, (2020 Laws): Effective date January 1, 2021.", "title": "Relating to meat.", "description": "Authorizes State Department of Agriculture to adopt rules establishing program of state inspection for processing and sale of meat products from amenable species, including but not limited to cattle and sheep. Authorizes State Department of Agriculture to adopt rules establishing program of state inspection for processing and sale of meat products from amenable species, including but not limited to cattle and sheep. Authorizes department to adopt rules establishing program of state inspection for processing and sale of meat products from nonamenable species, as defined by department by rule. Provides that authorization excludes program for inspection for processing or sale of meat products from equines."}, "6": {"bill_id": 1371324, "number": "HB4207", "change_hash": "86d1058ade38ef9c9ff5c40ca02266f3", "url": "https://legiscan.com/OR/bill/HB4207/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 7, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to records of discipline of police officers; and declaring an emergency.", "description": "Directs Department of Public Safety Standards and Training to establish public statewide online database of suspensions and revocations of certifications of police officers. Directs Department of Public Safety Standards and Training to establish statewide database of police officer discipline records. Directs department to publish online information about disciplinary proceedings against police officers.] Directs Department of Public Safety Standards and Training to establish public statewide online database of suspensions and revocations of certifications of police officers. Directs department to submit annual report to appropriate committee of Legislative Assembly on complaints against police officers] database. Requires law enforcement agency, before extending offer of employment to police officer applicant, to request and review personnel records of applicant from law enforcement agencies that previously employed applicant. Requires law enforcement agencies to maintain and share personnel records. Limits liability of agency that complies with requirements. Requires department to deny application for training or deny, suspend or revoke certification of police officer based upon certain findings. Declares emergency, effective on passage."}, "7": {"bill_id": 1371323, "number": "HB4208", "change_hash": "8d8f62d27debb9aa61596e9225916141", "url": "https://legiscan.com/OR/bill/HB4208/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 8, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to the use of tools by law enforcement agencies; and declaring an emergency.", "description": "Prohibits law enforcement agencies from using tear gas for purposes of crowd control except in circumstances constituting riot. Prohibits law enforcement agencies from using tear gas or from using long range acoustic devices or sound cannons.] for purposes of crowd control except in circumstances constituting riot. Requires law enforcement agency to follow certain procedure when using tear gas in circumstances constituting riot. Declares emergency, effective on passage."}, "8": {"bill_id": 1371305, "number": "HB4209", "change_hash": "a084ce00212395568e7f3f794a5d9708", "url": "https://legiscan.com/OR/bill/HB4209/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 9, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to awarding moneys through programs in the eastern Oregon border region; and declaring an emergency.", "description": "Allows Eastern Oregon Border Economic Development Board to enter into agreement with third-party administrator to operate programs for awarding grants and making loans that enhance and expand workforce development and economic development in Eastern Oregon Border Economic Development Region. Allows Eastern Oregon Border Economic Development Board to enter into agreement with third-party administrator to operate programs for awarding grants and making loans that enhance and expand workforce development and economic development in Eastern Oregon Border Economic Development Region. Requires that board submit proposed agreement to Oregon Business Development Department for review. Declares emergency, effective on passage."}, "9": {"bill_id": 1371318, "number": "HB4210", "change_hash": "5242adb2ed825521b4d68100f813d8dd", "url": "https://legiscan.com/OR/bill/HB4210/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 10, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to driving privileges; and declaring an emergency.", "description": "Repeals driving privilege suspension and eliminates imposition of driving privilege restrictions for failure to pay fine. Repeals driving privilege suspension and eliminates imposition of driving privilege restrictions for failure to pay fine. Becomes operative October 1, 2020. Authorizes Department of Transportation to take certain actions before operative date of Act. Declares emergency, effective on passage."}, "10": {"bill_id": 1371321, "number": "HB4211", "change_hash": "ab4769fe4d30b98b1360d04b715191a3", "url": "https://legiscan.com/OR/bill/HB4211/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 11, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to the Fund for Student Success; and declaring an emergency.", "description": "Clarifies timing of when Department of Education is required to make transfers from Fund for Student Success. Clarifies timing of when Department of Education is required to make transfers from Fund for Student Success. Declares emergency, effective on passage."}, "12": {"bill_id": 1371307, "number": "HB4213", "change_hash": "ef3ac98b04809774f10399f5463b7aee", "url": "https://legiscan.com/OR/bill/HB4213/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 13, (2020 Laws): Effective date June 30, 2020.", "title": "Relating to evictions; and declaring an emergency.", "description": "Prohibits during emergency period and grace period residential and commercial evictions for nonpayment during emergency period. Prohibits residential and commercial evictions under specified conditions during emergency period.] Prohibits during emergency period and grace period residential and commercial evictions for nonpayment during emergency period. Tolls statute of limitations for claims for residential nonpayment during emergency period and grace period. Prohibits residential evictions without cause during emergency period. Declares emergency, effective on passage."}, "13": {"bill_id": 1371522, "number": "HB4214", "change_hash": "46fde314bcac952f48dd8abf72584ffe", "url": "https://legiscan.com/OR/bill/HB4214/2020/X1", "status_date": "2020-07-07", "status": 4, "last_action_date": "2020-07-07", "last_action": "Chapter 14, (2020 Laws): Effective date January 1, 2021.", "title": "Relating to Indian children.", "description": "Declares Oregon policy regarding Indian children. Declares Oregon policy regarding Indian children. Modifies Oregon child welfare laws regarding Indian children to reconcile with provisions of federal Indian Child Welfare Act."}, "14": {"bill_id": 1371315, "number": "HB5211", "change_hash": "e60c846049096113e5fef680f9cbc936", "url": "https://legiscan.com/OR/bill/HB5211/2020/X1", "status_date": "2020-06-26", "status": 6, "last_action_date": "2020-06-26", "last_action": "In committee upon adjournment.", "title": "Relating to state financial administration; declaring an emergency.", "description": "Appropriates moneys from General Fund to _____ for biennial expenses. Appropriates moneys from General Fund to _____ for biennial expenses. Limits biennial expenditures from fees, moneys or other revenues, including Miscellaneous Receipts, but excluding lottery funds and federal funds, collected or received by _______. Limits biennial expenditures of _____ from federal funds. Declares emergency, effective on passage."}, "15": {"bill_id": 1371327, "number": "HCR211", "change_hash": "64a82b9842f82dac25d7d580b2b18437", "url": "https://legiscan.com/OR/bill/HCR211/2020/X1", "status_date": "2020-06-26", "status": 6, "last_action_date": "2020-06-26", "last_action": "In committee upon adjournment.", "title": "Adjourning sine die the 2020 special session of the Eightieth Legislative Assembly.", "description": "Adjourns sine die 2020 special session of Eightieth Legislative Assembly. Adjourns sine die 2020 special session of Eightieth Legislative Assembly."}, "16": {"bill_id": 1371313, "number": "HCR212", "change_hash": "8a47b0ed88785d9e8bb810a074cafe9f", "url": "https://legiscan.com/OR/bill/HCR212/2020/X1", "status_date": "2020-06-30", "status": 4, "last_action_date": "2020-06-30", "last_action": "Filed with Secretary of State.", "title": "Establishing deadlines for presession-filed legislative measures for 2021 regular session.", "description": "Establishes deadlines for presession-filed legislative measures for 2021 regular session of Eighty-first Legislative Assembly. Establishes deadlines for presession-filed legislative measures for 2021 regular session of Eighty-first Legislative Assembly."}, "17": {"bill_id": 1371316, "number": "SB1601", "change_hash": "06b0c76359d9c3d3a7cac0a43c70111b", "url": "https://legiscan.com/OR/bill/SB1601/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to transportation; and declaring an emergency.", "description": "Upon passage, allows Statewide Transportation Improvement Fund moneys to be used to maintain existing public transportation services. Upon passage, allows Statewide Transportation Improvement Fund moneys to be used to maintain existing public transportation services. Merges Elderly and Disabled Transportation Fund with Statewide Transportation Improvement Fund. Repeals provisions related to Elderly and Disabled Transportation Fund and transfers moneys in Elderly and Disabled Transportation Fund to Statewide Transportation Improvement Fund. Specifies that moneys in Statewide Transportation Improvement Fund may not be used to supplant local and regional agency moneys directed to public transportation service providers. Allows use of moneys in fund to support program administration, fund projects of statewide significance and manage operation of public transportation services. Dedicates portion of formula distributions in fund to transit services for older adults and individuals with disabilities. Provides each qualified entity annual target amount and directs Oregon Transportation Commission to adjust target amount depending on rate of growth in fund. Becomes operative July 1, 2023. Imposes moratorium on issuing citations for certain traffic offenses beginning on March 1, 2020, and ending on December 31, 2020. Becomes operative on passage. Declares emergency, effective on passage."}, "18": {"bill_id": 1371320, "number": "SB1602", "change_hash": "ec1eb7ea245e7c1c77647b9a64a0f7c7", "url": "https://legiscan.com/OR/bill/SB1602/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to forests; and declaring an emergency.", "description": "Requires Governor to facilitate mediation sessions between forest industry and environmental interest representatives. Requires Governor to facilitate mediation sessions between forest industry and environmental interest representatives. Identifies purposes and completion goal for, and provides for confidentiality of, mediation sessions. Requires joint legislative committee hearing during 2021 regular session regarding mediation process. Allows person to register with State Forestry Department to receive notice of pesticide applications by helicopter to forestland near person's residence or water intake used by person. Requires notice to department of proposed or imminent pesticide application by helicopter to forestland. Requires department to give notice of application to persons registered to receive notice. Requires notice to department upon completion or partial completion of pesticide application. Provides escalating penalties for failures to report. Caps penalties at $5,000 per day. Requires Pesticide Analytical and Response Center to accept requests from certain entities for records and data concerning pesticide application by helicopter to forestland. Imposes fine of $1,000 for pesticide operator failure to timely supply records or data. Prohibits interfering with pesticide application by helicopter to forestland. Makes violation subject to fine of $1,000 for first offense, or $5,000 for repeat offense, within five years. Prohibits pesticide application by helicopter to forestland in proximity to certain locations. Requires that certain rules apply in Siskiyou Georegion. Requires that inventoried points of diversion for water use qualifying for spray buffer be entered in department reporting system. Requires report to Legislative Assembly regarding inventory progress. Appropriates moneys to Office of Governor for biennium ending June 30, 2021, for paying expenses related to mediation sessions.] Appropriates moneys to State Forestry Department for biennium ending June 30, 2021, for department duties, functions and powers under Act with regard to private forests.] Increases limitation on expenditures for biennium ending June 30, 2021, by State Forestry Department for carrying out department duties, functions and powers under Act with regard to private forests.] Declares emergency, effective on passage."}, "19": {"bill_id": 1371310, "number": "SB1603", "change_hash": "efd61514ef3f0c24e73b26cd6e3408d4", "url": "https://legiscan.com/OR/bill/SB1603/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, September 25, 2020.", "title": "Relating to the universal service fund; and prescribing an effective date.", "description": "Modifies definitions applicable for purposes of universal service surcharge. Modifies definitions applicable for purposes of universal service surcharge. Subjects sale of retail commercial mobile radio services and retail interconnected voice over internet protocol services to universal service surcharge. Reduces rate cap to six percent of sale of services subject to surcharge. Directs Public Utility Commission to transfer up to $5 million per year of moneys deposited in universal service fund to Broadband Fund. Establishes Broadband Fund. Continuously appropriates moneys in Broadband Fund to Oregon Business Development Department to provide grants and loans through, and to administer, program related to broadband. Directs department to adopt program for providing grants and loans by rule. Directs department to report annually to interim committee of Legislative Assembly related to telecommunications on status of Broadband Fund. Sunsets Broadband Fund, transfer of moneys from universal service fund to Broadband Fund and grant program on January 2, 2030. Becomes operative on January 1, 2021. Takes effect on 91st day following adjournment sine die."}, "20": {"bill_id": 1371317, "number": "SB1604", "change_hash": "40bc9a24b5201f225455f086f2df796a", "url": "https://legiscan.com/OR/bill/SB1604/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to arbitration awards; and declaring an emergency.", "description": "Restricts arbitration award from ordering disciplinary action that differs from disciplinary action imposed by law enforcement agency if arbitrator makes finding that misconduct occurred consistent with agency's finding of misconduct, and disciplinary action imposed by agency is consistent with provisions of discipline guide or discipline matrix adopted by agency as result of collective bargaining and incorporated into agency's disciplinary policies. Restricts arbitration award from ordering disciplinary action that differs from disciplinary action imposed by law enforcement agency if arbitrator makes finding that misconduct occurred consistent with agency's finding of misconduct, and disciplinary action imposed by agency is consistent with provisions of discipline guide or discipline matrix adopted by agency as result of collective bargaining and incorporated into agency's disciplinary policies. Specifies that for purposes of collective bargaining involving sworn law enforcement officers of law enforcement agency, \"employment relations\" includes development of discipline guide or discipline matrix. Declares emergency, effective on passage."}, "21": {"bill_id": 1371308, "number": "SB1605", "change_hash": "49d38d31fcf482ac9edcdcfea03c459d", "url": "https://legiscan.com/OR/bill/SB1605/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to children; and declaring an emergency.", "description": "Modifies Oregon Promise program to extend eligibility to certain Oregon foster children who attain their highest level of education while in out-of-state placements. Modifies Oregon Promise program to extend eligibility to certain Oregon foster children who attain their highest level of education while in out-of-state placements. Temporarily permits Department of Human Services to close at screening reports of third party child abuse not involving child's parent or caregiver, member of child's household, person responsible for child's care, provider of child care or school employee, contractor, agent or volunteer. Directs department to report to interim committees of Legislative Assembly related to child welfare regarding reports closed at screening and to identify resources required to investigate all allegations of third party abuse. Sunsets March 31, 2021. Directs Department of Human Services to adopt rules allowing up to two family-based group homes to provide services to certain children. Directs department to report to interim committees of Legislative Assembly related to child welfare regarding success of placements in family-based group homes. Sunsets January 2, 2024. Prohibits placement of Oregon children in out-of-state child-caring agency unless child-caring agency is licensed by Department of Human Services. Establishes certain contract requirements and department duties regarding placements of children in out-of-state child-caring agencies. Delays operation of laws regarding placement of children in qualified residential treatment programs to December 1, 2020. Requires qualified residential treatment programs and psychiatric residential treatment programs to maintain site-specific accreditation from nationally recognized organization. Prohibits colocation of children and youth committed to custody of Oregon Youth Authority without court order. Declares emergency, effective July 1, 2020."}, "22": {"bill_id": 1371328, "number": "SB1606", "change_hash": "93c8ed08e8fba1ac43de69b8ee051852", "url": "https://legiscan.com/OR/bill/SB1606/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to health care; and declaring an emergency.", "description": "Prohibits hospital from conditioning admission or treatment, or suggesting that treatment is conditioned, on patient having POLST or executing advance directive or other instruction regarding administration, withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration. Prohibits hospital from conditioning admission or treatment, or suggesting that treatment is conditioned, on patient having POLST or executing advance directive or other instruction regarding administration, withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration. Requires hospital to permit presence of support person for person with disability in emergency department and during hospital stay under specified conditions. Allows hospital to impose conditions to ensure safety of patient, support person and staff. Authorizes civil penalty or revocation or suspension of license] for violations of specified provisions. Requires health care provider to immediately notify state protection and advocacy organization if, during state of emergency or public health emergency, person acting on behalf of patient with intellectual or developmental disability authorizes withholding or withdrawing of life-sustaining procedures or artificially administered nutrition and hydration or transfer of patient to hospice care or if patient is denied services, care, equipment or treatment based on crisis care guidance.] Requires notification to Department of Human Services case manager, if any, and state protection and advocacy organization] before withholding or withdrawing from person with intellectual or developmental disability life-sustaining procedures or artificially administered nutrition and hydration during state of emergency or state of public health emergency]. Creates unlawful practice of denying medical treatment or restricting or limiting allocation of medical resources to protected class or based on patient's race, color, national origin, sex, sexual orientation, gender identity, age or disability.] Declares emergency, effective on passage."}, "23": {"bill_id": 1371319, "number": "SB1607", "change_hash": "8e1f0ed86fd7a909ee1dc62045a544d2", "url": "https://legiscan.com/OR/bill/SB1607/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to State School Fund distributions; and declaring an emergency.", "description": "Extends for one year small school district grants and school district funding for foreign exchange students. Extends for one year small school district grants and school district funding for foreign exchange students. Declares emergency, effective on passage."}, "24": {"bill_id": 1371314, "number": "SB5711", "change_hash": "7f31cc3af87ce5ff28ae71ed0ee13584", "url": "https://legiscan.com/OR/bill/SB5711/2020/X1", "status_date": "2020-07-13", "status": 4, "last_action_date": "2020-07-13", "last_action": "Effective date, July 7, 2020.", "title": "Relating to state financial administration; and declaring an emergency.", "description": "Appropriates moneys from General Fund to specified state agencies for certain biennial expenses. Appropriates moneys from General Fund to _____ for biennial expenses.] Limits biennial expenditures from fees, moneys or other revenues, including Miscellaneous Receipts, but excluding lottery funds and federal funds, collected or received by _______.] Limits biennial expenditures of _____ from federal funds.] Appropriates moneys from General Fund to specified state agencies for certain biennial expenses. Modifies certain biennial appropriations made from General Fund to Emergency Board and specified state agencies. Establishes and modifies limitations on expenditures for certain biennial expenses for specified state agencies. Declares emergency, effective on passage."}}