{"session": {"session_id": 1968, "state_id": 37, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "2nd Special Session", "session_title": "2021 2nd Special Session", "session_name": "2021 2nd Special Session"}, "0": {"bill_id": 1538175, "number": "SB891", "change_hash": "505eb1a7df33127c795c068ac5071461", "url": "https://legiscan.com/OR/bill/SB891/2021/X2", "status_date": "2021-12-17", "status": 4, "last_action_date": "2021-12-17", "last_action": "Effective date, December 14, 2021.", "title": "Relating to residential tenancies; declaring an emergency.", "description": "Extends suspension of termination of residential tenancies for nonpayment of rent for tenants who have applied for emergency rental assistance and provided documentation of application to their landlord on or before June 30, 2022, throughout period that application is pending. Extends suspension of termination of residential tenancies for nonpayment of rent for tenants who have applied for emergency rental assistance and provided documentation of application to their landlord on or before June 30, 2022, throughout period that application is pending. Amends notice provided with eviction summons delivered by clerk. Adds additional requirements for certain rental assistance providers. Extends until October 1, 2022, sunset of safe harbor for tenants who have applied for emergency rental assistance and sunset of changes extending cure period in termination notices for nonpayment of residential rent. Extends eligibility for funding from Housing and Community Services Department for certain landlords experiencing delay in termination for nonpayment. Declares emergency, effective on passage."}, "1": {"bill_id": 1538176, "number": "SB892", "change_hash": "736de266c56df37f31beab37f24040d9", "url": "https://legiscan.com/OR/bill/SB892/2021/X2", "status_date": "2021-12-17", "status": 4, "last_action_date": "2021-12-17", "last_action": "Effective date, December 14, 2021.", "title": "Relating to financial assistance for agricultural producers; declaring an emergency.", "description": "Directs State Department of Agriculture to establish forgivable loan program to provide financial assistance to farming and ranching producers in Oregon with lost gross farm income in calendar year 2021 due to qualifying natural disaster. Directs State Department of Agriculture to establish forgivable loan program to provide financial assistance to farming and ranching producers in Oregon with lost gross farm income in calendar year 2021 due to qualifying natural disaster. Sunsets July 1, 2023. Declares emergency, effective on passage."}, "2": {"bill_id": 1538172, "number": "SB893", "change_hash": "28a0c8401d9028cfce0beebfd2c0e1f2", "url": "https://legiscan.com/OR/bill/SB893/2021/X2", "status_date": "2021-12-17", "status": 4, "last_action_date": "2021-12-17", "last_action": "Effective date, December 14, 2021.", "title": "Relating to illegal cannabis; declaring an emergency.", "description": "Requires prioritizing financial assistance to local law enforcement agencies to partner with community-based organizations in order to address humanitarian crisis associated with unlawful marijuana cultivation or distribution operations in awarding grants through Illegal Marijuana Market Enforcement Grant Program. Requires prioritizing financial assistance to local law enforcement agencies to partner with community-based organizations in order to address humanitarian crisis associated with unlawful marijuana cultivation or distribution operations in awarding grants through Illegal Marijuana Market Enforcement Grant Program. Declares emergency, effective on passage."}, "3": {"bill_id": 1538173, "number": "SB5561", "change_hash": "3553fccf54a1eef9837474a4af569ad0", "url": "https://legiscan.com/OR/bill/SB5561/2021/X2", "status_date": "2021-12-17", "status": 4, "last_action_date": "2021-12-17", "last_action": "Effective date, December 14, 2021.", "title": "Relating to state financial administration; declaring an emergency.", "description": "Appropriates moneys from General Fund to specified state agencies for specified expenses. Appropriates moneys from General Fund to specified state agencies for specified expenses. Modifies certain biennial appropriations made from General Fund to specified state agencies. Limits biennial expenditures from specified moneys collected or received by specified state agencies. Modifies limitations on expenditures for certain biennial expenses for specified state agencies. Declares emergency, effective on passage."}, "4": {"bill_id": 1538174, "number": "SCR41", "change_hash": "c3aa73d0512d13510abbd11a1dbd0506", "url": "https://legiscan.com/OR/bill/SCR41/2021/X2", "status_date": "2021-12-14", "status": 4, "last_action_date": "2021-12-14", "last_action": "Filed With Secretary of State.", "title": "Adjourning sine die 2021 second special session of Eighty-first Legislative Assembly.", "description": "Adjourns sine die 2021 second special session of Eighty-first Legislative Assembly. Adjourns sine die 2021 second special session of Eighty-first Legislative Assembly."}}