{"session": {"session_id": 1081, "state_id": 14, "year_start": 2014, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2014 Regular Session", "session_name": "2014 Regular Session"}, "413": {"bill_id": 590656, "number": "HB1418", "change_hash": "ba3ba8d7c208cf7c3c0cd46f70548bdc", "url": "https://legiscan.com/IN/bill/HB1418/2014", "status_date": "2014-01-16", "status": 1, "last_action_date": "2014-01-16", "last_action": "First Reading: Referred to Courts and Criminal Code", "title": "Bias motivated offenses.", "description": "Provides that a bias motivated crime is an offense in which the person who committed the offense intentionally: (1) selected the person who was injured; or (2) damaged or otherwise affected property; by the offense because of the actual or perceived color, creed, disability, national origin, race, religion, sexual orientation, gender, or gender identity of the injured person or of the owner or occupant of the affected property. Enhances the penalties for the following offenses one level if the offense is a bias motivated crime: (1) Battery. (2) Aggravated battery. (3) Strangulation. (4) Kidnapping. (5) Criminal confinement. (6) Robbery. (7) Arson. (8) Criminal mischief. (9) Burglary. (10) Residential entry. (11) Criminal trespass. (12) Theft. (13) Criminal conversion. (14) Intimidation. (15) Harassment. (16) Stalking. Requires law enforcement officers to receive training in identifying, responding to, and reporting bias motivated crimes. Amends the law that requires law enforcement agencies to collect and report information concerning bias motivated crimes. Allows an individual who suffers a personal injury or property damage to bring a civil action to recover damages, including punitive damages, if the person who committed the act that caused the injury or property damage selected the individual because of the individual's actual or perceived color, creed, disability, national origin, race, religion, sexual orientation, gender, or gender identity."}}