{"session": {"session_id": 1719, "state_id": 14, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2020 Regular Session", "session_name": "2020 Regular Session"}, "316": {"bill_id": 1304902, "number": "HB1320", "change_hash": "98f651abeec83828531179eb74db23ce", "url": "https://legiscan.com/IN/bill/HB1320/2020", "status_date": "2020-01-14", "status": 1, "last_action_date": "2020-01-14", "last_action": "First reading: referred to Committee on Courts and Criminal Code", "title": "Definition of \"bias crime\".", "description": "Definition of \"bias crime\". Provides that \"bias crime\" means an offense in which the person who commits the offense knowingly or intentionally: (1) selected the person who was injured by the offense; or (2) damaged or otherwise affected property; because of the age, ancestry, color, disability, familial status, gender identity, military service, national origin, race, religion, sex, or sexual orientation of the injured person or of the owner or occupant of the affected property or because the injured person or owner or occupant of the affected property was associated with any other recognizable group or affiliation."}, "711": {"bill_id": 1296844, "number": "SB0137", "change_hash": "d26b6a30ee991784d395df102ae30608", "url": "https://legiscan.com/IN/bill/SB0137/2020", "status_date": "2020-01-09", "status": 1, "last_action_date": "2020-01-16", "last_action": "Senator Stoops added as coauthor", "title": "Prohibited discrimination in civil rights statutes.", "description": "Prohibited discrimination in civil rights statutes. Extends certain antidiscrimination and civil rights statutes to prohibit discrimination based on sexual orientation, gender identity, national origin, disability, veteran status, and ancestry."}, "822": {"bill_id": 1310072, "number": "SB0250", "change_hash": "1246c008023a93c5c7f2749600fb9876", "url": "https://legiscan.com/IN/bill/SB0250/2020", "status_date": "2020-01-16", "status": 1, "last_action_date": "2020-01-16", "last_action": "First reading: referred to Committee on Education and Career Development", "title": "Prohibited discrimination.", "description": "Prohibited discrimination. Provides that a choice scholarship school (eligible school) may not discriminate against a staff member based on disability, race, color, gender, gender identity or expression, sexual orientation, marital status, national origin, religion, or ancestry. Provides that if the department of education (department) determines that the eligible school discriminates against a staff member of the school, the department shall send a notice to the eligible school indicating that the eligible school will not be considered an eligible school beginning in the school year immediately following the current school year. Provides that the eligible school has 30 days from the date of the notice to demonstrate to the department that the eligible school does not discriminate against staff members. Provides that an eligible school that does not comply within that time will not be considered an eligible school beginning in the school year immediately following the current school year. Provides that an eligible school may not discriminate against a student on the basis of sexual orientation, gender identity or expression, or marital status."}}