{"session": {"session_id": 1802, "state_id": 14, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "127": {"bill_id": 1394130, "number": "HB1131", "change_hash": "e2b03c207d345f9630f7626bf888e337", "url": "https://legiscan.com/IN/bill/HB1131/2021", "status_date": "2021-01-07", "status": 1, "last_action_date": "2021-01-07", "last_action": "First reading: referred to Committee on Courts and Criminal Code", "title": "Bias motivated crimes.", "description": "Bias motivated crimes. Establishes a sentencing procedure that requires a court, when sentencing an individual who has committed a crime that is motivated by a bias against another individual's actual or perceived age, ancestry, color, creed, disability, ethnicity, familial status, gender, gender identity, military service, national origin, race, religion, sex, or sexual orientation to impose an additional fixed term of imprisonment not to exceed five years, if the offense is a felony, or three years, if the offense is a misdemeanor. Requires law enforcement agencies to report bias motivated crimes to the Federal Bureau of Investigation."}, "834": {"bill_id": 1395154, "number": "SB0119", "change_hash": "b1022f74a0f9d28e9269bc6cb29ad47a", "url": "https://legiscan.com/IN/bill/SB0119/2021", "status_date": "2021-01-07", "status": 1, "last_action_date": "2021-01-07", "last_action": "First reading: referred to Committee on Judiciary", "title": "Prohibited discrimination in civil rights statutes.", "description": "Prohibited discrimination in civil rights statutes. Extends certain antidiscrimination and civil rights statutes to prohibit discrimination based on sexual orientation, gender identity, and veteran status. Provides that every discriminatory practice relating to the acquisition or sale of real estate, education, public accommodations, employment, or the extending of credit is considered unlawful unless it is specifically exempted."}, "905": {"bill_id": 1394931, "number": "SB0192", "change_hash": "133808064c223ffddd6e777b525afcea", "url": "https://legiscan.com/IN/bill/SB0192/2021", "status_date": "2021-01-07", "status": 1, "last_action_date": "2021-01-07", "last_action": "First reading: referred to Committee on Corrections and Criminal Law", "title": "Law enforcement training.", "description": "Law enforcement training. Requires law enforcement officers to receive training in identifying, responding to, and reporting bias motivated crimes in which the person who committed a criminal offense selected the victim who was injured or whose property was damaged because of the victim's actual or perceived race, color, creed, disability, national origin, religion, sexual orientation, gender, or gender identity."}, "925": {"bill_id": 1395011, "number": "SB0212", "change_hash": "0d35cb9774a40e5d381eae22f2e8f25b", "url": "https://legiscan.com/IN/bill/SB0212/2021", "status_date": "2021-01-07", "status": 1, "last_action_date": "2021-01-25", "last_action": "Senator Ford J.D. added as coauthor", "title": "Charter schools and prohibited discrimination.", "description": "Charter schools and prohibited discrimination. Provides that it is the public policy of the state to provide equal, nonsegregated, and nondiscriminatory education opportunities and facilities for all, regardless of sexual orientation, gender identity or expression, or marital status (in addition to race, creed, national origin, color, or sex under current law). Makes a similar change to a charter school provision concerning the suspension, expulsion, or requested transfer of a student and to an Indiana academy for science, mathematics, and humanities provision. Provides that a charter school may not discriminate against staff on the basis of disability, race, color, gender, gender identity or expression, sexual orientation, marital status, national origin, religion, or ancestry. Requires the department of education to provide staff to carry out the duties of the Indiana charter school board (charter board). Makes various changes to the charter school law, including the following: (1) Prohibiting an authorizer from: (A) authorizing a charter to an organizer if a charter school of the organizer has been closed within the past five years; or (B) accepting a proposal from an organizer that operates a charter school that does not meet certain school accountability grade thresholds. (2) Requiring certain authorizers that are not currently required to be approved for chartering authority to be approved for chartering authority before granting a new charter or renewing a charter. (3) Providing that an administrative fee for certain authorizers is dependent upon the category or designation that the charter school receives regarding its school accountability grade. (4) Prohibiting, under certain circumstances, a charter school from enrolling new students who are not currently enrolled in the charter school. (5) Requiring authorizers to be responsible for certain amounts owed by a charter school and to cosign for a loan from the common school fund before an organizer may obtain the loan. (6) Requiring each organizer and authorizer of a charter school to submit to the state board of education a surety bond or other form of financial guarantee and establishes consequences for an organizer or authorizer that fails to submit the bond or guarantee. Requires: (1) an authorizer to submit to the department of education a notice of a public hearing regarding the establishment of a proposed charter school; and (2) the department to post the notice on the department's Internet web site. Repeals a provision that provides that funding for the charter board consists of administrative fees."}, "937": {"bill_id": 1394850, "number": "SB0224", "change_hash": "eebf5fe7c851594b5a15899d14f6e26f", "url": "https://legiscan.com/IN/bill/SB0224/2021", "status_date": "2021-01-07", "status": 1, "last_action_date": "2021-01-25", "last_action": "Senator Raatz removed as second author", "title": "Prohibited services relating to care of minors.", "description": "Prohibited services relating to care of minors. Prohibits specified health care professionals from: (1) performing certain medical procedures on a minor; or (2) subjecting a minor to certain activities; that purposely attempt to change, reinforce, or affirm a minor's perception of the minor's own sexual attraction or sexual behavior, or attempt to change, reinforce, or affirm a minor's gender identity when the identity is inconsistent with the minor's biological sex."}}