{"session": {"session_id": 1990, "state_id": 14, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2022 1st Special Session", "session_name": "2022 Special Session"}, "0": {"bill_id": 1627103, "number": "HB1001", "change_hash": "d1e1234b35697bc97d8773c5bc5c8520", "url": "https://legiscan.com/IN/bill/HB1001/2022/X1", "status_date": "2022-07-29", "status": 2, "last_action_date": "2022-08-03", "last_action": "Committee report: amend do pass, adopted", "title": "Tax and fiscal matters.", "description": "Tax and fiscal matters. Establishes the Hoosier Families First Fund (fund) to be administered by the budget agency and specifies the purposes for which money in the fund may be used. Appropriates $45,000,000 from the state general fund to the fund for state fiscal year 2023. Provides that the gasoline use tax rate during the period beginning on the first day following the enactment into law of the bill and continuing through June 30, 2023, is capped at $0.295 per gallon. Provides, however, that if the gasoline use tax rate as determined under current law for a month is less than $0.295 per gallon, the lesser tax rate shall apply. Provides a temporary sales tax exemption for six monthly billing cycles during which the sale of utilities (including liquefied petroleum gas and heating oil) to residential customers and the sale of intrastate telecommunication services to residential customers are exempt from the state sales tax. Increases the amount of the adjusted gross income tax credit to which an individual who is eligible to claim the federal adoption tax credit is entitled. Freezes the gasoline excise tax and the special fuel tax rates beginning on September 1, 2022, and continuing through June 30, 2023, at the rates that were in effect on June 30, 2022. Requires the office of Medicaid policy and planning (office) to research and compile, Medicaid reimbursement rates, by Medicaid provider type, in states bordering Indiana for certain prenatal, pregnancy, postnatal, and pediatric wellness services. Requires the office to prepare a report of the office's findings and submit the report to the general assembly before December 31, 2022. Appropriates $17,700,000 from the state general fund to the auditor of state to make transfers to counties, cities, and towns equal to the amount of gasoline excise tax and special fuel tax that each county, city, and town would have otherwise received if the rates had not been frozen during the 2023 state fiscal year. Requires the revenue transferred to the counties, cities, and towns to be used for the purposes for which revenue from those tax rates may be used under applicable law. Appropriates an amount for transfer to the capital reserve account after June 30, 2023, based on a determination by the budget agency of the difference between: (1) $1,000,000,000; and (2) the actual fiscal impact to the state of Indiana in state fiscal year 2023 as a result of the enactment of certain provisions included in HB 1001(ss). Appropriates $400,000,000 from the state general fund to the budget agency for transfer to the pension stabilization fund for the purposes of the pension stabilization fund."}, "1": {"bill_id": 1627420, "number": "HB1011", "change_hash": "2c7b2f32424618df0e5c2fe5a9f9aa1a", "url": "https://legiscan.com/IN/bill/HB1011/2022/X1", "status_date": "2022-07-28", "status": 1, "last_action_date": "2022-07-28", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "Infant formula price gouging.", "description": "Infant formula price gouging. Defines \"price gouging\" to include charging a consumer an unconscionable amount for the sale of infant formula. Provides that price gouging occurs in the sale of infant formula if the price at which the infant formula is sold grossly exceeds the average price charged for infant formula of the same brand and type in retail establishments in Indiana on or about the date on which the infant formula is sold. Authorizes the attorney general to investigate complaints, seek injunctive relief, seek restitution for victims, and institute actions to collect civil penalties in cases of price gouging in the sale of infant formula. Provides that a court may assess a civil penalty of up to $1,000 for each transaction against a retailer found to have committed price gouging in the sale of infant formula."}, "2": {"bill_id": 1627415, "number": "HB1012", "change_hash": "02951a41bd4cc1c7b48a2650f53bbfdf", "url": "https://legiscan.com/IN/bill/HB1012/2022/X1", "status_date": "2022-07-28", "status": 1, "last_action_date": "2022-07-28", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "Firearm storage.", "description": "Firearm storage. Prohibits a person from keeping or storing a loaded firearm on any premises controlled by the person if the person knows, or reasonably should know, that a child is likely to gain access to the firearm. Provides that a child's possession of a firearm resulting from a person's knowing or intentional failure to secure a firearm is a Class C misdemeanor for the person responsible for control of the premises. Provides that the offense is a Class B misdemeanor if the person has a prior unrelated conviction for the offense. Provides that a child's use of an unsecured firearm resulting in injury or death to any other person due to a person's knowing or intentional failure to secure a firearm is a Class A misdemeanor for the person responsible for control of the premises. Provides that the offense is a Level 6 felony if the person has a prior unrelated conviction for the offense. Specifies certain defenses. Specifies particular sign requirements for retail dealers. Defines terms. Makes conforming amendments."}, "3": {"bill_id": 1627429, "number": "HB1013", "change_hash": "f3ca5c445d3ef661449a240579f7a9c8", "url": "https://legiscan.com/IN/bill/HB1013/2022/X1", "status_date": "2022-07-28", "status": 1, "last_action_date": "2022-07-28", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "Vehicle Bill.", "description": "Vehicle Bill. None"}, "4": {"bill_id": 1627575, "number": "HB1014", "change_hash": "ad8e848c8d3613c05e511dc706ee50e1", "url": "https://legiscan.com/IN/bill/HB1014/2022/X1", "status_date": "2022-07-29", "status": 1, "last_action_date": "2022-07-29", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "Gary Community School Corporation.", "description": "Gary Community School Corporation. Establishes procedures to appoint members to the governing body of the Gary Community School Corporation. Establishes procedures for transferring responsibility of financial and academic matters from the emergency manager to the governing body. Removes obsolete provisions and makes conforming amendments. Repeals provisions relating to the election of advisory board members for the Gary Community School Corporation."}, "5": {"bill_id": 1627663, "number": "HB1015", "change_hash": "45608950b1f5a492bdeae4ac17a77886", "url": "https://legiscan.com/IN/bill/HB1015/2022/X1", "status_date": "2022-08-01", "status": 1, "last_action_date": "2022-08-01", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "General assembly sessions.", "description": "General assembly sessions. Provides that during an odd-numbered year, the general assembly shall adjourn sine die not later than the third Monday in November of that year. Provides that in an even-numbered year, the general assembly shall adjourn sine die not later than the first Monday in November of that year. Provides that the sessions of the general assembly are considered to adjourn sine die, by operation of law, not later than the required sine die adjournment days, if the general assembly has not previously adjourned sine die. Codifies provisions relating to the \"legislative business per diem allowance\", the legislative \"subsistence allowance\", and the legislative \"mileage allowance\". Provides that legislators are paid the subsistence allowance for each day: (1) when the general assembly is in session, but in recess for six or more calendar days; and (2) each day after the general assembly adjourns sine die unless the general assembly is in special session, when a legislator is paid the legislative business per diem allowance. Provides that the \"prohibited period\" during which campaign fundraising may not occur by candidates for election to the general assembly and for state offices ends on the date the budget bill for the following budget period is approved by the governor. (Under current law, the prohibited period ends the day the general assembly adjourns sine die in an odd-numbered year.) Repeals the statutes providing for technical sessions. Repeals the emergency sessions statute. Makes technical changes in statutes to reflect these substantive changes."}, "6": {"bill_id": 1627701, "number": "HR0001", "change_hash": "b1aff4feab28bfa5a367e727af7f045f", "url": "https://legiscan.com/IN/bill/HR0001/2022/X1", "status_date": "2022-08-02", "status": 4, "last_action_date": "2022-08-02", "last_action": "First reading: adopted voice vote", "title": "Recognizing the Madison Police Department and Jefferson County Sheriff's Department.", "description": "Recognizing the Madison Police Department and Jefferson County Sheriff's Department."}, "7": {"bill_id": 1627134, "number": "HCR0001", "change_hash": "f868ba68cbb96b3f95f7232786058726", "url": "https://legiscan.com/IN/bill/HCR0001/2022/X1", "status_date": "2022-07-25", "status": 4, "last_action_date": "2022-07-25", "last_action": "Returned to the House", "title": "A CONCURRENT RESOLUTION to allow the House of Representatives and the Senate of the 122nd General Assembly to adjourn and recess separately throughout the First Special Session for periods in excess of three (3) consecutive days as the need, in the judgment of the Speaker of the House of Representatives and the President Pro Tempore of the Senate, respectively, may arise.", "description": "A CONCURRENT RESOLUTION to allow the House of Representatives and the Senate of the 122nd General Assembly to adjourn and recess separately throughout the First Special Session for periods in excess of three (3) consecutive days as the need, in the judgment of the Speaker of the House of Representatives and the President Pro Tempore of the Senate, respectively, may arise."}, "8": {"bill_id": 1627424, "number": "HJR0001", "change_hash": "6113417f779fa34af1b8cb93e93e1688", "url": "https://legiscan.com/IN/bill/HJR0001/2022/X1", "status_date": "2022-07-28", "status": 1, "last_action_date": "2022-07-28", "last_action": "First reading: referred to Committee on Rules and Legislative Procedures", "title": "Provides that the rights set forth in the Constitution of the State of Indiana, the laws prescribed by the general assembly, and the rules prescribed by virtue of the authority of the general assembly apply to a preborn child as soon as the preborn child's mother is aware she is pregnant.", "description": "Provides that the rights set forth in the Constitution of the State of Indiana, the laws prescribed by the general assembly, and the rules prescribed by virtue of the authority of the general assembly apply to a preborn child as soon as the preborn child's mother is aware she is pregnant."}, "9": {"bill_id": 1627130, "number": "SB0001", "change_hash": "ef5329743024da20a8f9de2c2dda0015", "url": "https://legiscan.com/IN/bill/SB0001/2022/X1", "status_date": "2022-08-05", "status": 4, "last_action_date": "2022-08-05", "last_action": "Public Law 179(ss)", "title": "Abortion.", "description": "Abortion. Terminates the licensure of abortion clinics. Specifies that the abortion statutes do not apply to in vitro fertilization. Makes changes to when an abortion may be performed, including when: (1) the abortion is necessary to prevent any serious health risk of the pregnant woman or to save the pregnant woman's life; (2) the fetus is diagnosed with a lethal fetal anomaly; or (3) the pregnancy is a result of rape or incest. Specifies time frames and conditions that must be met in order for the abortion to be performed. Provides that the statute requiring consent of a parent or legal guardian for a minor's abortion does not apply to a minor who is pregnant as a result of rape or incest by a parent, legal guardian, or custodian of the unemancipated minor. Requires the revocation of a physician's license for specified violations. Provides a defense for a pregnant mother charged with a criminal offense for terminating or seeking the termination of her pregnancy. Specifies that a person who terminates the pregnancy of a pregnant woman upon her request may only be charged with certain crimes. Exempts from the crime of feticide: (1) the pregnant mother; (2) a person who provides medical treatment in good faith to a pregnant woman that results in the accidental or unintentional termination of the pregnancy; and (3) a physician who performs a medical procedure to terminate the pregnancy upon request of the pregnant woman. Requires the maternal mortality review committee to study how changes in the state's abortion laws affect maternal mortality in Indiana and extends the committee until June 30, 2027. Voids certain administrative rules concerning abortion clinics. Establishes the prosecutorial oversight task force and specifies duties of the task force. Makes conforming amendments."}, "10": {"bill_id": 1627116, "number": "SB0002", "change_hash": "09b50ea599ce985222d1142c8104d8ca", "url": "https://legiscan.com/IN/bill/SB0002/2022/X1", "status_date": "2022-08-05", "status": 4, "last_action_date": "2022-08-05", "last_action": "Public Law 180(ss)", "title": "Fiscal matters.", "description": "Fiscal matters. Specifies that in calendar year 2023, if the amount of excess reserves meets a certain threshold, the governor shall transfer the first $1,000,000,000 of excess reserves to the pension stabilization fund. Provides for an additional automatic taxpayer refund for the 2021 taxable year in the amount of $200 to taxpayers who are eligible for an automatic taxpayer refund under current law. Provides that a taxpayer who: (1) is not eligible for the additional automatic taxpayer refund; (2) was not claimed as a dependent of another taxpayer for taxable year 2022; (3) received Social Security benefits in calendar year 2022; and (4) files a tax return for the 2022 taxable year; is eligible for a refundable tax credit in the same amount of $200. Establishes the Hoosier Families First Fund (fund) to be administered by the budget agency and specifies the purposes for which money in the fund may be used. Appropriates $45,000,000 from the state general fund to the fund for state fiscal year 2023. Provides a sales tax exemption for children's diapers. Provides that the gasoline use tax rate during the period beginning on the first day following the enactment into law of the bill and continuing through June 30, 2023, is capped at $0.295 per gallon. Provides, however, that if the gasoline use tax rate as determined under current law for a month is less than $0.295 per gallon, the lesser tax rate shall apply. Adds an additional exemption for an adopted child. Increases the amount of the adjusted gross income tax credit to which an individual who is eligible to claim the federal adoption tax credit is entitled. Provides that the postpartum period determined by the office of the secretary of family and social services during which Medicaid coverage is available to a woman must not be less than 12 months beginning on the last day of the pregnancy. Before November 1, 2022, requires the office of Medicaid policy and planning (office) to research and compile total Medicaid reimbursement for inpatient hospital services and outpatient hospital and clinical services for Indiana and in states bordering Indiana for certain prenatal, pregnancy, postnatal, and pediatric wellness services. Requires the office to prepare a report of the office's findings and submit the report to the general assembly not later than December 1, 2022. Adds donated breast milk to the list of supplies and services provided by Medicaid and the healthy Indiana plan. Establishes the doula reimbursement advisory board. Requires the office of the secretary of the family and social services administration to: (1) seek any necessary approval from the United States Department of Health and Human Services; and (2) adopt any written policies, procedures, or regulations determined necessary; to provide reimbursement for long-acting reversible contraception. Authorizes a local health department, health care provider, or other human services provider to request a grant from the safety PIN (protecting Indiana's newborns) grant fund to be used to assist individuals seeking contraceptives. Authorizes a local health department, a health care provider, or a human services provider to seek grants to provide instruction on the use of fertility awareness-based family planning methods. Prohibits the state department of health from awarding grants for the distribution of contraceptives through school run programs or to a minor without the consent of the minor's parent or guardian. Requires the state department of health to contract with a third party vendor to conduct an evaluation concerning access to low cost birth control and access to education and services concerning unwanted pregnancy. Appropriates money for various purposes related to children and families."}, "13": {"bill_id": 1627123, "number": "SR0001", "change_hash": "b24d3847de7532adfb0698ffa79a16ec", "url": "https://legiscan.com/IN/bill/SR0001/2022/X1", "status_date": "2022-07-25", "status": 4, "last_action_date": "2022-07-25", "last_action": "First reading: adopted voice vote", "title": "A SENATE RESOLUTION authorizing the Postmaster of the Indiana Senate to receive from the Postmaster of the City of Indianapolis all mail belonging to the Senate.", "description": "A SENATE RESOLUTION authorizing the Postmaster of the Indiana Senate to receive from the Postmaster of the City of Indianapolis all mail belonging to the Senate."}}