{"session": {"session_id": 1955, "state_id": 14, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "558": {"bill_id": 1541628, "number": "SB0034", "change_hash": "1eb6a1d68915593c67e371d9e0f0ce75", "url": "https://legiscan.com/IN/bill/SB0034/2022", "status_date": "2022-01-04", "status": 1, "last_action_date": "2022-01-13", "last_action": "Senator Tomes added as coauthor", "title": "Prohibited services relating to care of minors.", "description": "Prohibited services relating to care of minors. Prohibits specified health care professionals from: (1) performing certain medical procedures on a minor; or (2) subjecting a minor to certain activities; that purposely attempt to change, reinforce, or affirm a minor's perception of the minor's own sexual attraction or sexual behavior, or attempt to change, reinforce, or affirm a minor's gender identity when the identity is inconsistent with the minor's biological sex."}, "587": {"bill_id": 1541644, "number": "SB0063", "change_hash": "9b88ef8cb3f0d6c44400e0ca67cad058", "url": "https://legiscan.com/IN/bill/SB0063/2022", "status_date": "2022-01-04", "status": 1, "last_action_date": "2022-01-04", "last_action": "First reading: referred to Committee on Education and Career Development", "title": "Equal educational opportunity.", "description": "Equal educational opportunity. Extends certain antidiscrimination educational rights statutes to prohibit discrimination based on sexual orientation and gender identity."}, "652": {"bill_id": 1544004, "number": "SB0128", "change_hash": "61b611549f53467ac182b456c386bbda", "url": "https://legiscan.com/IN/bill/SB0128/2022", "status_date": "2022-01-04", "status": 1, "last_action_date": "2022-01-04", "last_action": "First reading: referred to Committee on Judiciary", "title": "Prohibited discrimination in civil rights statutes.", "description": "Prohibited discrimination in civil rights statutes. Extends certain antidiscrimination and civil rights statutes to prohibit discrimination based on sexual orientation, gender identity, and veteran status. Provides that every discriminatory practice relating to the acquisition or sale of real estate, education, public accommodations, employment, or the extending of credit is considered unlawful unless it is specifically exempted."}}