{"session": {"session_id": 2021, "state_id": 14, "year_start": 2023, "year_end": 2023, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023 Regular Session", "session_name": "2023 Regular Session"}, "116": {"bill_id": 1649543, "number": "HB1118", "change_hash": "eb43cf47210bae0dda188368ab79b7ed", "url": "https://legiscan.com/IN/bill/HB1118/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-12", "last_action": "Representative Payne Z added as coauthor", "title": "Prohibited services relating to care of minors.", "description": "Prohibited services relating to care of minors. Prohibits specified health care professionals from: (1) performing, or causing to be performed, certain medical procedures on a minor; or (2) subjecting a minor to certain activities that purposely attempt to change, reinforce, or affirm a minor's perception of the minor's own sexual attraction or sexual behavior, or attempt to change, reinforce, or affirm a minor's gender identity when the identity is inconsistent with the minor's biological sex."}, "178": {"bill_id": 1650021, "number": "HB1180", "change_hash": "c3b62dd921ab6ba51864c7200984d86b", "url": "https://legiscan.com/IN/bill/HB1180/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-10", "last_action": "First reading: referred to Committee on Education", "title": "Education matters.", "description": "Education matters. Requires reporting concerning students injuring teachers and training for teachers in de-escalation, prevention, and intervention strategies. Requires information concerning the following to be presented to a school corporation's governing body: (1) Responsibilities and nature of employment of the superintendent. (2) Commencement of an internal investigation. (3) Legal expenditure of more than $1,000 in an adjudicative action. Provides that the superintendent must certify under penalties of perjury that the legal expenditure information has been given. Increases from seven to 14 days the time that must elapse after a public hearing before a school corporation may enter into a contract with the superintendent, specifies additional information that must be disclosed concerning the contract, and limits allowable compensation increases. Requires special education grade 8 through 12 case conference committees to discuss decision making skills and alternatives to appointing a guardian."}, "230": {"bill_id": 1650067, "number": "HB1232", "change_hash": "f11f848fa36d52e1e2a5718df7d0360b", "url": "https://legiscan.com/IN/bill/HB1232/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-12", "last_action": "Representative Davis M added as coauthor", "title": "Child removal and gender identity.", "description": "Child removal and gender identity. Provides that the department of child services may not classify a report of child abuse or neglect as substantiated, and a child may not be removed from the child's parent, guardian, or custodian, solely on the basis of the parent, guardian, or custodian: (1) referring to and raising the child consistent with the child's biological sex; or (2) declining to consent to the child receiving: (A) specified medication; (B) a medical procedure the purpose of which is to alter the apparent gender or sex of the child or affirm the child's perception of the child's gender or sex in a manner inconsistent with the child's biological sex; or (C) counseling or other mental health services the purpose of which is to affirm the child's perception of the child's gender or sex if the child's perception is inconsistent with the child's biological sex."}, "272": {"bill_id": 1654530, "number": "HB1274", "change_hash": "d81bb301d55528571cdcfa09539a17eb", "url": "https://legiscan.com/IN/bill/HB1274/2023", "status_date": "2023-01-11", "status": 1, "last_action_date": "2023-01-11", "last_action": "First reading: referred to Committee on Courts and Criminal Code", "title": "Bias crimes.", "description": "Bias crimes. Adds gender identity to the definition of \"bias crime\"."}, "520": {"bill_id": 1671419, "number": "HB1523", "change_hash": "9a16fe43e139027b4812ba4a30471980", "url": "https://legiscan.com/IN/bill/HB1523/2023", "status_date": "2023-01-19", "status": 1, "last_action_date": "2023-01-19", "last_action": "First reading: referred to Committee on Education", "title": "Dignity and nondiscrimination in education.", "description": "Dignity and nondiscrimination in education. Provides that a school corporation or qualified school shall not promote certain concepts as part of a course of instruction or in a curriculum or instructional program, or allow teachers or other employees to use supplemental learning materials to promote certain concepts regarding sex, race, ethnicity, religion, color, or national origin. Requires requesting to meet with a teacher for certain complaints. Requires each school corporation or qualified school to establish grievance procedures for certain complaints. Provides that, if a parent of a student or a student, if the student is an adult or emancipated minor, is not satisfied with a final decision, the parent or student may submit a request to the department of education to review the complaint and decision."}, "522": {"bill_id": 1671371, "number": "HB1525", "change_hash": "32d07252f54db212edfb9982fec2e4a4", "url": "https://legiscan.com/IN/bill/HB1525/2023", "status_date": "2023-01-19", "status": 1, "last_action_date": "2023-01-19", "last_action": "First reading: referred to Committee on Public Health", "title": "Prohibited health care for minors.", "description": "Prohibited health care for minors. Prohibits specified health care professionals from: (1) performing certain medical procedures on a minor; or (2) prescribing, administering, or furnishing certain drugs to a minor; that purposely attempt to change, reinforce, or affirm a minor's perception of the minor's own sexual attraction or sexual behavior, or attempt to change, reinforce, or affirm a minor's gender identity when the identity is inconsistent with the minor's biological sex."}, "770": {"bill_id": 1645844, "number": "SB0039", "change_hash": "cd6689a63a54f05a6cba78a27ee78b9d", "url": "https://legiscan.com/IN/bill/SB0039/2023", "status_date": "2023-01-09", "status": 1, "last_action_date": "2023-01-09", "last_action": "First reading: referred to Committee on Education and Career Development", "title": "Equal educational opportunity.", "description": "Equal educational opportunity. Extends certain antidiscrimination educational rights statutes to prohibit discrimination based on sexual orientation and gender identity."}, "1141": {"bill_id": 1665406, "number": "SB0413", "change_hash": "24fc452288e971f93b52c4e68a5f295d", "url": "https://legiscan.com/IN/bill/SB0413/2023", "status_date": "2023-01-19", "status": 1, "last_action_date": "2023-01-19", "last_action": "Senator Doriot added as second author", "title": "Parental rights in education.", "description": "Parental rights in education. Requires a governing body of a school corporation to adopt procedures to require schools to notify a parent of an unemancipated minor student regarding the: (1) student's services, support, or monitoring related to the student's social emotional, behavioral, mental, or physical health; or (2) school's ability to provide a safe and supportive learning environment for the student. Establishes requirements and restrictions regarding the procedures. Prohibits school corporation personnel or a third party vendor that contracts with a school corporation from providing instruction on sexual orientation or gender identity: (1) to any students of the school corporation enrolled in kindergarten through grade 12; or (2) in a manner that is not age appropriate or developmentally appropriate for students in accordance with state law. Establishes requirements regarding: (1) student support services training; (2) notifying parents of social emotional, behavioral, mental, and physical health services or support offered by a school corporation and the parent's option to withhold consent or decline any of those health services or support; and (3) administering a social emotional, behavioral, mental, or physical health personal analysis or evaluation, questionnaire, screening, survey, or assessment to an unemancipated minor student enrolled in kindergarten through grade 12. Requires a school corporation to notify the parent of each student enrolled in a school maintained by the school corporation if the school corporation permits a student of that school to use a multiple occupancy restroom or locker room that is designated for a sex that is not the student's biological sex. Requires a school corporation to: (1) establish a grievance procedure for a violation of the provisions; and (2) post the grievance procedure on the school corporation's website. Provides that a parent who is not satisfied with a decision by a school principal or principal's designee regarding a complaint by the parent may request the department of education (department) to review the complaint and decision. Provides that a parent of a student may bring a civil action against the school corporation for a violation of the provisions. Requires, not later than May 30, 2024, the department to adopt or update, as necessary and as approved by the state board of education, certain student services, personnel guidelines, standards, frameworks, practices, and principles."}}