{"session": {"session_id": 115, "state_id": 46, "year_start": 2011, "year_end": 2011, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2011 Regular Session", "session_name": "2011 Regular Session"}, "523": {"bill_id": 227247, "number": "HB1755", "change_hash": "813052fc610ffe3641d6b08f3be3b5d7", "url": "https://legiscan.com/VA/bill/HB1755/2011", "status_date": "2011-01-11", "status": 1, "last_action_date": "2011-02-08", "last_action": "House: Left in General Laws", "title": "Human Rights Act; adds sexual orientation, etc., to safeguards for all individuals in State.", "description": "Virginia Human Rights Act; policy of the Commonwealth. Adds sexual orientation and gender identity to the safeguards for all individuals in the Commonwealth from unlawful discrimination. The bill defines sexual orientation and gender identity."}, "814": {"bill_id": 235885, "number": "HB2046", "change_hash": "417b5df28ba8d3f9c935861ed2978294", "url": "https://legiscan.com/VA/bill/HB2046/2011", "status_date": "2011-01-11", "status": 1, "last_action_date": "2011-02-08", "last_action": "House: Left in General Laws", "title": "Public employment; nondiscrimination.", "description": "Public employment; nondiscrimination. Prohibits discrimination in public employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, sexual orientation, or status as a veteran. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" shall not include any person's attraction towards persons with whom sexual conduct would be illegal due to the age of the parties. The bill contains technical amendments."}, "1945": {"bill_id": 220403, "number": "SB747", "change_hash": "56ae2337f094915cd821aeca7c4d9774", "url": "https://legiscan.com/VA/bill/SB747/2011", "status_date": "2010-10-29", "status": 1, "last_action_date": "2011-02-22", "last_action": "House: Left in General Laws", "title": "Nondiscrimination in state employment; prohibited based on race, color, religion, etc.", "description": "Nondiscrimination in state employment. Prohibits discrimination in state employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, sexual orientation, or status as a special disabled veteran or other veteran covered by the Vietnam Era Veterans Readjustment Assistance Act of 1974, as amended. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" shall not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill contains technical amendments."}}