{"session": {"session_id": 817, "state_id": 46, "year_start": 2012, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2012 Regular Session", "session_name": "2012 Regular Session"}, "691": {"bill_id": 360890, "number": "HB692", "change_hash": "614da5819293495e6027948ebf312f2e", "url": "https://legiscan.com/VA/bill/HB692/2012", "status_date": "2012-01-11", "status": 1, "last_action_date": "2012-02-14", "last_action": "House: Left in General Laws", "title": "Public employment; prohibits discrimination based on sexual orientation, race, etc.", "description": "Public employment; nondiscrimination. Prohibits discrimination in public employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, political affiliation, age, marital status, disability, sexual orientation, or status as a veteran. The bill contains technical amendments."}, "693": {"bill_id": 360889, "number": "HB694", "change_hash": "a2ac8f1c12d4e6937d70ddb85d505b79", "url": "https://legiscan.com/VA/bill/HB694/2012", "status_date": "2012-01-11", "status": 1, "last_action_date": "2012-02-14", "last_action": "House: Left in General Laws", "title": "Virginia Human Rights Act; policy of State.", "description": "Virginia Human Rights Act; policy of the Commonwealth. Adds sexual orientation and gender identity to the safeguards for all individuals in the Commonwealth from unlawful discrimination. The bill defines sexual orientation and gender identity."}, "976": {"bill_id": 359797, "number": "HB977", "change_hash": "4aa27a423ac9892c1c15cf6f5050dd3f", "url": "https://legiscan.com/VA/bill/HB977/2012", "status_date": "2012-01-11", "status": 1, "last_action_date": "2012-02-14", "last_action": "House: Left in General Laws", "title": "Virginia Human Rights Act; prohibits discrimination employment based on sexual orientation.", "description": "Virginia Human Rights Act; prohibited discrimination; sexual orientation. Prohibits discrimination in employment based on sexual orientation. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" shall not include any person's attraction towards persons with whom sexual conduct would be illegal due to the age of the parties. The bill also codifies existing prohibited discrimination in employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran. The bill contains technical amendments."}}