{"session": {"session_id": 1068, "state_id": 46, "year_start": 2014, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2014 Regular Session", "session_name": "2014 Regular Session"}, "416": {"bill_id": 577108, "number": "HB417", "change_hash": "9b18776ab04aa643b113063af83b4702", "url": "https://legiscan.com/VA/bill/HB417/2014", "status_date": "2014-01-04", "status": 1, "last_action_date": "2014-02-12", "last_action": "Left in General Laws", "title": "Virginia Human Rights Act; public employment, prohibited discrimination, sexual orientation.", "description": "Virginia Human Rights Act; public employment; prohibited discrimination; sexual orientation. Prohibits discrimination in employment based on sexual orientation. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction towards persons with whom sexual conduct would be illegal due to the age of the parties. The bill also codifies existing prohibited discrimination in public employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran. The bill contains technical amendments."}, "417": {"bill_id": 577190, "number": "HB418", "change_hash": "0b2918cdd5ae069aac2ba767ff4990b5", "url": "https://legiscan.com/VA/bill/HB418/2014", "status_date": "2014-01-04", "status": 1, "last_action_date": "2014-02-12", "last_action": "Left in General Laws", "title": "Fair Housing Law; unlawful discrimination based on sexual orientation.", "description": "Fair Housing Law; unlawful discrimination; sexual orientation. Adds discrimination based on sexual orientation as an unlawful discriminatory housing practice. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. \"Sexual orientation\" does not include sexually deviant disorders (paraphilias) as defined in the Diagnostic and Statistic Manual of Mental Disorders (DSM-IV)."}, "2197": {"bill_id": 577131, "number": "SB248", "change_hash": "420fbcf79e966d4ba26116c78d30a538", "url": "https://legiscan.com/VA/bill/SB248/2014", "status_date": "2014-01-03", "status": 1, "last_action_date": "2014-01-20", "last_action": "Failed to report (defeated) in General Laws and Technology (7-Y 7-N)", "title": "Discrimination; prohibited in state employment.", "description": "Nondiscrimination in state employment. Prohibits discrimination in state employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, sexual orientation, gender identity, or status as a special disabled veteran or other veteran covered by the Veterans Readjustment Assistance Act of 1974, as amended. The bill also defines \"sexual orientation\" and \"gender identity.\""}}