{"session": {"session_id": 1187, "state_id": 46, "year_start": 2016, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2016 Regular Session", "session_name": "2016 Regular Session"}, "178": {"bill_id": 801958, "number": "HB179", "change_hash": "a4b51cb93e510ba4d3deff51de99f761", "url": "https://legiscan.com/VA/bill/HB179/2016", "status_date": "2015-12-23", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "Virginia Human Rights Act; prohibits discrimination in employment.", "description": "Virginia Human Rights Act; prohibited discrimination in employment. Prohibits discrimination in private or public employment based on sexual orientation or status as a veteran. Under the Virginia Human Rights Act, such discrimination is actionable if the violating employer has between five and 15 employees. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill also conforms various provisions prohibiting discrimination in public employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or veteran status. The bill contains technical amendments."}, "299": {"bill_id": 802738, "number": "HB300", "change_hash": "35176e239b88d9c7c09f1e193260f048", "url": "https://legiscan.com/VA/bill/HB300/2016", "status_date": "2016-01-04", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "Virginia Fair Housing Law; unlawful discrimination, definition of sexual orientation, etc.", "description": "Fair Housing Law; unlawful discrimination; sexual orientation; gender identity. Adds discrimination based on sexual orientation or gender identity as an unlawful discriminatory housing practice. The bill defines \"sexual orientation\" and \"gender identity.\""}, "426": {"bill_id": 809544, "number": "HB427", "change_hash": "420b7af3e75d6f76bfb1a261bf7f2dcf", "url": "https://legiscan.com/VA/bill/HB427/2016", "status_date": "2016-01-07", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "Conversion therapy; prohibited, no state funds shall be expended for purpose of therapy.", "description": "Conversion therapy prohibited. Prohibits any health care provider or person who performs counseling as part of his training for any profession licensed by a regulatory board of the Department of Health Professions from engaging in conversion therapy with any person under 18 years of age. The bill defines \"conversion therapy\" as any practice or treatment that seeks to change an individual's sexual orientation or gender identity, including efforts to change behaviors or gender expressions or to eliminate or reduce sexual or romantic attractions or feelings toward individuals of the same gender. \"Conversion therapy\" does not include counseling that provides assistance to a person undergoing gender transition, or counseling that provides acceptance, support, and understanding of a person or facilitates a person's coping, social support, and identity exploration and development, including sexual-orientation-neutral interventions to prevent or address unlawful conduct or unsafe sexual practices, as long as such counseling does not seek to change an individual's sexual orientation or gender identity. The bill provides that no state funds shall be expended for the purpose of conducting conversion therapy, referring a person for conversion therapy, extending health benefits coverage for conversion therapy, or awarding a grant or contract to any entity that conducts conversion therapy or refers individuals for conversion therapy."}, "428": {"bill_id": 809501, "number": "HB429", "change_hash": "58ae55794e1b19b6503ec943a8b8a4be", "url": "https://legiscan.com/VA/bill/HB429/2016", "status_date": "2016-01-07", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "Virginia Human Rights Act; public employment, prohibited discrimination.", "description": "Virginia Human Rights Act; public employment; prohibited discrimination; sexual orientation. Prohibits discrimination in employment on the basis of sexual orientation. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill also codifies existing prohibited discrimination in public employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran. The bill contains technical amendments."}, "912": {"bill_id": 812597, "number": "HB913", "change_hash": "0e654ef9995bc7b40dbc4ccd02ef01ac", "url": "https://legiscan.com/VA/bill/HB913/2016", "status_date": "2016-01-12", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "Discrimination; prohibited in employment and housing.", "description": "Prohibited discrimination in employment and housing. Prohibits discrimination in private or public employment on the basis of sexual orientation or gender identity. The bill also adds discrimination on the basis of sexual orientation or gender identity as an unlawful discriminatory housing practice. The bill defines \"sexual orientation\" and \"gender identity.\" The bill also conforms various provisions prohibiting discrimination in public employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, or disability."}, "1004": {"bill_id": 813104, "number": "HB1005", "change_hash": "7ccdf613298cf8f36afbac63b7039109", "url": "https://legiscan.com/VA/bill/HB1005/2016", "status_date": "2016-01-13", "status": 1, "last_action_date": "2016-02-16", "last_action": "Left in General Laws", "title": "VA Human Rights Act; public employment, public accommodation, & housing, prohibited discrimination.", "description": "Virginia Human Rights Act; public employment, public accommodation, and housing; prohibited discrimination; sexual orientation. Prohibits discrimination in employment and public accommodation on the basis of sexual orientation. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill also codifies existing prohibited discrimination in public employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran. The bill also adds discrimination based on sexual orientation or gender identity as an unlawful discriminatory housing practice. The bill contains technical amendments."}, "2205": {"bill_id": 798342, "number": "SB12", "change_hash": "1e9f5b142dbd4c256845289bc078f2b1", "url": "https://legiscan.com/VA/bill/SB12/2016", "status_date": "2016-01-28", "status": 2, "last_action_date": "2016-03-08", "last_action": "Left in General Laws", "title": "Public employment; prohibited discrimination based on sexual orientation or gender identity.", "description": "Nondiscrimination in public employment. Prohibits discrimination in public employment on the basis of sexual orientation or gender identity, as defined in the bill. The bill also codifies for state and local government employment the current prohibitions on discrimination in employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a special disabled veteran or other veteran."}, "2260": {"bill_id": 801692, "number": "SB67", "change_hash": "fae0eeaf82eac55d593f0fd56cdea31e", "url": "https://legiscan.com/VA/bill/SB67/2016", "status_date": "2016-01-28", "status": 2, "last_action_date": "2016-03-08", "last_action": "Left in General Laws", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices, sexual orientation, etc.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices; sexual orientation and gender identity. Adds discrimination on the basis of an individual's sexual orientation or gender identity as an unlawful housing practice. The bill also defines sexual orientation and gender identity."}, "2455": {"bill_id": 809454, "number": "SB262", "change_hash": "9fddbab96985aa9d997f3262fedfb44a", "url": "https://legiscan.com/VA/bill/SB262/2016", "status_date": "2016-01-06", "status": 1, "last_action_date": "2016-01-28", "last_action": "Passed by indefinitely in Education and Health (8-Y 5-N)", "title": "Conversion therapy prohibited.", "description": "Conversion therapy prohibited. Prohibits any health care provider or person who performs counseling as part of his training for any profession licensed by a regulatory board of the Department of Health Professions from engaging in conversion therapy with any person under 18 years of age. The bill defines \"conversion therapy\" as any practice or treatment that seeks to change an individual's sexual orientation or gender identity, including efforts to change behaviors or gender expressions or to eliminate or reduce sexual or romantic attractions or feelings toward individuals of the same gender. \"Conversion therapy\" does not include counseling that provides assistance to a person undergoing gender transition, or counseling that provides acceptance, support, and understanding of a person or facilitates a person's coping, social support, and identity exploration and development, including sexual-orientation-neutral interventions to prevent or address unlawful conduct or unsafe sexual practices, as long as such counseling does not seek to change an individual's sexual orientation or gender identity. The bill provides that no state funds shall be expended for the purpose of conducting conversion therapy, referring a person for conversion therapy, extending health benefits coverage for conversion therapy, or awarding a grant or contract to any entity that conducts conversion therapy or refers individuals for conversion therapy."}, "2460": {"bill_id": 809478, "number": "SB267", "change_hash": "f3f0cd9fedd719ff5c9ee94c730ccd59", "url": "https://legiscan.com/VA/bill/SB267/2016", "status_date": "2016-01-06", "status": 1, "last_action_date": "2016-01-28", "last_action": "Passed by indefinitely in Education and Health (8-Y 5-N)", "title": "Conversion therapy; prohibited.", "description": "Conversion therapy prohibited. Prohibits any health care provider or person who performs counseling as part of his training for any profession licensed by a regulatory board of the Department of Health Professions from engaging in conversion therapy with any person under 18 years of age. The bill defines \"conversion therapy\" as any practice or treatment that seeks to change an individual's sexual orientation or gender identity, including efforts to change behaviors or gender expressions or to eliminate or reduce sexual or romantic attractions or feelings toward individuals of the same gender. \"Conversion therapy\" does not include counseling that provides assistance to a person undergoing gender transition, or counseling that provides acceptance, support, and understanding of a person or facilitates a person's coping, social support, and identity exploration and development, including sexual-orientation-neutral interventions to prevent or address unlawful conduct or unsafe sexual practices, as long as such counseling does not seek to change an individual's sexual orientation or gender identity."}}