{"session": {"session_id": 1261, "state_id": 46, "year_start": 2017, "year_end": 2017, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2017 Regular Session", "session_name": "2017 Regular Session"}, "390": {"bill_id": 899174, "number": "HB1667", "change_hash": "c80438c58fcce1b07b5877ed5894f78d", "url": "https://legiscan.com/VA/bill/HB1667/2017", "status_date": "2017-01-05", "status": 1, "last_action_date": "2017-02-08", "last_action": "Left in General Laws", "title": "Public contracts; gender identity, civil liability.", "description": "Public contracts; civil liability; gender identity; sexual orientation. Prohibits agencies of the Commonwealth and other public bodies from requiring any contractor entering into a public contract to agree to additional nondiscrimination provisions with respect to gender identity or sexual orientation. The bill also provides civil immunity for any business or nonprofit organization that does not provide any benefit or accommodation with respect to gender identity or sexual orientation."}, "499": {"bill_id": 901651, "number": "HB1776", "change_hash": "be1b7e01ce742b5a50302644a0f7ba3f", "url": "https://legiscan.com/VA/bill/HB1776/2017", "status_date": "2017-01-09", "status": 1, "last_action_date": "2017-02-07", "last_action": "Left in Courts of Justice", "title": "Hate crimes; adds gender, sexual orientation, gender identity, or disability, penalty.", "description": "Hate crimes; gender, sexual orientation, gender identity, or disability; penalty. Adds gender, sexual orientation, gender identity, and disability to the categories of victims whose intentional selection for a hate crime involving assault, assault and battery, or trespass for the purpose of damaging another's property results in a higher criminal penalty for the offense. The bill also adds these categories of victims to the categories of hate crimes that are to be reported to the central repository of information regarding hate crimes maintained by the Virginia State Police."}, "780": {"bill_id": 906119, "number": "HB2057", "change_hash": "6db974d1afc67b0a94da48210385c8f1", "url": "https://legiscan.com/VA/bill/HB2057/2017", "status_date": "2017-01-10", "status": 1, "last_action_date": "2017-02-08", "last_action": "Left in General Laws", "title": "Discrimination; prohibited in private or public employment.", "description": "Prohibited discrimination in employment. Prohibits discrimination in private or public employment based on sexual orientation or status as a veteran. The bill provides that under the Virginia Human Rights Act, such discrimination is actionable if the violating employer has more than five but less than 15 employees. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill also conforms various provisions prohibiting discrimination in public employment based on race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or veteran status. The bill contains technical amendments."}, "852": {"bill_id": 906818, "number": "HB2129", "change_hash": "92e5e39b191e14a11d06e7b198d7c004", "url": "https://legiscan.com/VA/bill/HB2129/2017", "status_date": "2017-01-11", "status": 1, "last_action_date": "2017-02-08", "last_action": "Left in General Laws", "title": "Virginia Human Rights Act; prohibits discrimination in employment.", "description": "Virginia Human Rights Act; public employment, public accommodation, and housing; prohibited discrimination; sexual orientation. Prohibits discrimination in employment and public accommodation on the basis of sexual orientation. The bill defines \"sexual orientation\" as a person's actual or perceived heterosexuality, bisexuality, homosexuality, or gender identity or expression. The bill expressly provides that \"sexual orientation\" does not include any person's attraction toward persons with whom sexual conduct would be illegal due to the age of the parties. The bill also codifies existing prohibited discrimination in public employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran. The bill also adds discrimination based on sexual orientation or gender identity as an unlawful discriminatory housing practice. The bill contains technical amendments."}, "2072": {"bill_id": 884840, "number": "SB783", "change_hash": "1cb61092c861c410839491b755317c48", "url": "https://legiscan.com/VA/bill/SB783/2017", "status_date": "2017-01-26", "status": 2, "last_action_date": "2017-02-21", "last_action": "Left in General Laws", "title": "Public employment; prohibits discrimination on basis of sexual orientation or gender identity.", "description": "Nondiscrimination in public employment. Prohibits discrimination in public employment on the basis of sexual orientation or gender identity, as defined in the bill. The bill also codifies for state and local government employment the current prohibitions on discrimination in employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran."}, "2111": {"bill_id": 888452, "number": "SB822", "change_hash": "d179c78e0b5896f73d41fb854992cfc5", "url": "https://legiscan.com/VA/bill/SB822/2017", "status_date": "2017-01-26", "status": 2, "last_action_date": "2017-02-21", "last_action": "Left in General Laws", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices, sexual orientation and gender.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices; sexual orientation and gender identity. Adds discrimination on the basis of an individual's sexual orientation or gender identity as an unlawful housing practice. The bill defines sexual orientation and gender identity."}, "2813": {"bill_id": 921257, "number": "SB1524", "change_hash": "9839e6eb770baf5da1cefcfad960dc0c", "url": "https://legiscan.com/VA/bill/SB1524/2017", "status_date": "2017-01-19", "status": 1, "last_action_date": "2017-02-01", "last_action": "Passed by indefinitely in Courts of Justice (9-Y 6-N)", "title": "Hate crimes; criminal acts against persons because of gender, etc.", "description": "Hate crimes; gender, sexual orientation, gender Hate crimes; gender, sexual orientation, gender identity, or disability; civil action; penalty. Adds disability, gender, gender identity, and sexual orientation to the categories of victims whose intentional selection for a hate crime involving assault, assault and battery, or trespass for the purpose of damaging another's property results in a higher criminal penalty for the offense. The bill also adds disability, gender, gender identity, and sexual orientation status to the categories of hate crimes that are to be reported to the central repository of information regarding hate crimes maintained by the Virginia State Police. The bill also provides that a person who is subjected to acts of vandalism to his real or personal property, where such vandalism is motived by disability, gender, gender identity, and sexual orientation, may bring a civil action to recover his damages. The bill also provides that no provider or user of an interactive computer service on the Internet shall be liable for any action voluntarily taken by it in good faith to restrict access to material that the provider or user considers to be intended to incite hatred on the basis of disability, gender, gender identity, sexual orientation."}}