{"session": {"session_id": 1601, "state_id": 46, "year_start": 2019, "year_end": 2019, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2019 Regular Session", "session_name": "2019 Regular Session"}, "73": {"bill_id": 1130928, "number": "HB1645", "change_hash": "f326117a7f353ac9cf13cc2d16cf1c23", "url": "https://legiscan.com/VA/bill/HB1645/2019", "status_date": "2018-11-27", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in General Laws", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices. Adds discrimination on the basis of a person's source of income to the list of unlawful discriminatory housing practices. The bill defines \"source of income\" as any source that lawfully provides funds to or on behalf of a renter or buyer of housing, including any assistance, benefit, or subsidy program, whether such program is administered by a governmental or nongovernmental entity."}, "292": {"bill_id": 1137112, "number": "HB1864", "change_hash": "9a6fd9ecff520e8c1be195f51deba2e3", "url": "https://legiscan.com/VA/bill/HB1864/2019", "status_date": "2019-01-03", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in Commerce and Labor", "title": "Health insurance; nondiscrimination, gender identity or transgender status.", "description": "Health insurance; nondiscrimination; gender identity or transgender status. Prohibits a health carrier from denying or limiting coverage or imposing additional cost sharing or other limitations or restrictions on coverage, under a health benefit plan for health care services that are ordinarily or exclusively available to covered individuals of one sex, to a transgender individual on the basis of the fact that the individual's sex assigned at birth, gender identity, or gender otherwise recorded is different from the one to which such health services are ordinarily or exclusively available. The measure also prohibits a health carrier from (i) subjecting an individual to discrimination under a health benefit plan on the basis of gender identity or being a transgender individual or (ii) requiring that an individual, as a condition of enrollment or continued enrollment under a health benefit plan, pay a premium that is greater than the premium for a similarly situated covered person enrolled in the plan on the basis of the covered person's gender identity or being a transgender individual. The measure requires health carriers to assess medical necessity according to nondiscriminatory criteria that are consistent with current medical standards."}, "495": {"bill_id": 1140402, "number": "HB2067", "change_hash": "6d7f49c59dde4d38d02345098e4ebb6a", "url": "https://legiscan.com/VA/bill/HB2067/2019", "status_date": "2019-01-07", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in General Laws", "title": "Public employment; prohibits discrimination on basis of sexual orientation or gender identity.", "description": "Nondiscrimination in public employment. Prohibits discrimination in public employment on the basis of sexual orientation or gender identity, as defined in the bill. The bill also codifies for state and local government employment the current prohibitions on discrimination in employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran."}, "797": {"bill_id": 1142106, "number": "HB2369", "change_hash": "56d8d00130c9561c2bc9a0ef67c8556c", "url": "https://legiscan.com/VA/bill/HB2369/2019", "status_date": "2019-01-08", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in Rules", "title": "Virginia Human Rights Act; establishment of right to reproductive choice.", "description": "Virginia Human Rights Act; establishment of right to reproductive choice. Establishes that (i) every individual has a fundamental right to choose or refuse contraception or sterilization and (ii) every individual who becomes pregnant has a fundamental right to choose to carry a pregnancy to term, give birth to a child, or terminate the pregnancy. The bill provides that the Commonwealth shall not deny or interfere with such fundamental rights in the regulation or provision of benefits, facilities, services, or information. The bill further provides that the Commonwealth shall not discriminate in the protection or enforcement of such fundamental rights on the basis of sex, disability, race, ethnicity, gender identity, age, marital status, national origin, immigration status, religion, or sexual orientation."}, "849": {"bill_id": 1142356, "number": "HB2421", "change_hash": "61f851250d2eba28b449d899c278a5e1", "url": "https://legiscan.com/VA/bill/HB2421/2019", "status_date": "2019-01-08", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in General Laws", "title": "Discrimination; sexual orientation and gender identity.", "description": "Prohibited discrimination; sexual orientation and gender identity. Prohibits discrimination in employment, public accommodation, public contracting, apprenticeship programs, housing, banking, and insurance on the basis of sexual orientation or gender identity. The bill codifies existing prohibited discrimination in public employment on the basis of race, color, religion, national origin, sex, pregnancy, childbirth or related medical conditions, age, marital status, disability, or status as a veteran and adds discrimination based on sexual orientation or gender identity to the list of unlawful discriminatory housing practices. The bill contains technical amendments."}, "900": {"bill_id": 1142319, "number": "HB2472", "change_hash": "82e8d49e24230a4d8812f4e73aaf9470", "url": "https://legiscan.com/VA/bill/HB2472/2019", "status_date": "2019-01-09", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in Courts of Justice", "title": "Hate crimes; adds gender, disability, gender identity, or sexual orientation, penalty.", "description": "Hate crimes; gender, disability, gender identity, or sexual orientation; penalty. Adds gender, disability, gender identity, and sexual orientation to the categories of victims whose intentional selection for a hate crime involving assault, assault and battery, or trespass for the purpose of damaging another's property results in a higher criminal penalty for the offense. The bill also adds gender, disability, gender identity, and sexual orientation to the categories of hate crimes that are to be reported to the central repository of information regarding hate crimes maintained by the Virginia State Police and provides that a person who is subjected to acts of intimidation or harassment, violence directed against his person, or vandalism to his real or personal property, where such acts are motivated by gender, disability, gender identity, and sexual orientation, may bring a civil action to recover his damages. The bill also provides that no provider or user of an interactive computer service on the Internet shall be liable for any action voluntarily taken by it in good faith to restrict access to material that the provider or user considers to be intended to incite hatred on the basis of gender, disability, gender identity, or sexual orientation."}, "1105": {"bill_id": 1149211, "number": "HB2677", "change_hash": "037948ca101a836c4b4476f3ff086ecb", "url": "https://legiscan.com/VA/bill/HB2677/2019", "status_date": "2019-01-14", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in General Laws", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices, etc.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices; sexual orientation and gender identity. Adds discrimination on the basis of an individual's sexual orientation or gender identity as an unlawful housing practice. The bill defines sexual orientation and gender identity."}, "1112": {"bill_id": 1149798, "number": "HB2684", "change_hash": "20903fad448b09ccb1f8ec7ba8adae62", "url": "https://legiscan.com/VA/bill/HB2684/2019", "status_date": "2019-01-14", "status": 1, "last_action_date": "2019-02-05", "last_action": "Left in Courts of Justice", "title": "Hate crimes; gender, gender identity, or sexual orientation, penalty.", "description": "Hate crimes; gender, gender identity, or sexual orientation; penalty. Adds gender, gender identity, and sexual orientation to the categories of victims whose intentional selection for a hate crime involving assault, assault and battery, or trespass for the purpose of damaging another's property results in a higher criminal penalty for the offense. The bill also adds gender, gender identity, and sexual orientation to the categories of hate crimes that are to be reported to the central repository of information regarding hate crimes maintained by the Virginia State Police and provides that a person who is subjected to acts of intimidation or harassment, violence directed against his person, or vandalism to his real or personal property, where such acts are motivated by gender, gender identity, or sexual orientation, may bring a civil action to recover his damages. The bill also provides that no provider or user of an interactive computer service on the Internet shall be liable for any action voluntarily taken by it in good faith to restrict access to material that the provider or user considers to be intended to incite hatred on the basis of gender, gender identity, or sexual orientation."}}