{"session": {"session_id": 1760, "state_id": 46, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2020 1st Special Session", "session_name": "2020 Special I"}, "61": {"bill_id": 1376511, "number": "HB5062", "change_hash": "910d4e482dd56e0f9293bff670f6c934", "url": "https://legiscan.com/VA/bill/HB5062/2020/X1", "status_date": "2020-10-21", "status": 4, "last_action_date": "2020-10-21", "last_action": "Governor: Acts of Assembly Chapter text (CHAP0021)", "title": "Court authority in criminal cases; prosecutorial discretion to dispose of a criminal case.", "description": "Court authority in criminal cases; prosecutorial discretion to dispose of a criminal case. Requires a court to grant a motion to dismiss made by the Commonwealth, whether with or without prejudice, and with the consent of the defendant unless the court finds by clear and convincing evidence that the motion was made as the result of (i) bribery or (ii) bias or prejudice toward a victim because of the race, religious conviction, gender, disability, gender identity, sexual orientation, color, or national origin of the victim."}, "97": {"bill_id": 1376755, "number": "HB5098", "change_hash": "b6ad15825acb0820854912b6921f4c17", "url": "https://legiscan.com/VA/bill/HB5098/2020/X1", "status_date": "2020-10-21", "status": 4, "last_action_date": "2020-10-21", "last_action": "Governor: Acts of Assembly Chapter text (CHAP0022)", "title": "Hate crimes; falsely summoning or giving false reports to law-enforcement officials, penalty.", "description": "Hate crime; falsely summoning or giving false reports to law-enforcement officials; penalty. Increases the penalty for falsely summoning or giving false reports to law-enforcement officials from a Class 1 misdemeanor to a Class 6 felony when a person intentionally gives a false report as to the commission of any crime to any law-enforcement official, causes another to give a false report to any law-enforcement official, or calls or summons any law-enforcement official against another person because of his race, religious conviction, gender, disability, gender identity, sexual orientation, color, or national origin."}, "111": {"bill_id": 1376847, "number": "HB5112", "change_hash": "e7078c5481a08e534370ee19f97ae2f5", "url": "https://legiscan.com/VA/bill/HB5112/2020/X1", "status_date": "2020-09-03", "status": 2, "last_action_date": "2020-09-16", "last_action": "Passed by indefinitely in Judiciary (10-Y 3-N)", "title": "Law-enforcement officer; duty to render aid, duty to report wrongdoing by another officer.", "description": "Law-enforcement officer; duty to render aid; duty to report wrongdoing by another law-enforcement officer; penalty. Requires any law-enforcement officer on duty who witnesses another person suffering from a serious bodily injury or a life-threatening condition to render aid and makes it a duty to report acts of wrongdoing committed by another law-enforcement officer. Any law-enforcement officer who fails to render such aid or report such acts of abuse, fraud, misconduct, or wrongdoing committed by another law-enforcement officer shall be subject to disciplinary action, including dismissal, demotion, suspension, or transfer of the law-enforcement officer. The bill also penalizes as a Class 1 misdemeanor the failure of any law-enforcement officer, who has actual knowledge of the commission on duty of a criminal offense by another law-enforcement officer, to report such wrongdoing, defined in the bill. The bill also amends the definition of \"bias-based profiling\" to include sexual orientation and gender identity."}}