{"session": {"session_id": 1759, "state_id": 46, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "0": {"bill_id": 1383390, "number": "HB7", "change_hash": "1ea223b17bde3edd1bbf8136f094c4ad", "url": "https://legiscan.com/VA/bill/HB7/2021", "status_date": "2020-02-03", "status": 2, "last_action_date": "2020-12-04", "last_action": "Left in General Laws and Technology", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices. Prohibits any locality, its employees, or its appointed commissions from discriminating (i) in the application of local land use ordinances or guidelines, or in the permitting of housing developments, on the basis of race, color, religion, national origin, sexual orientation, gender identity, sex, elderliness, familial status, or handicap or (ii) in the permitting of housing developments because the housing development contains or is expected to contain affordable housing units occupied or intended for occupancy by families or individuals with incomes at or below 80 percent of the median income of the area where the housing development is located or is proposed to be located, unless at the time of the municipal decision, a proposed development will be located in a census tract wherein more than 50 percent of the units serve families or individuals at or below 80 percent of the median income of the area. The bill also requires the Fair Housing Board, after determining the existence of an unlawful discriminatory housing practice and after consultation with the Attorney General, to immediately refer the matter to the Attorney General for civil action. Virginia Fair Housing Law; unlawful discriminatory housing practices. Prohibits any locality, its employees, or its appointed commissions from discriminating (i) in the application of local land use ordinances or guidelines, or in the permitting of housing developments, on the basis of race, color, religion, national origin, sexual orientation, gender identity, sex, elderliness, familial status, or handicap or (ii) in the permitting of housing developments because the housing development contains or is expected to contain affordable housing units occupied or intended for occupancy by families or individuals with incomes at or below 80 percent of the median income of the area where the housing development is located or is proposed to be located, unless at the time of the municipal decision, a proposed development will be located in a census tract wherein more than 50 percent of the units serve families or individuals at or below 80 percent of the median income of the area. The bill also requires the Fair Housing Board, after determining the existence of an unlawful discriminatory housing practice and after consultation with the Attorney General, to immediately refer the matter to the Attorney General for civil action."}, "289": {"bill_id": 1390976, "number": "HB1782", "change_hash": "c5c1e96d5edb2395ca86c4bb259ff26f", "url": "https://legiscan.com/VA/bill/HB1782/2021", "status_date": "2020-12-29", "status": 1, "last_action_date": "2021-02-05", "last_action": "Left in Courts of Justice", "title": "Wearing masks during commission of a crime or acts of intimidation or harassment; penalty.", "description": "Wearing masks during commission of a crime or acts of intimidation or harassment; penalty. Changes the prohibition on wearing a mask in certain places to make it a Class 1 misdemeanor for any person to, with the intent to conceal his identity, wear any mask, hood, or other device whereby a substantial portion of the face is hidden or covered so as to conceal the identity of the wearer while committing or attempting to commit (i) a crime or (ii) an act of intimidation or harassment against another person where such act is motivated by racial, religious, gender, disability, gender identity, sexual orientation, or ethnic animosity. Current law makes it a Class 6 felony for any person over 16 years of age to wear such mask or other device and be or appear in any public place or upon any private property in the Commonwealth without first obtaining written consent from the owner or tenant, with some exceptions."}, "312": {"bill_id": 1393425, "number": "HB1805", "change_hash": "323f8c0191157a984eec7cc9b093a956", "url": "https://legiscan.com/VA/bill/HB1805/2021", "status_date": "2021-01-18", "status": 2, "last_action_date": "2021-02-05", "last_action": "Continued to 2021 Sp. Sess. 1 in Rehabilitation and Social Services (14-Y 0-N)", "title": "Aging services; social need.", "description": "Aging services; economic and social need. Provides that, in providing aging services, the Department for Aging and Rehabilitative Services shall prioritize providing services to older persons with the greatest economic or social need. The bill defines \"economic need\" as need resulting from an income level at or below the poverty line and \"social need\" as need caused by noneconomic factors, including (i) physical and mental disabilities, which may include developmental disabilities and human immunodeficiency virus; (ii) language barriers; and (iii) cultural, social, or geographic isolation, including that caused by racial or ethnic status, gender identity, gender expression, or sexual orientation that restricts an individual's ability to perform normal daily tasks or threatens such individual's capacity to live independently.  Aging services; economic and social need. Provides that, in providing aging services, the Department for Aging and Rehabilitative Services shall prioritize providing services to older persons with the greatest economic or social need. The bill defines \"economic need\" as need resulting from an income level at or below the poverty line and \"social need\" as need caused by noneconomic factors, including (i) physical and mental disabilities, which may include developmental disabilities and human immunodeficiency virus; (ii) language barriers; and (iii) cultural, social, or geographic isolation, including that caused by racial or ethnic status, gender identity, gender expression, or sexual orientation that restricts an individual's ability to perform normal daily tasks or threatens such individual's capacity to live independently."}, "455": {"bill_id": 1398648, "number": "HB1948", "change_hash": "c7c1e36a2837d8f0e22faa08801b6c7c", "url": "https://legiscan.com/VA/bill/HB1948/2021", "status_date": "2021-01-19", "status": 2, "last_action_date": "2021-02-05", "last_action": "Continued to 2021 Sp. Sess. 1 in Judiciary (14-Y 0-N)", "title": "Law-enforcement officer; duty to render aid, duty to report wrongdoing by another officer.", "description": "Law-enforcement officer; duty to render aid; duty to report wrongdoing by another law-enforcement officer. Requires any law-enforcement officer on duty who witnesses another person suffering from a serious bodily injury or a life-threatening condition to render aid and makes it a duty to report acts of wrongdoing, defined in the bill and including bias-based profiling, committed by another law-enforcement officer on duty. Any law-enforcement officer who fails to render such aid or report such wrongdoing committed by another law-enforcement officer shall be subject to disciplinary action, including dismissal, demotion, suspension, or transfer of the law-enforcement officer. The bill also expands the definition of \"bias-based profiling,\" a practice banned for sheriffs, deputy sheriffs, other local law-enforcement officers, and State Police officers in the performance of their official duties, to include sexual orientation and gender identity."}, "639": {"bill_id": 1403993, "number": "HB2132", "change_hash": "3a01357f1f0f33f16aee9b38a44fb569", "url": "https://legiscan.com/VA/bill/HB2132/2021", "status_date": "2021-02-04", "status": 2, "last_action_date": "2021-02-05", "last_action": "Continued to 2021 Sp. Sess. 1 in Judiciary (14-Y 0-N)", "title": "Homicides and assaults and bodily woundings; certain matters not to constitute defenses.", "description": "Homicides and assaults and bodily woundings; certain matters not to constitute defenses. Provides that the discovery of, perception of, or belief about another person's actual or perceived sex, gender, gender identity, or sexual orientation, whether or not accurate, is not a defense to any charge of capital murder, murder in the first degree, murder in the second degree, voluntary manslaughter, or assault and bodily wounding-related crimes and is not provocation negating or excluding malice as an element of murder.  Homicides and assaults and bodily woundings; certain matters not to constitute defenses. Provides that the discovery of, perception of, or belief about another person's actual or perceived sex, gender, gender identity, or sexual orientation, whether or not accurate, is not a defense to any charge of capital murder, murder in the first degree, murder in the second degree, voluntary manslaughter, or assault and bodily wounding-related crimes and is not provocation negating or excluding malice as an element of murder."}, "781": {"bill_id": 1406450, "number": "HB2274", "change_hash": "9c792fcb3041eb315cdb4103ebf923b0", "url": "https://legiscan.com/VA/bill/HB2274/2021", "status_date": "2021-01-14", "status": 1, "last_action_date": "2021-02-05", "last_action": "Left in Labor and Commerce", "title": "Health insurance; carrier business practices, provider contracts.", "description": "Health insurance; provider contracts. Requires that Health insurance; provider contracts. Requires that each provider contract include provisions (i) requiring providers to provide health care services to enrollees in a manner similar to and within the same time availability in which the provider provides health care services to any other individual and (ii) prohibiting a provider from discriminating against any enrollee as a result of the enrollee's enrollment in a health plan or on the basis of the enrollee's race, color, creed, national origin, ancestry, religion, sex, marital status, age, disability, payment source, state of health, need for health care services, status as a litigant except in cases where the enrollee claims medical malpractice by the provider, status as a Medicare enrollee, status as a medical assistance recipient, sexual orientation, or gender identity, or on any other basis prohibited by law. The bill prohibits a provider contract from requiring a provider to provide any type or kind of health care service to enrollees that it does not customarily provide to others. The bill provides that a provider that violates the anti-discrimination provisions may be subject to fines and other discipline from the provider's licensing authority and an enrollee injured as result of any discrimination is entitled initiate a civil action against the provider. The bill also prohibits a provider contract from (a) directly or indirectly restricting the carrier from directing or steering enrollees to other health care providers or offering incentives to encourage enrollees to utilize specific providers; (b) requiring the carrier to enter into any additional contract with an affiliate of the provider as a condition of entering into a contract with such provider or to agree to payment rates or other terms for any affiliate not party to the contract of the provider involved; or (c) restricting other carriers not party to the contract from paying a lower rate for items or services than the contracting plan or issuer pays for such items or services.  The bill prohibits a provider from terminating or failing to renew the contractual relationship with a carrier, or any provider contract, or otherwise penalize any carrier, for invoking any of the carrier's rights. The bill also provides that a provider or carrier injured as a result of a violation or threatened violation of any provision governing carrier business practices is entitled to injunctive relief against any and all violators or persons threatening violation. The bill requires a provider contract to permit a provider a maximum of 90 days from the date a health care service is rendered to submit a claim for payment. The bill requires carriers to supply fee schedules in writing and in machine-readable electronic format and to provide the complete fee schedule applicable to the provider for each health plan in which the provider participates or is proposed to participate. The bill requires that amendments to a provider contract be presented in a manner so as to allow the provider to easily identify the specific terms being proposed for amendment and that proposed amendments be formatted to clearly identify the changes to the language of the agreement."}, "1086": {"bill_id": 1419285, "number": "HJR618", "change_hash": "d9bdbd2bd094ee28bafd201dea3e2175", "url": "https://legiscan.com/VA/bill/HJR618/2021", "status_date": "2021-01-22", "status": 1, "last_action_date": "2021-02-05", "last_action": "Left in Rules", "title": "Racism & racist ideologies; condemns all forms of hate, bigotry, etc., & discrimination.", "description": "Denouncing racism and racist ideologies. Condemns all forms of racism, hate, bigotry, and discrimination, including physical or verbal attacks that target people on the basis of racial or ethnic origin, religion, sexual orientation, or gender identity."}, "1485": {"bill_id": 1403368, "number": "SB1203", "change_hash": "e7feceae108fa7f175b9d097f7ed4da2", "url": "https://legiscan.com/VA/bill/SB1203/2021", "status_date": "2021-01-11", "status": 1, "last_action_date": "2021-01-20", "last_action": "Passed by indefinitely in Judiciary (10-Y 5-N)", "title": "Hate crimes; associational relationships, penalty.", "description": "Hate crimes; associational relationships; penalty. Redefines the categories of victims whose intentional selection for a hate crime involving assault, assault and battery, or trespass for the purpose of damaging another's property results in a higher criminal penalty for the offense to include a person's actual or perceived race, color, ethnicity, religious conviction, national origin, gender, sex, disability, gender identity, gender expression, or sexual orientation or a person's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religious conviction, national origin, gender, sex, disability, gender identity, gender expression, or sexual orientation. The bill adds these categories of victims whose intentional selection for a hate crime involves malicious wounding and makes such crime punishable by a term of imprisonment of not less than five years, nor more than 40 years. The bill also redefines these categories for the purposes of reporting hate crimes to the central repository of information maintained by the Virginia State Police, for civil actions to recover damages for vandalism, and for interactive computer service liability."}, "1648": {"bill_id": 1405293, "number": "SB1366", "change_hash": "a2c950927763a89a637a311290cd2ba8", "url": "https://legiscan.com/VA/bill/SB1366/2021", "status_date": "2021-01-29", "status": 2, "last_action_date": "2021-02-08", "last_action": "Continued to Special Session 1 in Health, Welfare and Institutions by voice vote", "title": "Aging services; economic and social need.", "description": "Aging services; social need. Requires the Department for Aging and Rehabilitative Services, in providing aging services, to use available resources to provide services to older persons with the greatest economic or social needs. The bill defines \"economic need\" as need resulting from an income level at or below the poverty line. The bill defines \"social need\" as need caused by noneconomic factors, including (i) physical and mental disabilities, which include developmental disabilities and human immunodeficiency virus; (ii) language barriers; and (iii) cultural, social, or geographic isolation, including that which is related to a history of discrimination for factors such as racial or ethnic status, gender identity, gender expression, or sexual orientation that can affect an individual's ability to perform normal daily tasks or threatens such individual's capacity to live independently.  Aging services; social need. Requires the Department for Aging and Rehabilitative Services, in providing aging services, to use available resources to provide services to older persons with the greatest economic or social needs. The bill defines \"economic need\" as need resulting from an income level at or below the poverty line. The bill defines \"social need\" as need caused by noneconomic factors, including (i) physical and mental disabilities, which include developmental disabilities and human immunodeficiency virus; (ii) language barriers; and (iii) cultural, social, or geographic isolation, including that which is related to a history of discrimination for factors such as racial or ethnic status, gender identity, gender expression, or sexual orientation that can affect an individual's ability to perform normal daily tasks or threatens such individual's capacity to live independently."}}