{"session": {"session_id": 1828, "state_id": 46, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2021 1st Special Session", "session_name": "2021 Special I"}, "23": {"bill_id": 1443240, "number": "HB1805", "change_hash": "51a25a7908986dbc68bb4e810c89438f", "url": "https://legiscan.com/VA/bill/HB1805/2021/X1", "status_date": "2021-03-24", "status": 4, "last_action_date": "2021-03-24", "last_action": "Governor: Acts of Assembly Chapter text (CHAP0299)", "title": "Aging services; economic and social needs.", "description": "Aging services; social need. Requires the Department for Aging and Rehabilitative Services, in providing aging services, to use available resources to provide services to older persons with the greatest economic or social needs. The bill defines \"economic need\" as need resulting from an income level at or below the poverty line. The bill defines \"social need\" as need caused by noneconomic factors, including (i) physical and mental disabilities, which include developmental disabilities and human immunodeficiency virus; (ii) language barriers; and (iii) cultural, social, or geographic isolation, including that which is related to a history of discrimination for factors such as racial or ethnic status, gender identity, gender expression, or sexual orientation that can affect an individual's ability to perform normal daily tasks or threatens such individual's capacity to live independently."}, "127": {"bill_id": 1442983, "number": "HB1948", "change_hash": "6a740bece46382be07dfceb3a9298a1d", "url": "https://legiscan.com/VA/bill/HB1948/2021/X1", "status_date": "2021-01-19", "status": 2, "last_action_date": "2021-02-17", "last_action": "Passed by indefinitely in Judiciary (7-Y 6-N)", "title": "Law-enforcement officer; duty to render aid, duty to report wrongdoing by another officer.", "description": "Law-enforcement officer; duty to render aid; duty to report wrongdoing by another law-enforcement officer. Requires any law-enforcement officer on duty who witnesses another person suffering from a serious bodily injury or a life-threatening condition to render aid and makes it a duty to report acts of wrongdoing, defined in the bill and including bias-based profiling, committed by another law-enforcement officer on duty. Any law-enforcement officer who fails to render such aid or report such wrongdoing committed by another law-enforcement officer shall be subject to disciplinary action, including dismissal, demotion, suspension, or transfer of the law-enforcement officer. The bill also expands the definition of \"bias-based profiling,\" a practice banned for sheriffs, deputy sheriffs, other local law-enforcement officers, and State Police officers in the performance of their official duties, to include sexual orientation and gender identity."}, "199": {"bill_id": 1443202, "number": "HB2046", "change_hash": "aa4df39923e99df2d74a02a6e8875fe1", "url": "https://legiscan.com/VA/bill/HB2046/2021/X1", "status_date": "2021-03-18", "status": 4, "last_action_date": "2021-03-18", "last_action": "Governor: Acts of Assembly Chapter text (CHAP0267)", "title": "Virginia Fair Housing Law; unlawful discriminatory housing practices.", "description": "Virginia Fair Housing Law; unlawful discriminatory housing practices. Prohibits any locality, its employees, or its appointed commissions from discriminating (i) in the application of local land use ordinances or guidelines, or in the permitting of housing developments, on the basis of race, color, religion, national origin, sex, elderliness, familial status, source of funds, sexual orientation, gender identity, military status, or disability; (ii) in the permitting of housing developments because the housing development contains or is expected to contain affordable housing units occupied or intended for occupancy by families or individuals with incomes at or below 80 percent of the median income of the area where the housing development is located or is proposed to be located; or (iii) by prohibiting or imposing conditions upon the rental or sale of dwelling units, provided that the provisions of this subsection shall not be construed to prohibit ordinances related to short-term rentals. The bill provides that it shall not be a violation of the Virginia Fair Housing Law if land use decisions or decisions relating to the permitting of housing developments are based upon considerations of limiting high concentrations of affordable housing. The bill also requires the Fair Housing Board, after determining the existence of an unlawful discriminatory housing practice and after consultation with the Attorney General, to immediately refer the matter to the Attorney General for civil action.  Virginia Fair Housing Law; unlawful discriminatory housing practices. Prohibits any locality, its employees, or its appointed commissions from discriminating (i) in the application of local land use ordinances or guidelines, or in the permitting of housing developments, on the basis of race, color, religion, national origin, sex, elderliness, familial status, source of funds, sexual orientation, gender identity, military status, or disability; (ii) in the permitting of housing developments because the housing development contains or is expected to contain affordable housing units occupied or intended for occupancy by families or individuals with incomes at or below 80 percent of the median income of the area where the housing development is located or is proposed to be located; or (iii) by prohibiting or imposing conditions upon the rental or sale of dwelling units, provided that the provisions of this subsection shall not be construed to prohibit ordinances related to short-term rentals. The bill provides that it shall not be a violation of the Virginia Fair Housing Law if land use decisions or decisions relating to the permitting of housing developments are based upon considerations of limiting high concentrations of affordable housing. The bill also requires the Fair Housing Board, after determining the existence of an unlawful discriminatory housing practice and after consultation with the Attorney General, to immediately refer the matter to the Attorney General for civil action."}, "253": {"bill_id": 1444029, "number": "HB2132", "change_hash": "71a0d06066d3dc39e58c9524dc306848", "url": "https://legiscan.com/VA/bill/HB2132/2021/X1", "status_date": "2021-03-31", "status": 4, "last_action_date": "2021-03-31", "last_action": "Governor: Acts of Assembly Chapter text (CHAP0460)", "title": "Homicides and assaults and bodily woundings; certain matters not to constitute defenses.", "description": "Homicides and assaults and bodily woundings; certain matters not to constitute defenses. Provides that another person's actual or perceived sex, gender, gender identity, or sexual orientation is not in and of itself, or together with an oral solicitation, a defense to any charge of capital murder, murder in the first degree, murder in the second degree, voluntary manslaughter, or assault and bodily wounding-related crimes and is not provocation negating or excluding malice as an element of murder.  Homicides and assaults and bodily woundings; certain matters not to constitute defenses. Provides that another person's actual or perceived sex, gender, gender identity, or sexual orientation is not in and of itself, or together with an oral solicitation, a defense to any charge of capital murder, murder in the first degree, murder in the second degree, voluntary manslaughter, or assault and bodily wounding-related crimes and is not provocation negating or excluding malice as an element of murder."}}