{"session": {"session_id": 1918, "state_id": 46, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "2235": {"bill_id": 1549847, "number": "SB177", "change_hash": "190c3e27ad26cde80467113d0fe2c896", "url": "https://legiscan.com/VA/bill/SB177/2022", "status_date": "2022-01-10", "status": 1, "last_action_date": "2022-01-26", "last_action": "Passed by indefinitely in General Laws and Technology (8-Y 7-N)", "title": "Human rights and fair housing; religious organizations, promotion of religious principles.", "description": "Human rights and fair housing; religious organizations; Human rights and fair housing; religious organizations; promotion of religious principles. Provides that nothing in the Virginia Human Rights Act prohibits a religious corporation, association, or society, or any nonprofit institution or organization operated, supervised, or controlled by or in conjunction with a religious organization, association, or society, from taking any action to promote the religious principles for which it is established or maintained. The bill exempts any place of accommodation owned by or operated on behalf of a religious corporation, association, or society from the nondiscrimination in public places of accommodation provisions of the Virginia Human Rights Act. Under current law, such places of accommodation are exempt only when not open to the public. The bill adds preschools to the list of educational institutions that are exempt from discriminatory hiring practices with respect to the hiring and employment of employees of a particular religion when such institutions are owned, supported, controlled, or managed by a particular religion or religious corporation, association, or society. The bill clarifies that the term \"religion\" includes all aspects of religious observance and practice as well as belief for the purposes of the exemption from discrimination in employment of individuals employed to perform work associated with the activities of a particular religion by a religious corporation, association, educational institution, or society. The bill removes provisions allowing (i) a court or jury in a civil action that finds unlawful discrimination has occurred to order such affirmative action as may be appropriate and (ii) the Attorney General to seek to obtain such relief as would be available to a private party when he intervenes in a civil action for unlawful discrimination. The bill also removes the provision of the exemption for religious organizations under the Virginia Fair Housing Law that denies such exemption where the membership in such religion is restricted on account of race, color, national origin, sex, elderliness, familial status, sexual orientation, gender identity, military status, or disability."}}