{"session": {"session_id": 1801, "state_id": 13, "year_start": 2021, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021-2022 Regular Session", "session_name": "102nd General Assembly"}, "8": {"bill_id": 1404124, "number": "HB0009", "change_hash": "e9a81458538bb318ed0042013dac410b", "url": "https://legiscan.com/IL/bill/HB0009/2021", "status_date": "2023-01-06", "status": 3, "last_action_date": "2023-01-09", "last_action": "Added Co-Sponsor Rep. Lilian Jimenez", "title": "BIRTH CERTIFICATE CHANGE", "description": "Amends the Vital Records Act. Removes language requiring that the State Registrar of Vital Records establish a new certificate of birth when he receives a declaration stating that a person has undergone treatment for the purpose of gender transition, or that the individual has an intersex condition, and that the sex designation on such person's birth record should therefore be changed. Provides that the State Registrar of Vital Records must establish a new certificate of birth when he receives a statement signed by the person in which the person attests to making the request for the purpose of affirming the person's gender identity or intersex condition and that the sex designation on the person's certificate of birth should therefore be changed. Provides that the fee for a new certificate of birth shall not be required from persons upon release from the Department of Corrections or the Department of Juvenile Justice, but the person is entitled to only one new certificate of birth fee waiver. Provides that the fee for a new certificate of birth shall be waived for specified persons. Provides that fees for a new certificate of birth and for a search of a birth record or a certified copy of a birth record shall be waived for all requests by a person who resides in a shelter for domestic violence. Requires the State Registrar of Vital Records to establish standards and procedures for the waiver of fees. Provides that a person who resides in a shelter for domestic violence must not be charged for verification. Provides that a person who knowingly or purposefully falsifies verification is subject to a penalty of $100. Provides that a person who resides in a shelter for domestic violence shall be provided no more than 4 birth records annually under the provisions. Effective January 1, 2022."}, "56": {"bill_id": 1404564, "number": "HB0057", "change_hash": "08831a34bd2d744f974702f8a0d2f1c8", "url": "https://legiscan.com/IL/bill/HB0057/2021", "status_date": "2021-01-13", "status": 1, "last_action_date": "2021-04-14", "last_action": "Added Co-Sponsor Rep. Lindsey LaPointe", "title": "ELECTIONS-NAME CHANGES", "description": "Amends the Election Code. Provides that the requirements to change a candidate's name do not apply to name changes resulting from a civil union to assume a spouse's surname or dissolution of a civil union or declaration of invalidity of a civil union to assume a former surname or a name change that conforms the candidate's name to his or her gender identity. Makes conforming changes throughout the Code. Effective immediately."}, "407": {"bill_id": 1429909, "number": "HB0408", "change_hash": "03b938ef640b9d76cbf86f8b06cc4eef", "url": "https://legiscan.com/IL/bill/HB0408/2021", "status_date": "2021-01-29", "status": 1, "last_action_date": "2021-03-27", "last_action": "Rule 19(a) / Re-referred to Rules Committee", "title": "GOVERNMENT-TECH", "description": "Amends the Illinois Public Labor Relations Act. Makes a technical change in a Section concerning the short title."}, "3154": {"bill_id": 1456482, "number": "HB3155", "change_hash": "db04e1f6ea7d1950cfb332659589b9ca", "url": "https://legiscan.com/IL/bill/HB3155/2021", "status_date": "2021-04-14", "status": 2, "last_action_date": "2021-05-21", "last_action": "Rule 3-9(a) / Re-referred to Assignments", "title": "PATIENT RIGHTS-DISASTERS", "description": "Amends the Medical Patient Rights Act. Requires that, during the pendency of a proclamation issued by the Governor under the Illinois Emergency Management Agency Act declaring that a public health-related emergency exists, a health professional: shall permit people eligible for critical or intensive care services to remain eligible regardless of a patient's age or disability; shall provide individual patient assessments based on the best available objective medical evidence; shall not deny a patient's care based on stereotypes, assessments of a patient's quality of life, or assessments related to disability or other identity factor; and shall not make decisions on health care resources based on age, ancestry, color, creed, disability, domestic partnership or civil union status, ethnicity, gender identity or expression, health insurance status, marital status, national origin, nationality, place of residence, race, sex, sexual orientation, or socioeconomic status if the characteristics are not relevant to the patient's medical diagnosis and treatment. Defines \"health professional\". Effective immediately."}, "3169": {"bill_id": 1456431, "number": "HB3170", "change_hash": "fce0e6bd6d004a3d71e1690b18b9e2f8", "url": "https://legiscan.com/IL/bill/HB3170/2021", "status_date": "2021-02-18", "status": 1, "last_action_date": "2021-03-27", "last_action": "Rule 19(a) / Re-referred to Rules Committee", "title": "IMPLICIT BIAS TRAINING ACT", "description": "Creates the Implicit Bias Training for Health Care Professionals Act. Provides that in order to renew a license as a health care professional in the State, a licensee shall complete an evidence-based implicit bias training, which shall include the promotion of bias-reducing strategies to address how unintended biases regarding gender identity or sexual orientation affect the health care industry. Specifies information that shall be included in the implicit bias training. Provides that the Department of Financial and Professional Regulation shall adopt rules to implement the Act."}, "3534": {"bill_id": 1458308, "number": "HB3535", "change_hash": "8342e8ee57409e7a296f1a79154798c8", "url": "https://legiscan.com/IL/bill/HB3535/2021", "status_date": "2021-02-19", "status": 1, "last_action_date": "2021-03-27", "last_action": "Rule 19(a) / Re-referred to Rules Committee", "title": "SCH CD-PROHIBIT DISCRIMINATION", "description": "Amends the School Code. Provides that no student attending a public school in any of grades kindergarten through 12 may be discriminated against on the basis of race, color, religion, ancestry, national origin, gender, sexual orientation, gender identity or expression, socioeconomic status, or mental, physical, developmental, or sensory disability or by association with an individual or group who has or is perceived to have one or more of such characteristics. Effective immediately."}, "3697": {"bill_id": 1458051, "number": "HB3698", "change_hash": "548467b11d743fab825370b881196d3a", "url": "https://legiscan.com/IL/bill/HB3698/2021", "status_date": "2021-08-20", "status": 4, "last_action_date": "2021-08-20", "last_action": "Public Act . . . . . . . . . 102-0496", "title": "FINANCE-CREDIT UNIONS/VARIOUS", "description": "Amends the Illinois Credit Union Act. In provisions concerning service to the economically disadvantaged, provides that members of a targeted population may be admitted to membership in a credit union. Provides that notice of a meeting of credit union members may be posted on the credit union's website. Provides that unless expressly prohibited by the articles of incorporation or bylaws, the board of directors may provide by resolution that members may attend, participate in, act in, and vote at any annual meeting or special meeting through the use of a conference telephone or interactive technology, subject to specified conditions. Sets forth provisions concerning appointment of associate directors. In provisions concerning compensation of officials, provides that if the Department of Financial and Professional Regulation determines the payment of director or committee member compensation creates a safety and soundness issue for a credit union, the Department may take an enforcement action to reduce or suspend the compensation. Provides that the board of directors shall hold regular meetings at least once each month; however, upon approval of an amendment to the bylaws of the credit union, the board of directors may hold meetings less frequently than once each month but at least once each quarter. Provides that a credit union shall select an annual reporting period, complete an external audit report, agreed-upon procedures report, and internal audit report, and deliver copies to the Secretary of Financial and Professional Regulation no later than 120 days after the end of the annual reporting period. In provisions concerning loan programs and provisions concerning investment of funds, allows a credit union to make loans to or invest in credit union service organizations in a total amount not exceeding the greater of 6% (rather than 3%) of specified amounts. Provides that a surviving credit union may identify the merging credit union as a division, branch, unit, or other descriptive reference. Provides that the network credit union board of directors shall require each advisory board member to sign a confidentiality or non-disclosure agreement. Defines \"target market\". Makes other changes."}, "4443": {"bill_id": 1549595, "number": "HB4444", "change_hash": "670fcd800c5ab0d7df4ed518fca8408f", "url": "https://legiscan.com/IL/bill/HB4444/2021", "status_date": "2022-01-10", "status": 1, "last_action_date": "2022-02-18", "last_action": "Rule 19(a) / Re-referred to Rules Committee", "title": "NAME CHANGE-PUBLICATION NOTICE", "description": "Amends the Change of Name Article of the Code of Civil Procedure. Provides that the requirement to publish a notice in the newspaper of a change of name for 3 consecutive weeks after filing is not required for any person who applies for a change of name to change the person's name to conform with the person's gender identity."}, "5785": {"bill_id": 1628051, "number": "HB5786", "change_hash": "e2afe453c0c224a1db525f68c221e9f2", "url": "https://legiscan.com/IL/bill/HB5786/2021", "status_date": "2022-08-11", "status": 1, "last_action_date": "2022-11-16", "last_action": "Referred to Rules Committee", "title": "INVEST IN KIDS-DISCRIMINATION", "description": "Amends the Invest in Kids Act. Provides that a scholarship granting organization shall refrain from discrimination based on actual, perceived, or identified gender identity or sexuality when awarding scholarships. Effective immediately."}, "7724": {"bill_id": 1463889, "number": "SB0647", "change_hash": "baf70e892b03f34e5ba77f6df139e347", "url": "https://legiscan.com/IL/bill/SB0647/2021", "status_date": "2021-02-24", "status": 1, "last_action_date": "2021-04-21", "last_action": "Added as Co-Sponsor Sen. Laura Ellman", "title": "SCH CD-HEALTH ED/SEX ABUSE", "description": "Amends the School Code. Makes changes to the provisions of the Code relating to policies addressing sexual abuse. In the Courses of Study Article, repeals the sex education, family life, and instruction on diseases provisions. Instead, creates an age-appropriate comprehensive sex education program that shall be taught to students enrolled in kindergarten through 12th grade. Provides that the sex education curricula shall, among other provisions, provide information regarding sexual health, consent, personal safety, pregnancy, and sexually transmitted diseases. Provides that the instruction, among other provisions, shall incorporate discussion about diversity in cultures, families, gender identity, economic status, and the roles that these factors play in the development of sexual health and human relationships. Contains provisions that allow a parent or guardian to excuse his or her child from receiving the instruction. Provides for the formation of a committee to assist in the implementation of these provisions. Makes changes in the Chicago School District Article concerning AIDS training. Effective immediately."}, "8482": {"bill_id": 1466279, "number": "SB1405", "change_hash": "678590d5f6270835e7355e3dd8e0621f", "url": "https://legiscan.com/IL/bill/SB1405/2021", "status_date": "2022-05-27", "status": 4, "last_action_date": "2022-05-27", "last_action": "Public Act . . . . . . . . . 102-0989", "title": "MEDICAL PATIENT RTS-VISITATION", "description": "Reinserts the provisions of the engrossed bill with the following changes. Authorizes a skilled nursing home, extended care facility, or intermediate care facility to prohibit an individual from visiting a resident or patient of the nursing home or facility if specific facts demonstrate that the individual would endanger his or her physical health or safety or the health or safety of a resident, patient, or health care worker of the nursing home or facility. Requires such a denial to be in writing and provided to the individual and the resident or patient with whom the individual was denied visitation. Requires each skilled nursing home, extended care facility, and intermediate care facility to inform each resident of the nursing home or facility (or that individual's representative) of the resident's visitation rights and the facility's visitation-related policies and procedures. Specifies that these nursing homes and facilities must not restrict, limit, or otherwise deny visitation privileges on the basis of race, color, national origin, religion, sex, gender identity, sexual orientation, or disability. Requires the nursing homes and facilities to ensure that all visitors enjoy full and equal visitation privileges, consistent with the residents' preferences."}, "8807": {"bill_id": 1466919, "number": "SB1730", "change_hash": "010f74fcac3386b4c6de93a3a84158c0", "url": "https://legiscan.com/IL/bill/SB1730/2021", "status_date": "2021-07-30", "status": 4, "last_action_date": "2021-07-30", "last_action": "Public Act . . . . . . . . . 102-0223", "title": "CORPORATIONS LGBTQ DIRECTORS", "description": "Amends the Business Corporation Act of 1983. Provides that public corporations must report the self-identified sexual orientation and self-identified gender identity of its directors. Effective January 1, 2022."}, "9210": {"bill_id": 1467929, "number": "SB2133", "change_hash": "f2017acc2204c0b65d9ca55a532b7f84", "url": "https://legiscan.com/IL/bill/SB2133/2021", "status_date": "2021-08-20", "status": 4, "last_action_date": "2021-08-20", "last_action": "Public Act . . . . . . . . . 102-0543", "title": "DEMOGRAPHIC DATA-COVID-19", "description": "If and only if House Bill 2170 of the 101st General Assembly becomes law, amends the Data Governance and Organization to Support Equity and Racial Justice Act to include, in addition to race and ethnicity, the demographic categories of age, sex, disability status, sexual orientation, and gender identity to the categories of data that must be reported. Amends the University of Illinois Hospital Act and the Hospital Licensing Act to require a hospital to report to the Department of Public Health certain demographic data for individuals who have the symptoms of or a potential exposure to COVID-19 and are released from and not admitted to the hospital and individuals who were tested for COVID-19, who were admitted into the hospital for COVID-19, or who have received a vaccination for COVID-19. Varied effective date."}, "11322": {"bill_id": 1633991, "number": "SB4245", "change_hash": "879d6cab5545d5c8fea7dac4a321d6a9", "url": "https://legiscan.com/IL/bill/SB4245/2021", "status_date": "2022-11-22", "status": 1, "last_action_date": "2022-12-14", "last_action": "Added as Chief Co-Sponsor Sen. Cristina H. Pacione-Zayas", "title": "GENDER-AFFIRMING HEALTH CARE", "description": "Creates the Gender-Affirming Health Care Protection Act. Restricts the State from: (1) applying a law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care; (2) enforcing or satisfying a civil judgment received under a law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care; or (3) aiding or intentionally participating in a criminal investigation, arrest, search, or detention of an individual pursuant to a criminal law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Prohibits a law enforcement officer from knowingly participating in the arrest of an individual pursuant to an out-of-state arrest warrant issued solely on the basis of the individual providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Amends the Uniform Criminal Extradition Act. Prohibits the Governor from complying with a demand of another state to surrender an individual for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Amends the Code of Civil Procedure. Restricts a subpoena from being issued if the subpoena is based on a violation of another state's laws that interfere with a person's right to allow a child to receive gender-affirming care. Restricts a person or entity from releasing medical information based on another state's laws that authorizes a person to bring a civil action against a person or entity that allows a child to receive gender-affirming care. Makes conforming changes in the Uniform Interstate Depositions and Discovery Act. Effective June 1, 2023."}}