{"session": {"session_id": 2020, "state_id": 13, "year_start": 2023, "year_end": 2024, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023-2024 Regular Session", "session_name": "103rd General Assembly"}, "2202": {"bill_id": 1698654, "number": "HB2203", "change_hash": "446e4994f868a77177d3665dec73b9ec", "url": "https://legiscan.com/IL/bill/HB2203/2023", "status_date": "2023-02-07", "status": 1, "last_action_date": "2023-03-23", "last_action": "Removed Co-Sponsor Rep. Debbie Meyers-Martin", "title": "INS-MOTOR VEHICLE RATES", "description": "Amends the Illinois Insurance Code. Provides that the amendatory Act may be referred to as the Motor Vehicle Insurance Fairness Act. Provides that no insurer or insurance company group shall refuse to issue or renew a private passenger motor vehicle liability policy based in whole or in part on specified prohibited underwriting or rating factors. Sets forth factors that are prohibited with respect to automobile liability insurance underwriting and rating. Provides that every insurer or insurance company group selling automobile liability insurance in the State shall demonstrate that its marketing, underwriting, rating, claims handling, fraud investigations, and any algorithm or model used for those business practices do not disparately impact any group of customers based on race, color, national or ethnic origin, religion, sex, sexual orientation, disability, gender identity, or gender expression. Provides that no rate shall be approved or remain in effect that is excessive, inadequate, unfairly discriminatory, or otherwise in violation of the provisions. Provides that every insurer that desires to change any rate shall file a complete rate application with the Director of Insurance. Provides that all information provided to the Director under the provisions shall be available for public inspection. Provides that any person may initiate or intervene in any proceeding permitted or established under the provisions and challenge any action of the Director under the provisions. Provides that the Department of Insurance shall adopt rules. Provides that all insurers subject to the provisions shall be assessed a fee of 0.05% of their total earned premium from the prior calendar year, and that the fee shall be payable to the Department no later than July 1 of each calendar year and shall be used by the Department to implement the provisions."}, "2219": {"bill_id": 1699367, "number": "HB2220", "change_hash": "2d33b5472e9ebde8bb716ef1dfab3d8f", "url": "https://legiscan.com/IL/bill/HB2220/2023", "status_date": "2023-03-24", "status": 2, "last_action_date": "2023-03-27", "last_action": "Referred to Assignments", "title": "INNKEEPER PROTECTION", "description": "Amends the Innkeeper Protection Act. Provides that a proprietor or manager of a hotel may remove or cause to be removed from a hotel or refuse to admit or refuse service or accommodations to a guest or other person who violates specified provisions. Provides that if the guest has paid in advance, the innkeeper shall tender to the guest any unused portion of the advance payment at the time of removal. Provides that the amendatory provisions shall not be used as a pretext to discriminate against a guest on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, disability, age, or country of ancestral origin. Effective immediately."}, "2431": {"bill_id": 1707292, "number": "HB2432", "change_hash": "9bfb094c4d43a70efc380b12d3fd2d66", "url": "https://legiscan.com/IL/bill/HB2432/2023", "status_date": "2023-02-14", "status": 1, "last_action_date": "2023-02-15", "last_action": "Referred to Rules Committee", "title": "INVEST IN KIDS-DISCRIMINATION", "description": "Amends the Invest in Kids Act. Provides that a scholarship granting organization shall refrain from discrimination based on actual, perceived, or identified gender identity or sexuality when awarding scholarships. Effective immediately."}, "3070": {"bill_id": 1711528, "number": "HB3071", "change_hash": "922cc27fb193c2ae93bbf6b34c4e8fa4", "url": "https://legiscan.com/IL/bill/HB3071/2023", "status_date": "2023-03-24", "status": 2, "last_action_date": "2023-03-27", "last_action": "Referred to Assignments", "title": "EDUC/SCH CD-VARIOUS", "description": "Amends the Data Governance and Organization to Support Equity and Racial Justice Act. Provides that the State Board of Education is not required to collect and report personally identifiable information on the categories of sex, sexual orientation, and gender identity unless required for federal reporting. Amends the School Code. Makes changes regarding school district standards, recognition levels and annual summative designations, rewards, priority and focus districts, including changing the terminology to Targeted, Comprehensive, and Intensive schools, State interventions, and an Independent Authority. In provisions regarding isolated time out, time out, and physical restraint, changes certain references concerning schools and school districts to entities; defines \"entities\". In various provisions regarding allergens, replaces references to the \"Illinois Food Allergy Emergency Action Plan and Treatment Authorization Form\" with \"allergy emergency action plan\". Makes changes concerning a direct support professional training program, residential placement in nonpublic special education facilities, evidence-based funding, parenting education, and charter schools, including removing references to the State Charter School Commission. Repeals provisions concerning visiting charitable institutions, 2 years as a priority school, a Lincoln's ChalleNGe Academy study, and the Committee of Cooperative Services. Amends the Educational Opportunity for Military Children Act. Provides for additional members on the State Council. Amends the School Safety Drill Act. Makes changes concerning definitions, reporting, and a threat assessment procedure. Makes other changes. Effective immediately."}, "3138": {"bill_id": 1711767, "number": "HB3139", "change_hash": "16468c8392aa58e62dba180102e09302", "url": "https://legiscan.com/IL/bill/HB3139/2023", "status_date": "2023-02-16", "status": 1, "last_action_date": "2023-03-20", "last_action": "Added Co-Sponsor Rep. Aaron M. Ortiz", "title": "NOT FOR PROFIT-DEMOGRAPHICS", "description": "Amends the General Not For Profit Corporation Act of 1986. Provides that in its annual report filed with the Secretary of State, a domestic or foreign corporation shall include the aggregated demographic information of its directors and officers, including race, ethnicity, gender, disability status, veteran status, sexual orientation, and gender identity. Provides that no later than 30 calendar days after filing the annual report with the Secretary of State, a corporation shall post to the corporation's publicly available website, if one exists, the aggregated demographic information of the corporation's directors and officers. Effective January 1, 2024."}, "3367": {"bill_id": 1713119, "number": "HB3368", "change_hash": "b6120249d5f0a73fe4e6eab202d13258", "url": "https://legiscan.com/IL/bill/HB3368/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-03-10", "last_action": "Rule 19(a) / Re-referred to Rules Committee", "title": "INC TX-REPRODUCTIVE CARE", "description": "Amends the Illinois Income Tax Act. Creates an income tax credit for each individual taxpayer who (i) is a healthcare provider who, for the purpose of providing reproductive care or gender-affirming care in this State, permanently relocates during the taxable year to this State from a State with more restrictive abortion laws or more restrictive laws concerning access to gender-affirming care or (ii) is a patient or the parent or guardian of a patient who, for the purpose of receiving reproductive care or gender-affirming care in this State, permanently relocates during the taxable year to this State from a State with more restrictive abortion laws or more restrictive laws concerning the access to gender-affirming care. Provides that the credit is in the amount of $500. Effective immediately."}, "4337": {"bill_id": 1678348, "number": "SB0098", "change_hash": "43246cbf88a87c1cebc20bd68630a7f2", "url": "https://legiscan.com/IL/bill/SB0098/2023", "status_date": "2023-01-24", "status": 1, "last_action_date": "2023-01-24", "last_action": "Referred to Assignments", "title": "SCH CD-SCH BD-LGBTQ+ TRAINING", "description": "Amends the School Code. Provides that beginning with the 2024-2025 school year, LGBTQ+ inclusivity training shall be required as part of the professional development leadership training for school board members. Provides that the training regarding LGBTQ+ inclusivity practices must include information that is relevant to and within the scope of the duties of a school board member. Provides that such information may include, but is not limited to: (1) understanding the difference between sex, gender, and sexual orientation; (2) knowledge of family structures beyond the heteronormative structure; (3) nondiscriminatory education on the basis of gender, gender identity, gender expression, sexual orientation, and sexual behavior; (4) understanding the struggles of LGBTQ+ youth in schools; (5) the contributions of LGBTQ+ individuals regarding history, social sciences, arts, and humanities; and (6) the effects and risks of outing a student's gender identity or sexual orientation to the student's parents."}, "5522": {"bill_id": 1695099, "number": "SB1283", "change_hash": "dbd89c3f7ee1122a89f0e76ca405efb7", "url": "https://legiscan.com/IL/bill/SB1283/2023", "status_date": "2023-02-03", "status": 1, "last_action_date": "2023-02-03", "last_action": "Referred to Assignments", "title": "GENDER-AFFIRMING HEALTH CARE", "description": "Creates the Gender-Affirming Health Care Protection Act. Restricts the State from: (1) applying a law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care; (2) enforcing or satisfying a civil judgment received under a law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care; or (3) aiding or intentionally participating in a criminal investigation, arrest, search, or detention of an individual pursuant to a criminal law of another state that authorizes civil or criminal penalties against any person for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Prohibits a law enforcement officer from knowingly participating in the arrest of an individual pursuant to an out-of-state arrest warrant issued solely on the basis of the individual providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Amends the Uniform Criminal Extradition Act. Prohibits the Governor from complying with a demand of another state to surrender an individual for providing, authorizing, aiding, assisting, receiving, or otherwise allowing a child to receive gender-affirming care or referring a child for such care. Amends the Code of Civil Procedure. Restricts a subpoena from being issued if the subpoena is based on a violation of another state's laws that interfere with a person's right to allow a child to receive gender-affirming care. Restricts a person or entity from releasing medical information based on another state's laws that authorizes a person to bring a civil action against a person or entity that allows a child to receive gender-affirming care. Makes conforming changes in the Uniform Interstate Depositions and Discovery Act."}, "6591": {"bill_id": 1703601, "number": "SB2352", "change_hash": "c399b50661491d6c1fcf086a4fa20d95", "url": "https://legiscan.com/IL/bill/SB2352/2023", "status_date": "2023-02-10", "status": 1, "last_action_date": "2023-03-10", "last_action": "Rule 3-9(a) / Re-referred to Assignments", "title": "PROCUREMENT-PROHIBITED SOURCES", "description": "Amends the Illinois Procurement Code. Provides that the government shall not contract for public goods or services with any prohibited source. Provides that prohibited sources are businesses that discriminate against employees or customers on the basis of a person's actual or perceived race, color, creed, religion, ancestry, gender, marital status, sexual orientation, gender identity or expression, physical or mental disability, national origin or age. Provides that any contract entered into, amended, or renewed by a State agency shall include a consistent binding agreement. Provides that any anti-discrimination provisions referenced shall not be affected by unduly narrow federal executive branch interpretations of existing federal statutory anti-discrimination protections."}}