{"session": {"session_id": 1832, "state_id": 9, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2021 1st Special Session", "session_name": "2021 First Special Session"}, "0": {"bill_id": 1509413, "number": "H0001", "change_hash": "28cd13ebc83efe4d2547e0c1f42e438c", "url": "https://legiscan.com/FL/bill/H0001/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-19", "last_action": "1st Reading (Committee Substitute 2)", "title": "Implementation of the 2021 Gaming Compact between the Seminole Tribe of Florida and the State of Florida", "description": "Provides for legislative approval & ratification of gaming compact; requires Governor to cooperate with Tribe in seeking approval & ratification of compact from U.S. Secretary of Interior; specifies compact supersedes certain other compact; revises local government share distributions; authorizes Tribe to conduct additional games, contests, & betting; provides age requirements for fantasy sports contests & sports betting; specifies certain games & gaming activities do not violate state law; revises requirements for Secretary of State relating to compact; provides conditions, requirements, & prohibitions relating to poker games played in designated player manner; prohibits person licensed to operate cardroom from operating certain games."}, "1": {"bill_id": 1509421, "number": "H0003", "change_hash": "8d012357699d9cf294cdf91b780e36b1", "url": "https://legiscan.com/FL/bill/H0003/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-19", "last_action": "1st Reading (Committee Substitute 1)", "title": "Gaming Enforcement", "description": "Authorizes Office of Statewide Prosecution to investigate & prosecute certain crimes; creates Florida Gaming Control Commission & Division of Gaming Enforcement; provides powers & duties of division director & investigators; requires background screenings; requires reports to Governor & Legislature; provides requirements & prohibitions for commissioners & employees; requires COE to investigate alleged violations of standards of conduct; prohibits certain persons from placing wagers in licensed facility; provides civil penalties; provides ex parte communication requirements; transfers certain powers, duties, & funds of DBPR to commission; transfers Pari-mutuel Wagering Trust Fund to commission; provides directive to DOLR; provides appropriation; requires DBPR to provide administrative support for commission & establish working group."}, "2": {"bill_id": 1509412, "number": "H0005", "change_hash": "2d4e451d7769c313a2f41e2b1bdd455a", "url": "https://legiscan.com/FL/bill/H0005/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-19", "last_action": "Laid on Table; companion bill(s) passed, see SB 6-A (Ch. 2021-270), CS/SB 4-A (Ch. 2021-269)", "title": "Pub. Records and Meetings/Florida Gaming Control Commission", "description": "Specifies that any exempt or confidential & exempt information obtained by Florida Gaming Control Commission retains its exempt or confidential & exempt status; provides exemption from public meetings requirements for portions of meetings of commission wherein exempt or confidential & exempt information is discussed, provided certain requirements are met; provides exemption from public records requirements for recordings, minutes, & records generated during such exempt portions of meetings; provides for future review & repeal of exemption; provides statement of public necessity."}, "3": {"bill_id": 1509414, "number": "H0007", "change_hash": "8d486d1293af326d89a966e5dc2f8862", "url": "https://legiscan.com/FL/bill/H0007/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-19", "last_action": "1st Reading (Committee Substitute 2)", "title": "Gaming", "description": "Revises provisions relating to pari-mutuel wagering, slot machines, & gambling; prohibits greyhound racing or dogracing; revises specified criminal penalties."}, "4": {"bill_id": 1509420, "number": "H0009", "change_hash": "f1548c0206e915045a3ffb28b89493fa", "url": "https://legiscan.com/FL/bill/H0009/2021/X1", "status_date": "2021-05-22", "status": 6, "last_action_date": "2021-05-22", "last_action": "Died in Select Committee on Gaming", "title": "Fantasy Sports Contests", "description": "Cites act as \"Fantasy Sports Contest Act\"; provides for enforcement & administration of act; authorizes Division of Pari-mutuel Wagering within DBPR to take certain actions; provides application requirements for fantasy sports contest operator licenses; requires contest operator to implement specified consumer protection procedures under certain circumstances & keep & maintain certain records for specified period; provides civil penalty; includes regulation of fantasy sports contests in type two transfer occurring on certain date."}, "5": {"bill_id": 1509418, "number": "H0011", "change_hash": "52da1c797388cb2c5ff54f7e407496c0", "url": "https://legiscan.com/FL/bill/H0011/2021/X1", "status_date": "2021-05-22", "status": 6, "last_action_date": "2021-05-22", "last_action": "Died in Select Committee on Gaming", "title": "Fees/Fantasy Contest Operators", "description": "Requires applicants for fantasy contest operator license to pay application fee to Division of Pari-mutuel Wagering within DBPR; requires contest operators to pay annual license renewal fee to division; prohibits such fees from exceeding specified amount; requires contest operators to remit certain fees to division; specifies that costs for certain fingerprint processing and retention shall be borne by applicants; authorizes division to charge handling fee relating to fingerprint processing; requires certain fees to be deposited into Pari-mutuel Wagering Trust Fund."}, "6": {"bill_id": 1509419, "number": "S0002", "change_hash": "81622f180454c6ba6458b56a9cd5cee1", "url": "https://legiscan.com/FL/bill/S0002/2021/X1", "status_date": "2021-07-08", "status": 4, "last_action_date": "2021-07-08", "last_action": "Chapter No. 2021-268, companion bill(s) passed, see CS/SB 4-A (Ch. 2021-269), CS/SB 8-A (Ch. 2021-271)", "title": "Implementation of the 2021 Gaming Compact Between the Seminole Tribe of Florida and the State of Florida", "description": "Providing for legislative approval and ratification of a gaming compact between the Seminole Tribe of Florida and the state; requiring the Governor to cooperate with the Tribe in seeking approval and ratification of such compact from the United States Secretary of the Interior; authorizing the Tribe to conduct additional games, contests, and sports betting; providing age requirements for fantasy sports contests and sports betting; providing conditions, requirements, and prohibitions relating to poker games played in a designated player manner, etc."}, "8": {"bill_id": 1509415, "number": "S0006", "change_hash": "231a38d054229dac432a8a1eabc33e13", "url": "https://legiscan.com/FL/bill/S0006/2021/X1", "status_date": "2021-07-08", "status": 4, "last_action_date": "2021-07-08", "last_action": "Chapter No. 2021-270, companion bill(s) passed, see CS/SB 4-A (Ch. 2021-269)", "title": "Public Records and Public Meetings/Florida Gaming Control Commission", "description": "Specifying that any exempt or confidential and exempt information obtained by the Florida Gaming Control Commission retains its exempt or confidential and exempt status; providing an exemption from public meetings requirements for portions of meetings of the commission wherein exempt or confidential and exempt information is discussed, provided certain requirements are met; providing for the future review and repeal of the exemption; providing a statement of public necessity, etc."}, "10": {"bill_id": 1509417, "number": "S0010", "change_hash": "d50d313400c926586e5a564c9f846969", "url": "https://legiscan.com/FL/bill/S0010/2021/X1", "status_date": "2021-05-21", "status": 6, "last_action_date": "2021-05-21", "last_action": "Died in Appropriations, companion bill(s) passed, see CS/SB 2-A (Ch. 2021-268), CS/SB 4-A (Ch. 2021-269)", "title": "Bingo", "description": "Requiring applicants for an operating license to include dates the applicant intends to conduct bingo games or instant bingo; specifying that it is not a crime for a person to participate in bingo games or instant bingo under certain circumstances; authorizing bingo operators to charge fees for players participating in bingo games; authorizing a bingo operator to refuse entry to certain persons or refuse to allow certain persons to play bingo under certain circumstances; specifying that certain activities relating to bingo games and instant bingo are not subject to certain gambling-related prohibitions, etc."}, "11": {"bill_id": 1509409, "number": "S0012", "change_hash": "c67b0b59812be9e2231b5bebbf01c211", "url": "https://legiscan.com/FL/bill/S0012/2021/X1", "status_date": "2021-05-21", "status": 6, "last_action_date": "2021-05-21", "last_action": "Died in Appropriations", "title": "Taxes/Bingo Operators", "description": "Requiring bingo operators to pay a specified tax relating to monthly gross receipts; providing requirements for the tax payments; requiring bingo operators to file monthly reports containing specified information; providing civil and administrative penalties for failing to make the required tax payments; providing requirements for certain funds deposited into the Pari-mutuel Wagering Trust Fund, etc."}, "12": {"bill_id": 1509410, "number": "S0014", "change_hash": "be7f52592856e7f5954b0bf9815f08d3", "url": "https://legiscan.com/FL/bill/S0014/2021/X1", "status_date": "2021-05-21", "status": 6, "last_action_date": "2021-05-21", "last_action": "Died in Appropriations", "title": "Fees/Bingo Licenses", "description": "Revising the Division of Pari-mutuel Wagering's authorizations relating to bingo games and instant bingo to include authorizations relating to fees; establishing an annual fee for a bingo license; setting limits on the amount that may be charged for bingo employee occupational license fees and bingo business occupational license fees; requiring such fees to be deposited into the Pari-mutuel Wagering Trust Fund, etc."}, "13": {"bill_id": 1509416, "number": "S0016", "change_hash": "c247b5d0ddfdea51a5f79636a2ed8b93", "url": "https://legiscan.com/FL/bill/S0016/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-21", "last_action": "Died on Calendar, companion bill(s) passed, see CS/SB 2-A (Ch. 2021-268), CS/SB 4-A (Ch. 2021-269)", "title": "Fantasy Sports Contest Amusement Act", "description": "Creating the \"Fantasy Sports Contest Amusement Act\"; providing for the enforcement and administration of the Fantasy Sports Contest Amusement Act; requiring the Division of Pari-mutuel Wagering to revoke a contest operator's license under certain circumstances; providing that specified persons or entities are not eligible for licensure under certain circumstances; requiring a contest operator to implement specified consumer protection procedures under certain circumstances; requiring a contest operator to use data sources that meet specified requirements, etc."}, "14": {"bill_id": 1509422, "number": "S0018", "change_hash": "e39f37b561480b167c534b4bb708d449", "url": "https://legiscan.com/FL/bill/S0018/2021/X1", "status_date": "2021-05-14", "status": 1, "last_action_date": "2021-05-21", "last_action": "Died on Calendar", "title": "Fees/Fantasy Contest Operator License", "description": "Requiring applicants for a fantasy contest operator license to pay a specified application fee; requiring contest operators to pay a specified annual license renewal fee; prohibiting such fees from exceeding a specified amount; requiring contest operators to remit certain fees; specifying that the costs for certain fingerprint processing and retention shall be borne by applicants; authorizing the Division of Pari-mutuel Wagering within the Department of Business and Professional Regulation to charge a specified handling fee related to fingerprint processing, etc."}}