{"session": {"session_id": 1917, "state_id": 9, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "2nd Special Session", "session_title": "2021 2nd Special Session", "session_name": "2021 Second Special Session"}, "0": {"bill_id": 1532702, "number": "H0001", "change_hash": "3a6e9567f18333e34267b11dfa27506a", "url": "https://legiscan.com/FL/bill/H0001/2021/X2", "status_date": "2021-11-19", "status": 4, "last_action_date": "2021-11-19", "last_action": "Chapter No. 2021-272; companion bill(s) passed, see CS/HB 3B (Ch. 2021-273)", "title": "COVID-19 Mandates", "description": "Prohibits private employers from imposing COVID-19 vaccination mandate for certain employees; requires employer to exempt certain employee from vaccination; authorizes employee who is terminated to file complaint with DLA; requires AG to impose administrative fine for violations; specifies eligibility for reemployment assistance for unlawfully terminated employee; prohibits educational institutions & elected or appointed local officials from imposing COVID-19 vaccination mandates on students; provides right of action to obtain declaratory judgment & injunctive relief for violations; prohibits educational institutions & governmental entities from imposing COVID-19 vaccination mandates for employees; declares null & void any ordinance, rule, or policy that imposes mandates; specifies eligibility for reemployment assistance for unlawfully terminated employee; prohibits mandating facial coverings or restricting certain activities for students based on quarantine policies; provides parents may allow their children to wear facial coverings; prohibits district school boards, district school superintendents, & elected or appointed local officials from prohibiting employees from returning to work or subjecting employees to restrictions or disparate treatment."}, "1": {"bill_id": 1532695, "number": "H0003", "change_hash": "6ba791f39a00f9c398d525550142f486", "url": "https://legiscan.com/FL/bill/H0003/2021/X2", "status_date": "2021-11-19", "status": 4, "last_action_date": "2021-11-19", "last_action": "Chapter No. 2021-273; companion bill(s) passed, see HB 1B (Ch. 2021-272)", "title": "Pub. Rec./COVID-19 Vaccination Policies and Practices", "description": "Provides exemption from public records requirements for employee complaints alleging private employer&#39;s violation of state law regarding employer COVID-19 vaccination policies or practices & all information held by DLA pursuant to active investigation of such complaints; defines \"active\"; specifies information that remains confidential & exempt after investigation is completed or ceases to be active; authorizes release of confidential & exempt information to governmental entities for specified purpose; provides for future repeal of exemption; provides statement of public necessity."}, "2": {"bill_id": 1532696, "number": "H0005", "change_hash": "39464ecdc18716d7fe1d9784243d7e8c", "url": "https://legiscan.com/FL/bill/H0005/2021/X2", "status_date": "2021-11-19", "status": 4, "last_action_date": "2021-11-19", "last_action": "Chapter No. 2021-274", "title": "Florida Occupational Safety and Health State Plan", "description": "Requires EOG to develop proposal for state plan to assert state jurisdiction over occupational safety & health issues for government & private employees; requires office to designate or hire necessary staff to develop proposal; requires Division of Risk Management & Division of Workers&#39; Compensation within DFS, DOH, & DBPR to assist office with development of proposal upon request; requires office to submit status report to Legislature by specified date; requires that status report contain specified information; provides appropriation."}, "3": {"bill_id": 1532700, "number": "H0007", "change_hash": "f7b8e804fb051c9ddbe6aee74351bc2e", "url": "https://legiscan.com/FL/bill/H0007/2021/X2", "status_date": "2021-11-19", "status": 4, "last_action_date": "2021-11-19", "last_action": "Chapter No. 2021-275", "title": "Vaccinations During Public Health Emergencies", "description": "Removes authority of State Health Officer to order vaccination of individuals upon declaration of public health emergency; revises requirement that DOH adopt certain rules."}, "5": {"bill_id": 1532697, "number": "S0004", "change_hash": "2eaa78747676cf1bb0a8d1dd5a30de77", "url": "https://legiscan.com/FL/bill/S0004/2021/X2", "status_date": "2021-11-08", "status": 1, "last_action_date": "2021-11-17", "last_action": "Laid on Table, companion bill(s) passed, see CS/HB 3-B (Ch. 2021-273), HB 1-B (Ch. 2021-272)", "title": "Public Records/Employer COVID-19 Vaccination Policies", "description": "Providing an exemption from public records requirements for employee complaints alleging a private employer's violation of state law regarding employer COVID-19 vaccination policies or practices and all information held by the Department of Legal Affairs pursuant to an active investigation of such complaints; specifying information that remains confidential and exempt after an investigation is completed or ceases to be active; providing for future repeal of the exemption; providing a statement of public necessity, etc."}}