{"session": {"session_id": 2042, "state_id": 9, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2022 1st Special Session", "session_name": "2022 First Special Session"}, "0": {"bill_id": 1637974, "number": "H0001", "change_hash": "ee4e8af62c9c0ae5df8d9e5da09479e3", "url": "https://legiscan.com/FL/bill/H0001/2022/X1", "status_date": "2022-12-09", "status": 1, "last_action_date": "2022-12-14", "last_action": "Laid on Table; companion bill(s) passed, see SB 2-A (Ch. 2022-271)", "title": "Property Insurance", "description": "Creates Florida Optional Reinsurance Assistance program (FORA); authorizes eligible insurers to purchase reinsurance coverage under FORA; requires board to provide specified coverage layers; specifies requirements & procedures for appropriation of funds from General Revenue Fund to provide reimbursements under FORA; removes right to attorney fees for judgments or decrees against surplus lines insurers in suits arising under residential or commercial property insurance policies; revises eligibility requirements for renewing coverage with Citizens Property Insurance Corporation for personal lines residential & commercial lines residential risks; specifies burden of proof for corporation policyholders making claims for water damage; specifies conditions that must be met for property insurance policy to require mandatory binding arbitration; removes right to attorney fees payable by insurers in alternative procedure for resolution of disputed sinkhole insurance claims; prohibits policyholders from assigning post-loss insurance benefits under residential or commercial property insurance policies; provides appropriation."}, "1": {"bill_id": 1637977, "number": "H0003", "change_hash": "8d609ed9ea14ecb7fe5820a28866e152", "url": "https://legiscan.com/FL/bill/H0003/2022/X1", "status_date": "2022-12-09", "status": 1, "last_action_date": "2022-12-14", "last_action": "Laid on Table; companion bill(s) passed, see SB 4-A (Ch. 2022-272)", "title": "Disaster Relief", "description": "Authorizes DEP to waive or reduce match requirements for certain local governments; authorizes refund of certain ad valorem taxes; provides procedures & requirements to receive refund; provides requirements for property appraisers & tax collectors; provides for extension & suspension of payments & discounts of certain taxes & assessments; provides duties of Division of Emergency Management; provides for organization & operation of Florida Emergency Management Assistance Foundation; authorizes Department of Revenue to adopt emergency rules; provides duties of Florida Housing Finance Corporation; creates Hurricane Restoration Reimbursement Grant Program within DEP; creates Hurricane Stormwater & Wastewater Assistance Grant Program within DEP."}, "2": {"bill_id": 1637976, "number": "H0005", "change_hash": "d4a2a7ae66c6cbf151269c8f3f4658e2", "url": "https://legiscan.com/FL/bill/H0005/2022/X1", "status_date": "2022-12-09", "status": 1, "last_action_date": "2022-12-14", "last_action": "Laid on Table; companion bill(s) passed, see SB 6-A (Ch. 2022-270)", "title": "Toll Relief", "description": "Requires Florida Turnpike Enterprise to establish toll relief program; specifies requirements for eligibility for account credits under program; appropriating funds for DOT to reimburse specified entities for account credits issued under program; provides powers & duties of department related to the program; provides for reversion of unexpended funds."}, "3": {"bill_id": 1637978, "number": "H0007", "change_hash": "54a97b2abda7a0e65f86c61510b2fe6a", "url": "https://legiscan.com/FL/bill/H0007/2022/X1", "status_date": "2022-12-10", "status": 1, "last_action_date": "2022-12-12", "last_action": "Withdrawn prior to introduction", "title": "Hurricane Property Insurance Claim Mediation", "description": "Establishing Hurricane Property Insurance Claim Alternate Dispute Resolution Program; providing requirements for program participation & Office of Insurance Regulation."}, "4": {"bill_id": 1638254, "number": "H0009", "change_hash": "1912b1f1519566369e397ea5357a78c8", "url": "https://legiscan.com/FL/bill/H0009/2022/X1", "status_date": "2022-12-11", "status": 1, "last_action_date": "2022-12-16", "last_action": "Died, introduction refused", "title": "Insurance", "description": "Creates Property Insurance Commission; provides for election of Commissioner of Insurance Regulation; revises homeowners&#39; eligibility criteria for mitigation grants; requires interests earned on insurance proceeds received by mortgagees & assignees to be paid to insureds; prohibits property insurers from claiming insolvency under certain circumstances; authorizes persons that engage in property insurance activities in other states to engage in insurance activities in this state only under certain circumstances; requires property insurers to cap premiums or to create sliding fee scales for premium rates; prohibits property insurers from using certain defenses as claims denials; revises requirements for risk assignment agreements; provides duties of OIR; requires DFS to adopt rules regarding allegations of insurance fraud; requires OPPAGA to conduct study of effectiveness of property insurance mediation program; increases appropriation to specified program."}, "5": {"bill_id": 1638255, "number": "H0011", "change_hash": "68807f8377d253a89435371ea93657e4", "url": "https://legiscan.com/FL/bill/H0011/2022/X1", "status_date": "2022-12-16", "status": 6, "last_action_date": "2022-12-16", "last_action": "Died in Commerce Committee", "title": "Establishment of Federal Catastrophe Pool", "description": "Urges Congress to establish federal catastrophe pool."}}