{"session": {"session_id": 1987, "state_id": 9, "year_start": 2023, "year_end": 2023, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023 Regular Session", "session_name": "2023 Regular Session"}, "586": {"bill_id": 1722115, "number": "H1223", "change_hash": "dd55d484e5017b2a2f01ec4914b0facb", "url": "https://legiscan.com/FL/bill/H1223/2023", "status_date": "2023-02-28", "status": 1, "last_action_date": "2023-03-16", "last_action": "Now in Education & Employment Committee", "title": "Public PreK-12 Educational Institution and Instruction Requirements", "description": "Requires specified policies relating to person&#39;s sex at public K-12 educational institutions; prohibits specified actions relating to use of certain titles & pronouns; & revises requirements for instruction on sexual orientation & gender identity in public schools."}, "984": {"bill_id": 1667122, "number": "S0276", "change_hash": "31fecca6138c9c9c14ee1c9386db1f47", "url": "https://legiscan.com/FL/bill/S0276/2023", "status_date": "2023-01-18", "status": 1, "last_action_date": "2023-03-07", "last_action": "Introduced", "title": "Crimes Evidencing Prejudice", "description": "Expanding grounds for the reclassification of crimes to include acts of prejudice based on the gender or gender identity of any person; specifying that the reclassification must occur if the crime was based in whole or in part on the race, color, ancestry, ethnicity, religion, sexual orientation, national origin, homeless status, advanced age, gender, or gender identity of any person; specifying that the reclassification of a certain crime must occur if the crime was based in whole or in part on a disability of any person, etc."}, "1494": {"bill_id": 1723684, "number": "S1320", "change_hash": "2cf42ba029f716838952c2cfb770a956", "url": "https://legiscan.com/FL/bill/S1320/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-22", "last_action": "Now in Fiscal Policy", "title": "Child Protection in Public Schools", "description": "Defining the term \"sex\"; prohibiting an employee, contractor, or student of a public school from being required to refer to a person using personal titles or pronouns that do not correspond with that person's sex; prohibiting classroom instruction by school personnel on sexual orientation or gender identity until grade 9; providing that such prohibition applies to charter schools; providing that materials used to teach reproductive health or any disease as part of certain courses must be approved by the Department of Education; requiring district school boards to adopt and publish a specified process relating to student access to certain materials, etc."}}