{"session": {"session_id": 409, "state_id": 20, "year_start": 2011, "year_end": 2011, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2011 1st Special Session", "session_name": "2011 First Special Session"}, "0": {"bill_id": 416111, "number": "HB1", "change_hash": "9d6e8799af7b9c8ceabfcb584be603ec", "url": "https://legiscan.com/MD/bill/HB1/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Congressional Districting Plan", "description": "Establishing the composition of the eight districts in the State of Maryland for the election of members to the United States House of Representatives; specifying ward, election district, and precinct boundaries; and making the Act an emergency measure."}, "1": {"bill_id": 416094, "number": "HB2", "change_hash": "ef7eb4a333595fdeaf8a9abf9b792258", "url": "https://legiscan.com/MD/bill/HB2/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-18", "last_action": "Second Reading Passed", "title": "Montgomery County - Board of Education Residence Districts - Redistricting Plan", "description": "Altering the boundaries of the residence districts for the Montgomery County Board of Education; repealing a provision of law relating to the date when specified reapportioned districts become effective; and making the Act an emergency measure."}, "2": {"bill_id": 416077, "number": "HB3", "change_hash": "b4f934f32df55b029505665b31643212", "url": "https://legiscan.com/MD/bill/HB3/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-18", "last_action": "Second Reading Passed", "title": "Prince George's County School Board - Redistricting", "description": "Altering the boundaries of the school board districts for the election of the members of the Prince George's County Board of Education; and making the Act an emergency measure."}, "3": {"bill_id": 416061, "number": "HB4", "change_hash": "3694c984210d5b4c0c217c62b00b332a", "url": "https://legiscan.com/MD/bill/HB4/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Congressional Redistricting Plan of 2011", "description": "Establishing the composition of the eight districts in the State of Maryland for the election of members to the United States House of Representatives; specifying ward, election district, and precinct boundaries; and making the Act an emergency measure."}, "4": {"bill_id": 416045, "number": "HB5", "change_hash": "d14b17c6bf401ef3a0d35464f2662861", "url": "https://legiscan.com/MD/bill/HB5/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Congressional Redistricting Plan", "description": "Establishing the composition of the eight districts in the State of Maryland for the election of members to the United States House of Representatives; specifying ward, election district, and precinct boundaries; and making the Act an emergency measure."}, "5": {"bill_id": 416026, "number": "HB6", "change_hash": "b0c9d0561ad0e62034a44e3de13581b9", "url": "https://legiscan.com/MD/bill/HB6/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Environment - Watershed Implementation Plan - County Implementation", "description": "Providing that a local jurisdiction may not be required to implement activities or strategies of a State Watershed Implementation Plan unless specified funding is provided; and making the Act an emergency measure."}, "6": {"bill_id": 416011, "number": "HB7", "change_hash": "bffa6ea19286c0486eced0f2b51fbcae", "url": "https://legiscan.com/MD/bill/HB7/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Private Property Rights - Regulatory Infringement - Compensation", "description": "Giving an owner of private property a cause of action under specified circumstances against the Department of the Environment, the Department of Natural Resources, or the Department of Planning if the application of specified regulations infringes on a private property right; providing that the cause of action shall be filed in a specified court; providing for the sum that a private property owner may recover; etc."}, "7": {"bill_id": 415993, "number": "HB8", "change_hash": "fa9815b3c741a57323845f46510c48bc", "url": "https://legiscan.com/MD/bill/HB8/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Department of Planning - Local and Regional Planning and Land Use Powers -", "description": "Prohibiting the Department of Planning from adopting any regulation or taking any action that restricts the planning and land use powers of local governments or regional planning agencies; and making the Act an emergency measure."}, "8": {"bill_id": 415976, "number": "HB9", "change_hash": "56c7959cbc7799ebdc75bb8fd50cb379", "url": "https://legiscan.com/MD/bill/HB9/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Environment - County Plans - Authority", "description": "Repealing the authority of the Department of the Environment to order a person to prepare and submit specified subdivision plans under specified circumstances; repealing the Department's authority to order the installation of specified water supply or sewerage systems for subdivisions under specified circumstances; repealing a requirement that a specified county plan be approved by the Department; repealing a requirement that a county adopt a revision or amendment to a specified county plan under specified circumstances; etc."}, "9": {"bill_id": 415961, "number": "HB10", "change_hash": "964e022b54f9a1e1493f68d373d6eac7", "url": "https://legiscan.com/MD/bill/HB10/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Transportation - Toll, Fee, or Other Charge Increases - Notice and Public", "description": "Requiring specified staff of the Maryland Transportation Authority to provide, by a specified date, public notice regarding a proposal to increase specified tolls, fees, or other charges; requiring the Authority to make the proposal available to the public in a specified manner; requiring the Authority to receive comments from the public at the meeting at which the Authority votes to implement the proposal; and making the Act an emergency measure."}, "10": {"bill_id": 415943, "number": "HB11", "change_hash": "4f4887342c529880f30cb71bee4cbb9f", "url": "https://legiscan.com/MD/bill/HB11/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Maryland Transportation Authority - Termination - Exchange of Bonds", "description": "Terminating the Maryland Transportation Authority; transferring, subject to specified exceptions, all functions, powers, duties, responsibilities, regulations, policies, property, equipment, assets, liabilities, and employees of the Authority to the Maryland Department of Transportation on a specified date; requiring the State to issue revenue refunding bonds in exchange for revenue bonds issued by the Authority before a specified date; etc."}, "11": {"bill_id": 415927, "number": "HB12", "change_hash": "bf8547e3d0feac21f7527b9be1fdd5c1", "url": "https://legiscan.com/MD/bill/HB12/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Maryland Transportation Authority - Audit Statements Available Online", "description": "Requiring the Maryland Transportation Authority to make audit statements publicly available on its Internet site, including audit statements relating to each transportation facilities project throughout the entire existence of each transportation facilities project; and defining \"audit statement\"."}, "12": {"bill_id": 415911, "number": "HB13", "change_hash": "33f4ada8bc4cd1a23ce615370279b5fa", "url": "https://legiscan.com/MD/bill/HB13/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Laws Making an Appropriation Subject to Petition Referendum", "description": "Proposing an amendment to the Maryland Constitution to provide that a law making a specified appropriation shall be subject to rejection or repeal by the voters of the State under the petition referendum process provided under the Maryland Constitution; and submitting the amendment to the qualified voters of the State for their adoption or rejection."}, "13": {"bill_id": 415894, "number": "HB14", "change_hash": "f19bf3ba62dad43f0aeab74af838d99b", "url": "https://legiscan.com/MD/bill/HB14/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Department of Planning - State Development Plan - Approval or Modification by", "description": "Requiring the Secretary of Planning to submit the State Development Plan and any substantial part or revision of the Plan to the General Assembly; prohibiting the Plan from being finalized until it is approved by an Act of the General Assembly; authorizing the General Assembly to modify the Plan as submitted by the Secretary; requiring the Governor to file with the Secretary of State the Plan, part of the Plan, or a revision to the Plan, together with specified comments, after enactment of a law that approves or modifies the Plan; etc."}, "14": {"bill_id": 415876, "number": "HB15", "change_hash": "50570a16ad742e30c566112e7c0e4022", "url": "https://legiscan.com/MD/bill/HB15/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Maryland Transportation Authority - Fixing or Revising Tolls - Legislative", "description": "Prohibiting the Maryland Transportation Authority from fixing or revising a toll on any part of any transportation facilities project unless the General Assembly approves the toll through legislation; authorizing the Authority, on or after the effective date of the Act, to continue to charge and collect a toll of the same amount in effect before the effective date of the Act; and making the Act an emergency measure."}, "15": {"bill_id": 415860, "number": "HB16", "change_hash": "3a86abd0239e06a82695844553ea526c", "url": "https://legiscan.com/MD/bill/HB16/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Transportation - Chesapeake Bay Bridge Authority", "description": "Establishing the Chesapeake Bay Bridge Authority to finance, construct, operate, and maintain the Chesapeake Bay Bridge; providing for the members, appointment, terms, chair, and staff of the Authority; prohibiting the Department of Transportation from exercising jurisdiction or authority over the Chesapeake Bay Bridge; authorizing the Authority to take specified actions in the performance of its duties; etc."}, "16": {"bill_id": 415843, "number": "HB17", "change_hash": "6e011a51d10a00b5562602f1a6bf9e0c", "url": "https://legiscan.com/MD/bill/HB17/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Maryland Transit Administration - Farebox Recovery Rate Increase", "description": "Increasing from 35% to 50%, for fiscal year 2013 and thereafter, the percentage of operating costs for specified public transit services that the Maryland Transit Administration must recover from fares and other operating revenues; etc."}, "17": {"bill_id": 415826, "number": "HB18", "change_hash": "13d6b15b041329a7c7636e5b5ca50cf3", "url": "https://legiscan.com/MD/bill/HB18/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Transportation - Transit Authorities - Red Line and Purple Line", "description": "Establishing the Red Line Transit Authority and the Purple Line Transit Authority to finance, construct, and operate the Red Line and the Purple Line light rail transit lines; providing for the members, appointment, terms, chairs, and staff of the Authorities; prohibiting the Department of Transportation from exercising jurisdiction or authority over the Red Line and the Purple Line light rail transit lines; authorizing the Authorities to take specified actions in the performance of their duties; etc."}, "18": {"bill_id": 415810, "number": "HB19", "change_hash": "9049e0c5b26a68add146ab26bf3b444c", "url": "https://legiscan.com/MD/bill/HB19/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Maryland Transportation Authority - Intercounty Connector - Equitable Treatment", "description": "Requiring equitable treatment of toll rates on the Intercounty Connector in connection with any action by the Maryland Transportation Authority involving toll revenue affecting other transportation facilities projects owned or operated by the Authority; and making the Act an emergency measure."}, "19": {"bill_id": 415792, "number": "HB20", "change_hash": "b851a752b271da7e85f206e69402ad84", "url": "https://legiscan.com/MD/bill/HB20/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Environment - Watershed Implementation Plan - Ranking Best Management Practices", "description": "Requiring, on or before October 1, 2012, the Department of the Environment to create a list that ranks best management practices relating to a Watershed Implementation Plan based on cost and expected pollution reduction value; authorizing the Department to include specified information in the list; requiring the Department to update the list annually; and requiring the Department to publish the list on the Department's Web site and to mail a hard copy of the list to each county."}, "20": {"bill_id": 415775, "number": "HB21", "change_hash": "9b562e9ed486a9dd10fd2629d17e3ce8", "url": "https://legiscan.com/MD/bill/HB21/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading House Rules and Executive Nominations", "title": "Transportation Trust Fund Protection Act", "description": "Proposing an amendment to the Maryland Constitution to establish a Transportation Trust Fund to be used only for purposes relating to transportation with a specified exception; prohibiting the reversion or crediting of any part of the Transportation Trust Fund to the General Fund or a special fund of the State; requiring that specified taxes, fees, charges, and revenues be credited to the Transportation Trust Fund; etc."}, "29": {"bill_id": 415623, "number": "SB7", "change_hash": "b857990c384f416177cd86544032afde", "url": "https://legiscan.com/MD/bill/SB7/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Baltimore City - Board of Liquor License Commissioners - Transfer of License", "description": "Altering a prohibition against the Board of Liquor License Commissioners for Baltimore City issuing an alcoholic beverages license or transferring a license into specified locations in Baltimore City by authorizing the Board to allow the transfer of one Class D license into a specified residential planned unit development for Silo Point located in ward 24, precinct 5."}, "30": {"bill_id": 415607, "number": "SB8", "change_hash": "a1becd998a16c7fc3e89139893cd465f", "url": "https://legiscan.com/MD/bill/SB8/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Education - Talbot County - Participation in High School Athletic Programs", "description": "Allowing a student who resides in the geographical attendance area of one secondary school in Talbot County to represent another secondary school in the county in an interscholastic athletic activity if the activity is not offered in the resident school; allowing the student to participate in the athletic activity without transferring to the school outside of the student's geographical attendance area; and making the Act an emergency measure."}, "32": {"bill_id": 415573, "number": "SB10", "change_hash": "79289587c1759d2fd95feef09ae589d0", "url": "https://legiscan.com/MD/bill/SB10/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Public Service Commission - Application for Substantial Influence - Divestiture", "description": "Prohibiting the Public Service Commission from approving a specified application that requests authorization for Exelon Corporation to acquire the power to exercise substantial influence over the policies and actions of Baltimore Gas and Electric Company unless the Commission requires, as a condition of approval in an order under a specified case or any related or subsequent case, the resulting company to divest itself of Baltimore Gas and Electric Company; and making the Act an emergency measure."}, "33": {"bill_id": 415555, "number": "SB11", "change_hash": "9d81c5968cf3ffd6803e18f3f07f3a0f", "url": "https://legiscan.com/MD/bill/SB11/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Environment - Watershed Implementation Plan - Cap on Costs", "description": "Requiring each entity that prepares a Watershed Improvement Plan to prepare a cost assessment of costs associated with implementing the Plan through 2017; requiring a cost assessment to be updated each year by December 1; requiring the Department of the Environment to submit a report on the cost assessments to the Governor and the General Assembly each year by December 31; and prohibiting the implementation of a Watershed Implementation Plan if a specified cost assessment exceeds a specified amount."}, "38": {"bill_id": 415475, "number": "SB16", "change_hash": "1ef4eed0ec1f7b121aad05d54a955ad1", "url": "https://legiscan.com/MD/bill/SB16/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Department of the Environment - Rubble Landfills - Location", "description": "Prohibiting the Secretary of the Environment from issuing a permit to construct or operate a rubble landfill within 2.5 miles of Jacobs Creek in Kent County; and making the Act an emergency measure."}, "39": {"bill_id": 415458, "number": "SB17", "change_hash": "c5622ed36bb76aa0ddc1bd527e63ff08", "url": "https://legiscan.com/MD/bill/SB17/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "State Government - Executive Order - Definition", "description": "Altering the definition of \"executive order\" to remove from the definition an order or an amendment or a rescission of an order that adopts specified guidelines, rules of conduct, or rules of procedure for specified persons."}, "40": {"bill_id": 415442, "number": "SB18", "change_hash": "e2022807471f26b101fd5173c9d6adb3", "url": "https://legiscan.com/MD/bill/SB18/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Environment - Watershed Implementation Plan - Conowingo Dam Environmental", "description": "Prohibiting a person from engaging in an activity or strategy to implement a State Watershed Implementation Plan until the State completes a full assessment of the environmental impacts of opening the Conowingo Dam floodgates in September 2011 following Hurricane Irene and Tropical Storm Lee; and making the Act an emergency measure."}, "44": {"bill_id": 415375, "number": "SB22", "change_hash": "de6fe15b8d230d723aab213495b1dc6b", "url": "https://legiscan.com/MD/bill/SB22/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Environment - On-Site Sewage Disposal Systems", "description": "Establishing that the State may not prohibit the installation of any on-site sewage disposal system until specified overflows at specified sewage pumping stations are fully mitigated."}, "50": {"bill_id": 415275, "number": "SB28", "change_hash": "d82e6b8c50836b23fa43796ef385440a", "url": "https://legiscan.com/MD/bill/SB28/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Department of Planning - State Development Plan - Approval by the General", "description": "Requiring the Secretary of Planning to submit a State Development Plan to the General Assembly; prohibiting a specified plan from being finalized until it is approved by an Act of the General Assembly; requiring the Governor to file with the Secretary of State the Plan, part of the Plan, or revision to the Plan, together with any comments made by the Governor after enactment of a law that approves the Plan; and making the Act an emergency measure."}, "51": {"bill_id": 415258, "number": "SB29", "change_hash": "a29d56cb721d4876d3ac7982fab85304", "url": "https://legiscan.com/MD/bill/SB29/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Environment - Watershed Implementation Plans - Implementation Deadlines", "description": "Prohibiting the State from submitting Watershed Implementation Plan documents to the U.S. Environmental Protection Agency that are based on nutrient or sediment reduction goals that exceed federal requirements; and making the Act an emergency measure."}, "52": {"bill_id": 415242, "number": "SB30", "change_hash": "6533eeed16abfbe89f56137250a1f8e8", "url": "https://legiscan.com/MD/bill/SB30/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "State Individual Income Tax - Millionaires' Tax", "description": "Increasing the State income tax rate for an individual to 6.25% of Maryland taxable income in excess of $1,000,000; requiring the Comptroller to waive specified interest and penalties for the 2012 calendar year; and applying the Act to taxable years beginning after December 31, 2011."}, "53": {"bill_id": 415225, "number": "SB31", "change_hash": "b4f7046c70f1936ba434ad4f9aa19c90", "url": "https://legiscan.com/MD/bill/SB31/2011/X1", "status_date": "2011-10-17", "status": 1, "last_action_date": "2011-10-17", "last_action": "First Reading Senate Rules", "title": "Income Tax - Corporations - Denial of Deduction for Excessive Compensation of", "description": "Providing an addition modification under the Maryland corporate income tax for the amount of salary, wages, or other compensation for personal services paid or incurred by a corporation to an officer or director of the corporation in excess of 25 times the annual salary, wages, or other compensation for personal services of the lowest paid full-time employee; and applying the Act to tax years beginning after December 31, 2011."}}