{"session": {"session_id": 1192, "state_id": 20, "year_start": 2016, "year_end": 2016, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2016 Regular Session", "session_name": "2016 Regular Session"}, "1002": {"bill_id": 843679, "number": "HB1003", "change_hash": "7ae842eea61447a84c4d5c3345a80d88", "url": "https://legiscan.com/MD/bill/HB1003/2016", "status_date": "2016-05-19", "status": 4, "last_action_date": "2016-05-19", "last_action": "Approved by the Governor - Chapter 557", "title": "Labor and Employment - Equal Pay for Equal Work", "description": "Altering a specified provision of law concerning equal pay for equal work to prohibit discrimination on the basis of gender identity; prohibiting an employer from discriminating between employees in any occupation by providing less favorable employment opportunities based on sex or gender identity; prohibiting an employer from forbidding an employee from inquiring about, discussing, or disclosing the wages of specified employees or requesting that the employer provide a reason why the employee's wages are a condition of employment; etc."}, "1098": {"bill_id": 845369, "number": "HB1099", "change_hash": "c8d1863712720a65bc113dcb9f17d1ce", "url": "https://legiscan.com/MD/bill/HB1099/2016", "status_date": "2016-02-11", "status": 1, "last_action_date": "2016-03-17", "last_action": "Unfavorable Report by Health and Government Operations; Withdrawn", "title": "Vital Records - New Certificates of Birth - Gender Identity", "description": "Requiring the Secretary of Health and Mental Hygiene to make a new certificate of birth for an individual if the Department of Health and Mental Hygiene receives a written request and a signed statement that an individual's gender identity differs from the sex designated on the original certificate of birth; etc."}, "1464": {"bill_id": 847190, "number": "HB1465", "change_hash": "e3646076a0ce6ee7fea4e0beeb129837", "url": "https://legiscan.com/MD/bill/HB1465/2016", "status_date": "2016-03-19", "status": 2, "last_action_date": "2016-03-31", "last_action": "Hearing 3/31 at 1:00 p.m.", "title": "Foster Care - Standards for Foster Parents", "description": "Requiring the Social Services Administration of the Department of Human Resources to adopt regulations that provide for the selection of foster parents for a specified child considered for placement that have the capacity to value, respect, appreciate, and educate the child regarding the child's, racial, ethnic, religious and cultural heritage, disability, if any, and sexual orientation or gender identity."}}