{"session": {"session_id": 1528, "state_id": 20, "year_start": 2018, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2018 Regular Session", "session_name": "2018 Regular Session"}, "901": {"bill_id": 1080730, "number": "HB902", "change_hash": "2dd5703d84cb606c7bc52269069bb64e", "url": "https://legiscan.com/MD/bill/HB902/2018", "status_date": "2018-02-05", "status": 1, "last_action_date": "2018-04-03", "last_action": "Favorable Report Adopted", "title": "Health Occupations - Conversion Therapy for Minors - Prohibition (Youth Mental Health Protection Act)", "description": "Prohibiting certain mental health or child care practitioners from engaging in conversion therapy with individuals who are minors; providing that a certain mental health or child care practitioner who engages in conversion therapy with a minor shall be considered to have engaged in unprofessional conduct subject to disciplinary action; defining \"conversion therapy\" as a practice or treatment by a mental health or child care practitioner that seeks to change an individual's sexual orientation or gender identity; etc."}, "1223": {"bill_id": 1084057, "number": "HB1224", "change_hash": "8816e4ca0bdc11979343ecea7803796f", "url": "https://legiscan.com/MD/bill/HB1224/2018", "status_date": "2018-03-19", "status": 2, "last_action_date": "2018-03-28", "last_action": "Hearing 3/28 at 1:00 p.m.", "title": "Ending Youth Homelessness Act of 2018", "description": "Establishing the Ending Youth Homelessness Grant Program to focus on preventing and ending youth homelessness in the State and addressing disparities based on race, ethnicity, sexual orientation, and gender identity; requiring the Department of Housing and Community Development to administer the Program and provide funds to housing and supportive services for at risk and unaccompanied homeless youth; establishing the Ending Youth Homelessness Grant Fund to provide funds for the Program; etc."}}