{"session": {"session_id": 1783, "state_id": 20, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "2021 Regular Session"}, "127": {"bill_id": 1390448, "number": "HB128", "change_hash": "ec147f7e10ba91cd28f8f3b3abf3edc8", "url": "https://legiscan.com/MD/bill/HB128/2021", "status_date": "2021-05-30", "status": 4, "last_action_date": "2021-05-30", "last_action": "Enacted under Article II, Section 17(c) of the Maryland Constitution - Chapter 385", "title": "Criminal Law - Hate Crimes - Protected Groups and Penalties", "description": "Altering the term \"sexual orientation\" in the context of hate crimes; including gender identity in the list of characteristics protected by the prohibition on hate crimes; authorizing a court to require an offender convicted of hate crimes to complete an antibias education program; requiring the University System of Maryland to manage the development of an antibias education program that provides antibias education relevant to certain provisions of Maryland law by January 1, 2023;  etc."}, "154": {"bill_id": 1389896, "number": "HB155", "change_hash": "75cf77c5e2fe6745f9eefe33a0822d83", "url": "https://legiscan.com/MD/bill/HB155/2021", "status_date": "2021-02-25", "status": 2, "last_action_date": "2021-02-26", "last_action": "Referred Judicial Proceedings", "title": "County Boards and Public and Nonpublic Prekindergarten Programs and Schools - Discrimination - Prohibition", "description": "Prohibiting a county board, public prekindergarten program, primary or secondary school, or nonpublic prekindergarten program or primary or secondary school that receives State funds from discriminating against a person, refusing enrollment of a prospective student, expelling a current student, or withholding privileges from certain individuals, or taking certain retaliatory actions on the basis of race, ethnicity, color, religion, sex, age, national origin, marital status, sexual orientation, gender identity, or disability; etc."}, "230": {"bill_id": 1390599, "number": "HB231", "change_hash": "c9f0bf500c6d576f77d0db03fb2d096b", "url": "https://legiscan.com/MD/bill/HB231/2021", "status_date": "2021-05-30", "status": 4, "last_action_date": "2021-05-30", "last_action": "Enacted under Article II, Section 17(c) of the Maryland Constitution - Chapter 369", "title": "Crimes - Mitigation and Defense - Race, Color, National Origin, Sex, Gender Identity, or Sexual Orientation", "description": "Establishing that the discovery or perception of, or belief about, another person's race, color, national origin, sex, gender identity, or sexual orientation, whether or not accurate, does not constitute legally adequate provocation to mitigate a killing from the crime of murder to manslaughter nor is it a defense to the crime of assault in any degree."}, "1045": {"bill_id": 1438787, "number": "HB1046", "change_hash": "9f988f7c248f9e17f789895d98944f66", "url": "https://legiscan.com/MD/bill/HB1046/2021", "status_date": "2021-02-05", "status": 1, "last_action_date": "2021-02-10", "last_action": "Hearing 3/10 at 1:30 p.m.", "title": "Vehicle Laws - Policies and Prohibition Against Discriminatory Traffic Stops", "description": "Requiring the Maryland Police Training and Standards Commission in consultation with the Maryland Statistical Analysis Center to expand the model policy against race-based traffic stops to include traffic stops based on national origin, religion, gender, gender identity, or sexual identity; requiring a law enforcement officer making a traffic stop to report certain information to the law enforcement agency that employs the officer; etc."}, "1117": {"bill_id": 1438663, "number": "HB1118", "change_hash": "9ee7c82d15d68fd42ccd31815bf836c7", "url": "https://legiscan.com/MD/bill/HB1118/2021", "status_date": "2021-02-05", "status": 1, "last_action_date": "2021-02-11", "last_action": "Hearing 3/09 at 1:30 p.m.", "title": "Health Care Facilities – Discrimination", "description": "Prohibiting certain facilities or certain staff from discriminating against certain individuals or residents based on the actual or perceived sexual orientation, gender identity, gender expression, or human immunodeficiency virus (HIV) status of the individual or resident; requiring certain facilities to post a certain notice next to the facility's nondiscrimination policy in certain locations; requiring that all residents of a certain facility be informed of and have certain rights; etc."}}