{"session": {"session_id": 1956, "state_id": 20, "year_start": 2022, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2022 Regular Session", "session_name": "2022 Regular Session"}, "425": {"bill_id": 1572530, "number": "HB426", "change_hash": "1ad7691246e8fd14874ef7ccdd8ffc9e", "url": "https://legiscan.com/MD/bill/HB426/2022", "status_date": "2022-01-20", "status": 1, "last_action_date": "2022-01-27", "last_action": "Hearing 2/08 at 1:00 p.m.", "title": "Vehicle Laws - Policies and Prohibition Against Discriminatory Traffic Stops", "description": "Requiring the Maryland Police Training and Standards Commission in consultation with the Maryland Statistical Analysis Center to expand the model policy against race-based traffic stops to include traffic stops based solely on an individual's national origin, religion, gender, gender identity, or sexual orientation and requiring law enforcement agencies to adopt similar policies; etc."}, "452": {"bill_id": 1572848, "number": "HB453", "change_hash": "565b0093c16f785666b950f2384beec2", "url": "https://legiscan.com/MD/bill/HB453/2022", "status_date": "2022-01-20", "status": 1, "last_action_date": "2022-01-27", "last_action": "Hearing 2/08 at 1:00 p.m.", "title": "Correctional Facilities - Transgender, Nonbinary, and Intersex Inmates (Transgender Respect, Agency, and Dignity Act)", "description": "Prohibiting an employee of a correctional facility from discriminating against inmates on the basis of certain protected classes; requiring the managing official of a correctional facility to develop a written nondiscrimination policy regarding inmates; and establishing certain requirements for correctional facilities relating to the gender identity of inmates and inmates who are transgender, nonbinary, or intersex."}, "745": {"bill_id": 1581584, "number": "HB746", "change_hash": "c8b721c64b6be13fc48c05bab045b7c1", "url": "https://legiscan.com/MD/bill/HB746/2022", "status_date": "2022-02-03", "status": 1, "last_action_date": "2022-02-15", "last_action": "Hearing 3/02 at 1:30 p.m.", "title": "Maryland Medical Assistance Program – Gender–Affirming Treatment (Trans Health Equity Act of 2022)", "description": "Requiring, beginning on January 1, 2023, the Maryland Medical Assistance Program to provide gender-affirming treatment; and prohibiting the Program from issuing an adverse benefit determination related to gender-affirming treatment unless a health care provider with experience prescribing or delivering gender-affirming treatment has reviewed and confirmed the appropriateness of the determination."}, "849": {"bill_id": 1583660, "number": "HB850", "change_hash": "6a60a01da5f91945237933662b233a94", "url": "https://legiscan.com/MD/bill/HB850/2022", "status_date": "2022-05-29", "status": 4, "last_action_date": "2022-05-29", "last_action": "Enacted under Article II, Section 17(c) of the Maryland Constitution - Chapter 739", "title": "Schools, Prekindergarten Programs, and County Boards of Education - Discrimination", "description": "Prohibiting county boards of education and certain schools and prekindergarten programs from taking certain discriminatory actions because of a person's race, ethnicity, color, religion, sex, age, national origin, marital status, sexual orientation, gender identity, or disability; requiring each county board and certain schools and prekindergarten programs to print a certain statement in their student handbook; providing for the filing of a complaint under the Act with the State Superintendent of Schools; etc."}, "1456": {"bill_id": 1596762, "number": "HB1457", "change_hash": "a89e103d013d0170a710e34d3fda7ea9", "url": "https://legiscan.com/MD/bill/HB1457/2022", "status_date": "2022-02-24", "status": 1, "last_action_date": "2022-02-24", "last_action": "First Reading House Rules and Executive Nominations", "title": "Real Estate Transactions - Prospective Buyer Communications - Personal Information", "description": "Prohibiting a seller's agent from providing to a seller certain communications from a prospective buyer containing personal information or characteristics of the prospective buyer; and providing the Act is intended to prevent a seller from selecting a buyer on the basis of race, color, religion, sexual orientation, gender identity, national origin, familial status, or disability in violation of the Federal Fair Housing Act."}, "2158": {"bill_id": 1583110, "number": "SB666", "change_hash": "244b846d7f31c401bbf1949e22ad593a", "url": "https://legiscan.com/MD/bill/SB666/2022", "status_date": "2022-04-08", "status": 2, "last_action_date": "2022-04-11", "last_action": "Favorable Report by Ways and Means", "title": "Schools, Prekindergarten Programs, and County Boards of Education – Discrimination", "description": "Prohibiting county boards of education and certain schools and prekindergarten programs from taking certain discriminatory actions because of a person's race, ethnicity, color, religion, sex, age, national origin, marital status, sexual orientation, gender identity, or disability; requiring each county board and certain schools and prekindergarten programs to print a certain statement in their student handbook; authorizing a person alleging discrimination under the Act to file a complaint with the State Superintendent of Schools; etc."}, "2174": {"bill_id": 1583062, "number": "SB682", "change_hash": "ae3f32e924b86e6480c4cf2f1e4b4a1d", "url": "https://legiscan.com/MD/bill/SB682/2022", "status_date": "2022-03-21", "status": 2, "last_action_date": "2022-03-21", "last_action": "Hearing 3/24 at 1:30 p.m.", "title": "Maryland Medical Assistance Program - Gender-Affirming Treatment (Trans Health Equity Act of 2022)", "description": "Requiring, beginning on January 1, 2023, the Maryland Medical Assistance Program to provide gender-affirming treatment in a nondiscriminatory manner; requiring that the gender-affirming treatment be assessed according to nondiscriminatory criteria that are consistent with current clinical standards; prohibiting the issuance of an adverse benefit determination related to gender-affirming treatment unless a certain experienced health care provider has reviewed and confirmed the appropriateness of the determination; etc."}}