{"session": {"session_id": 996, "state_id": 8, "year_start": 2013, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2013-2014 Regular Session", "session_name": "147th General Assembly"}, "647": {"bill_id": 556937, "number": "SB97", "change_hash": "ae93023e0cd84ee38da3cf1c1bf89b12", "url": "https://legiscan.com/DE/bill/SB97/2013", "status_date": "2013-06-19", "status": 4, "last_action_date": "2013-06-19", "last_action": "Signed by Governor", "title": "An Act To Amend Titles 6, 9, 11, 18, 19, 25, And 29 Of The Delaware Code Relating To Hate Crimes And Discrimination In Employment, Public Works Contracting, Housing, Equal Accommodations, And The Insurance Business On The Basis Of Gender Identity.", "description": "This Act adds the term &quot;gender identity&quot; to the already-existing list of prohibited practices of discrimination and hate crimes. As such, this Act would forbid discrimination against a person on the basis of gender identity in housing, employment, public works contracting, public accommodations, and insurance, and it would provide for increased punishment of a person who intentionally selects the victim of a crime because of the victim&#8217;s gender identity."}, "733": {"bill_id": 643629, "number": "SB185", "change_hash": "167d10641c99aa81aa100d1cacc486f8", "url": "https://legiscan.com/DE/bill/SB185/2013", "status_date": "2014-07-31", "status": 4, "last_action_date": "2014-07-31", "last_action": "Signed by Governor", "title": "An Act To Amend Title 19 Of The Delaware Code Relating To The Persons With Disabilities Employment Protections Act.", "description": "Delaware employment discrimination law applies to employers of 4 or more employees within the State for all protected classes (race; marital status; genetic information; color; age; religion; sex; sexual orientation; gender identity; national origin) apart from disability. Only larger employers with 15 or more employees are subject to the State disability-based employment discrimination law. This bill removes the inconsistency by adopting the same definition of &#8220;employer&#8221; for all protected classes, including disability. Neighboring states have adopted a uniform definition of &#8220;employer&#8221; which applies to all protected classes [Pa. Code &#8211; 43. P.S.  952-954; Md. Code - 20-601-602; N.J. Code - 10:5-5]."}}