{"session": {"session_id": 1403, "state_id": 8, "year_start": 2017, "year_end": 2018, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2017-2018 Regular Session", "session_name": "149th General Assembly"}, "618": {"bill_id": 1020558, "number": "HJR6", "change_hash": "4ea9eaefb40d8d870ff197a109c16e08", "url": "https://legiscan.com/DE/bill/HJR6/2017", "status_date": "2017-06-28", "status": 2, "last_action_date": "2017-07-12", "last_action": "Assigned to Education Committee in Senate", "title": "Directing The Delaware Department Of Education, With The Assistance Of The Delaware State Board Of Education, To Promulgate Regulations That Prohibit Discrimination In School Districts Employment Practices Or Educational Programs And Activities For Students On The Basis Of Any Legally-protected Characteristic, Including Gender Identity Or Expression.", "description": "This House Joint Resolution directs the Department of Education, with the assistance of the Delaware State Board of Education, to promulgate regulations that include specific guidelines to prohibit discrimination in school district employment practices or educational programs and activities for students on the basis of any legally-protected characteristic, including gender identity or expression."}, "690": {"bill_id": 1008832, "number": "SB65", "change_hash": "86e62806f914d0cedcc3662e4853704f", "url": "https://legiscan.com/DE/bill/SB65/2017", "status_date": "2018-07-23", "status": 4, "last_action_date": "2018-07-23", "last_action": "Signed by Governor", "title": "An Act To Amend Titles 24 And 29 Of The Delaware Code Relating To Conversion Therapy.", "description": "Conversion therapy is a practice or treatment that seeks to change an individuals sexual orientation or gender identity, including any effort to change behaviors or gender expressions or to eliminate or reduce sexual or romantic attractions or feelings toward individuals of the same gender. Conversion therapy has been rejected by all mainstream medical and mental health organizations, and there is no credible evidence that it is effective. Moreover, this practice poses enormous health risks to LGBTQ youth, including an increased sense of shame, guilt, hopelessness, stress, and anger, thus increasing the risk of anxiety, depression, and self-harm. The harm done by conversion therapy can last well into adulthood."}}