{"session": {"session_id": 2005, "state_id": 8, "year_start": 2023, "year_end": 2024, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023-2024 Regular Session", "session_name": "152nd General Assembly"}, "0": {"bill_id": 1672903, "number": "HB1", "change_hash": "5931b930c93837444a3769a29480f53f", "url": "https://legiscan.com/DE/bill/HB1/2023", "status_date": "2023-03-07", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Health & Social Services) in Senate with 3 Favorable, 4 On Its Merits", "title": "An Act To Amend Title 16 Of The Delaware Code Relating To Marijuana.", "description": "This Act removes all penalties for use or possession of a personal use quantity of marijuana and marijuana accessories. It further specifies that the adult sharing of a personal use quantity or less of marijuana is legal activity for those 21 years of age or older and that those 21 or older may possess, use, display, purchase, or transport accessories and personal use quantities of marijuana without penalty. When transporting in a vehicle, those items must be in a closed container or otherwise not readily accessible to anyone inside the vehicle. The statute also specifies certain activities which remain unlawful. Finally, the definition of &quot;personal use quantity&quot; of marijuana is updated to include not only 1 ounce or less of leaf marijuana, but also equivalent amounts of marijuana product in other forms."}, "1": {"bill_id": 1672518, "number": "HB2", "change_hash": "9e1342b0d7e8696a27012eca83be6887", "url": "https://legiscan.com/DE/bill/HB2/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-16", "last_action": "Reported Out of Committee (Finance) in Senate with 3 Favorable, 1 On Its Merits", "title": "An Act To Amend Titles 4, 11, 16, And 30 Of The Delaware Code Relating To Creation Of The Delaware Marijuana Control Act.", "description": "The Delaware Marijuana Control Act regulates and taxes marijuana for recreational use in much the same manner as alcohol. It creates a framework for production, manufacture, and sale in a legal recreational marijuana industry."}, "2": {"bill_id": 1638961, "number": "HB25", "change_hash": "4c6afc3c37587e0fd92a594ec85b75e8", "url": "https://legiscan.com/DE/bill/HB25/2023", "status_date": "2023-01-19", "status": 4, "last_action_date": "2023-01-19", "last_action": "Signed by Governor", "title": "An Act To Declare The 2022 Delaware Relief Rebates As Qualified Disaster Payments.", "description": "This legislation establishes that a relief rebate issued under the 2022 Delaware Relief Rebate Program during the period that the federal major disaster declaration exists for the State of Delaware is intended to be a qualified disaster relief payment under § 139 of the Internal Revenue Code. It further provides that the State makes no representations or warranties to recipients regarding the 2022 Delaware Relief Rebate Program and that civil actions of any nature and claims for any form of economic entitlement including but not limited to damages are prohibited with respect to this legislation. This legislation is effective as of the date on which the 2022 Delaware Relief Rebate Program was enacted."}, "3": {"bill_id": 1638883, "number": "HB26", "change_hash": "4b698aa76ac7e1d677f6d90d54e2d5e5", "url": "https://legiscan.com/DE/bill/HB26/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-12", "last_action": "Assigned to Appropriations Committee in House", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To State Employee Leave.", "description": "This Act provides state employees 30, rather than 15, days of paid leave per year to attend training camp or serve special duty as ordered by the military reserves or Delaware National Guard."}, "4": {"bill_id": 1638850, "number": "HB27", "change_hash": "41f8b41db4537f74af99c37e28f31334", "url": "https://legiscan.com/DE/bill/HB27/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-17", "last_action": "Not Worked in Committee", "title": "An Act To Amend Title 9 Of The Delaware Code Relating To New Castle County Bidding Thresholds.", "description": "This Act raises the public bidding thresholds for procurement of goods, contractual services, professional services, and public works contracts by the government of New Castle County to match the bidding thresholds established by the States Contracting and Purchasing Advisory Council."}, "5": {"bill_id": 1638945, "number": "HB28", "change_hash": "d02f8b75435c8da725c3eb18d041f932", "url": "https://legiscan.com/DE/bill/HB28/2023", "status_date": "2023-01-17", "status": 2, "last_action_date": "2023-03-08", "last_action": "Reported Out of Committee (Environment, Energy & Transportation) in Senate with 8 Favorable", "title": "An Act To Amend Title 21 Of The Delaware Code Relating To Special License Plates.", "description": "This bill creates a special license plate for Whitetails Unlimited."}, "6": {"bill_id": 1638770, "number": "HB29", "change_hash": "af1962241057907eb6ce75da1b1e2055", "url": "https://legiscan.com/DE/bill/HB29/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-11", "last_action": "Not Worked in Committee", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Elderly Property Tax Relief And Education Expense Fund By Increasing The Elderly Property Tax Credit.", "description": "This Act increases the Senior Real Property Tax credit to $750 from $400 as authorized in the Appropriations Bill for fiscal year ending June 30, 2023, which effectively amended Title 29, § 6102(q)(3) from $500 to $400."}, "7": {"bill_id": 1638802, "number": "HB30", "change_hash": "1305c898235386c7ddab53b0b916a32f", "url": "https://legiscan.com/DE/bill/HB30/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-25", "last_action": "Amendment HA 1 to HB 30 - Introduced and Placed With Bill", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To The Disabled Veteran Property Tax Credit.", "description": "This Act removes the 3 year residency requirement to qualify for the disabled veteran tax credit."}, "8": {"bill_id": 1638899, "number": "HB31", "change_hash": "13e4fd39538f6f40efdca965ca45bc05", "url": "https://legiscan.com/DE/bill/HB31/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-11", "last_action": "Not Worked in Committee", "title": "An Act To Amend Title 14 And Title 29 Of The Delaware Code Relating To The Senior Property Tax Credit.", "description": "This Act reinstates a credit against school taxes of up to $400 for seniors who have been domiciled in Delaware for 3 years or more. After 10 years domiciled in Delaware the credit would increase to $500. Under current law the credit is $500 after 10 years."}, "9": {"bill_id": 1638817, "number": "HB32", "change_hash": "313d022cba02cc83cfe8f8d13c9d167e", "url": "https://legiscan.com/DE/bill/HB32/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-18", "last_action": "Reported Out of Committee (Natural Resources & Energy) in House with 8 Favorable, 3 On Its Merits", "title": "An Act To Amend Title 23 Of The Delaware Code Relating To Boat Licensing Agents.", "description": "This Act raises the permissible service charge for a boat registration from $5 to $10 and the permissible service charge for a boat ramp certificate from $1.50 to $5.00."}, "10": {"bill_id": 1638786, "number": "HB33", "change_hash": "1252d43968c13396ea8978d2d3d07ef5", "url": "https://legiscan.com/DE/bill/HB33/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-16", "last_action": "Reported Out of Committee (Finance) in Senate with 5 On Its Merits", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Funding For Prekindergarten Special Education.", "description": "This Act increases funding for preschool children with disabilities who are not counted in either &quot;intensive&quot; or &quot;complex&quot; special education units by revising the current ratio of 12.8 students per unit to 8.4 students per unit for preschool children included in the basic unit count. This is the same ratio in effect as of July 1, 2023, for K-3 basic special education. The Act also consolidates the K-3 Basic Special Education Unit with the 4-12 Basic Special Education Unit as the ratio is the same for each group as of July 1, 2023."}, "11": {"bill_id": 1638928, "number": "HB34", "change_hash": "c79fec2053f0a22163184dea1f7cf304", "url": "https://legiscan.com/DE/bill/HB34/2023", "status_date": "2023-03-16", "status": 3, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 19 YES 1 NO 1 ABSENT", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To School Boards.", "description": "House Bill No. 34 requires school boards, including charter schools, to permit public comment on each agenda item presented for a vote at a school board meeting. The public comment period must take place before the school board vote on an agenda item. The school board may reasonably restrict the time, place, and manner of the public comment period."}, "12": {"bill_id": 1638865, "number": "HB35", "change_hash": "dcade60280fa73de238144005bf1a612", "url": "https://legiscan.com/DE/bill/HB35/2023", "status_date": "2023-01-17", "status": 2, "last_action_date": "2023-03-08", "last_action": "Reported Out of Committee (Environment, Energy & Transportation) in Senate with 2 Favorable, 6 On Its Merits", "title": "An Act To Amend Title 7 Of The Delaware Code Relating To Motor Vehicle Noise.", "description": "This Act charges the Department of Safety &amp; Homeland Security, in cooperation with the Department of Natural Resources and Environmental Control and the Department of Transportation, to present a report and plan to the General Assembly no later than October 1, 2023 for a comprehensive motor vehicle noise and abatement program. The agencies are charged with considering developments in technology, other state and federal standards, and proposing changes as necessary to Delaware law and recommendations for changes in equipment and procedures."}, "13": {"bill_id": 1638915, "number": "HB36", "change_hash": "c0d2c08aab810b91aaa3ec4d290780fa", "url": "https://legiscan.com/DE/bill/HB36/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-26", "last_action": "Assigned to Appropriations Committee in House", "title": "An Act To Amend Title 30 Of The Delaware Code Relating To The Realty Transfer Tax.", "description": "This Act decreases by 1% the rate of the realty transfer tax to be received by the State, thereby returning it to the rate that was applicable prior to August 1,2017. The Act also makes technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual. This Act will apply to documents recorded and permits applied for after the effective date of the Act."}, "14": {"bill_id": 1638834, "number": "HB37", "change_hash": "2872d90909fcee883e3c568e2b4a6630", "url": "https://legiscan.com/DE/bill/HB37/2023", "status_date": "2022-12-15", "status": 1, "last_action_date": "2023-01-17", "last_action": "Motion to Release Failed", "title": "An Act To Amend Title 25 Of The Delaware Code Relating To Landlord Obligations And Tenant Remedies.", "description": "It is the policy of this State that meaningful sanctions be imposed upon those who allow dangerous conditions and defects to exist in leased premises and that an effective mechanism be established for repairing these conditions and halting their creation. This Act allows tenants to bring an action of rent escrow to pay rent into the court because of asserted defects or conditions. Alternatively, the tenant may refuse to pay rent and raise the existence of the asserted defects or conditions as an affirmative defense to an action for summary possession or an action for nonpayment of rent. This Act requires the tenant to give proper notice and allow the landlord the opportunity to effect repairs. This Act requires the court to make appropriate findings of fact and to make any order that justice of the case may require, which may include termination of the lease and return of the leased premises to the landlord, order that the action for rent escrow be dismissed, order that the amount of rent be reduced in amount determined by the court to be fair and equitable, or order the landlord to make the repairs or correct the conditions complained of by the tenant."}, "15": {"bill_id": 1643596, "number": "HB38", "change_hash": "d4683eb9f3595b582adbd80f59e8e8c3", "url": "https://legiscan.com/DE/bill/HB38/2023", "status_date": "2023-01-12", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Elections & Government Affairs) in Senate with 4 On Its Merits", "title": "An Act To Amend The Town Charter Of The Town Of Magnolia.", "description": "This Act amends the Charter of the Town of Magnolia to update and clarify the authority of the Town to borrow money. Specifically, this Act increases the short-term borrowing limit from $15,000 to $50,000, which borrowings are to be authorized by a majority vote of the Town Council. This Act establishes procedures for the Town Council to borrow up to 15% of the assessed value of real property in the Town pursuant to a super-majority vote of the Town Council following a public hearing on the borrowing. The Towns long-term debt limit pursuant to the favorable vote of the qualified voters is being increased from 15% to 25% of the total assessed value of real property in the Town. This Act clarifies that the owner of more than one lot in an unfinished subdivision may only vote once in a borrowing referendum. This Act makes various miscellaneous changes to internal references to establish consistency with the changes made herein."}, "16": {"bill_id": 1643658, "number": "HB39", "change_hash": "e7d9763e96a170739e8eb17070cc5095", "url": "https://legiscan.com/DE/bill/HB39/2023", "status_date": "2023-01-05", "status": 1, "last_action_date": "2023-03-02", "last_action": "Amendment HA 1 to HB 39 - Introduced and Placed With Bill", "title": "An Act To Create The Expanded Protection For Our Communities And Homes Grant Program.", "description": "This bill seeks to create the Expanded Protection for Our Communities and Homes (EPOCH) Grant Program through a one-time appropriation of $20 million. The grant money would be distributed to every Delaware police agency that chooses to participate. The distribution would consist of a minimum standard allocation made to each agency and an allocation based on the number of uniformed officers authorized for each agency. EPOCH grants could be used by the recipient agencies to recruit new officers; promote or encourage careers in law enforcement; initially pay the salaries of newly hired officers; pay for overtime to facilitate additional work to address issues of local concern (including traffic enforcement); and implement programs designed to improve public safety in the area of the agencys jurisdiction. The grant allocations would be available for the agencies to use for up to three years, after which any unused and unencumbered funding would return to the General Fund."}, "17": {"bill_id": 1643718, "number": "HB40", "change_hash": "1c9ae8ed1b5209d535507d498f160cb9", "url": "https://legiscan.com/DE/bill/HB40/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Executive Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To Grants-in-aid.", "description": "This bill creates the Grants-In-Aid Committee. The Committee is a joint committee of the Senate and House of Representatives. The purpose of the Committee is to view applications for grants-in-aid and to develop and recommend to the Joint Finance Committee the grants-in-aid appropriations bill."}, "18": {"bill_id": 1643779, "number": "HB41", "change_hash": "5f1f751b416fcc03a15be322c5cbc7d6", "url": "https://legiscan.com/DE/bill/HB41/2023", "status_date": "2023-01-05", "status": 1, "last_action_date": "2023-03-07", "last_action": "Reported Out of Committee (Economic Development/Banking/Insurance & Commerce) in House with 3 Favorable, 7 On Its Merits", "title": "An Act To Amend Title 6 Of The Delaware Code Relating To The Digital Right To Repair Act.", "description": "This bill creates the Delaware Digital Right to Repair Act. Currently when an electronic product such as a phone or electronic game breaks, it is only allowed to be repaired by the manufacturer. Parts are not available whether you are a consumer or a local repair shop. This act requires the manufacturer to make parts, documentation, tools, and updates available on fair and reasonable terms."}, "19": {"bill_id": 1643535, "number": "HB42", "change_hash": "ad0259a1bd1b3d1117115a789b39d988", "url": "https://legiscan.com/DE/bill/HB42/2023", "status_date": "2023-01-05", "status": 1, "last_action_date": "2023-01-18", "last_action": "Tabled in Committee", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Limitation On Public Schools&#39;", "description": "This Act removes the up to 10% increase in school property taxes allowed after reassessment"}, "20": {"bill_id": 1643475, "number": "HB43", "change_hash": "ec85a100cedcb7d990a8f9b5710fe827", "url": "https://legiscan.com/DE/bill/HB43/2023", "status_date": "2023-01-05", "status": 1, "last_action_date": "2023-01-05", "last_action": "Introduced and Assigned to Administration Committee in House", "title": "An Act To Amend Title 15 Of The Delaware Code Relating To Primary Elections.", "description": "This Act allows Delaware voters who are not affiliated with a political party to vote in a political party&#39;s primary election."}, "21": {"bill_id": 1643839, "number": "HB44", "change_hash": "5161c9e783f2aa48fa8329b50870a759", "url": "https://legiscan.com/DE/bill/HB44/2023", "status_date": "2023-01-05", "status": 1, "last_action_date": "2023-01-24", "last_action": "Motion to Release Failed", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Redistricting Of The General Assembly.", "description": "The constitutional requirement to create new legislative districts following the U.S. Census was intended to ensure equal representation at all levels of government. However, Delawares current process of redistricting is deeply flawed. It allows the majority party in each legislative chamber to gerrymander state legislative maps in a self-serving attempt to preserve and expand partisan political power. All other considerations have become secondary in this process. This defect is common to many states and some have tried to address the issue by creating election commissions charged with redrawing legislative lines. The challenge in such a system is ensuring that these commissions can conduct their function in a balanced, objective, and non-partisan fashion. This bill proposes a new method that avoids this significant hurdle by leveraging partisan self-interest to create a protocol that results in an equitable outcome. This fresh approach to reapportionment is described in a paper by 3 Carnegie Mellon University professors entitled: A Partisan Districting Protocol with Provably Nonpartisan Outcomes. It utilizes a system analogous to a proven, prudent method for instructing 2 children to fairly divide a piece of cake between themselves. The first child cuts the cake, while the second has the option of selecting which piece he or she wishes to consume. In the protocol outlined in this bill, the two competing parties are the partisan caucuses of each General Assembly chamber. The first caucus will initially draw all the legislative districts, observing established legal redistricting standards. The second caucus will have the ability to freeze a set number of the districts, locking their boundaries into place. They will then be able to redraw the remaining districts as they wish, delivering the new maps back to the first caucus. This group will then also engage in the freeze and redraw process, with the cycles continuing until all the districts have been defined. With both sides getting equal bites of the apple, each has a practical ability to affect the outcome and a reason to work together to achieve a mutually acceptable conclusion. The bill also includes safeguards to ensure public notification and participation in the process, as well as a contingency to allow the judicial branch to draw the new legislative maps should the General Assembly be unable to achieve the task. This legislation assumes calling the General Assembly into special session to approve the finalized maps, providing enough time for the process to be conducted in a deliberative manner."}, "22": {"bill_id": 1654482, "number": "HB45", "change_hash": "b4398fb48f6fb47256cd9471872e26ad", "url": "https://legiscan.com/DE/bill/HB45/2023", "status_date": "2023-03-07", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Education) in Senate with 4 Favorable, 4 On Its Merits", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Developmental Screening.", "description": "This Act amends Chapter 30A of Title 14 to clarify that screening will not be conducted if a parent declines developmental screening or notifies the licensee that the child is already receiving early intervention services or special education and related services. It further clarifies that the child care provider will conduct the screening where the parent or guardian fails to do so only upon receipt of parental consent."}, "23": {"bill_id": 1656846, "number": "HB46", "change_hash": "81271f9a3d5349b16ee353c8bc104ec0", "url": "https://legiscan.com/DE/bill/HB46/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Banking, Business, Insurance & Technology) in Senate with 8 On Its Merits", "title": "An Act To Amend Title 18 Of The Delaware Code Relating To Credit For Reinsurance.", "description": "This bill reflects the National Association of Insurance Commissioners revisions to the Model Credit for Reinsurance Act giving the Commissioner express regulatory authority to address the handling and treatment of reinsurance agreements entered into, directly or indirectly, with life and health insurer-affiliated captives, special purpose vehicles or similar entities, including the authority to promulgate model regulations adopted by the NAIC that are required for the Department to meet accreditation."}, "24": {"bill_id": 1656384, "number": "HB47", "change_hash": "83cac1379faee09331fdf09de10c1cb5", "url": "https://legiscan.com/DE/bill/HB47/2023", "status_date": "2023-01-12", "status": 1, "last_action_date": "2023-01-18", "last_action": "Reported Out of Committee (Economic Development/Banking/Insurance & Commerce) in House with 11 On Its Merits", "title": "An Act To Amend Title 18 Of The Delaware Code Relating To Authorization Of Insurers And General Requirements.", "description": "Delawares capital and surplus requirements for insurers have been in place for over fifty years and are currently among the lowest in the country. This bill increases the minimum amount of capital stock and free surplus an insurer must possess and maintain in order to transact business in the State of Delaware, making them more in line with other jurisdictions."}, "25": {"bill_id": 1656612, "number": "HB48", "change_hash": "cd6c3ef933beb83d06f0dc56d4376e5c", "url": "https://legiscan.com/DE/bill/HB48/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Banking, Business, Insurance & Technology) in Senate with 8 On Its Merits", "title": "An Act To Amend Title 18 Of The Delaware Code Relating To Record Retention Requirements.", "description": "This bill expands record retention requirements for licensed producers, adjusters and appraisers from 3 to 5 years. The bill also makes technical changes to conform to the Legislative Drafting Manual."}, "26": {"bill_id": 1658401, "number": "HB49", "change_hash": "1d40ee086f3effe5ee85bb914b64cf0b", "url": "https://legiscan.com/DE/bill/HB49/2023", "status_date": "2023-01-26", "status": 4, "last_action_date": "2023-01-26", "last_action": "Signed by Governor", "title": "An Act To Amend Title 19 Of The Delaware Code Relating To Unemployment Benefits And Employer Assessments.", "description": "This Act provides post-pandemic related relief to both claimants receiving unemployment benefits and employers who are assessed unemployment taxes. This bill will increase the maximum weekly benefit amount payable to claimants seeking unemployment compensation benefits from the Delaware Department of Labor, Division of Unemployment Insurance from $400.00 a week to $450.00 a week. The funds necessary to pay the increased weekly benefit amounts will be paid from the Unemployment Trust Fund. Delaware currently pays unemployment claimants less per week in benefits than claimants are paid in each neighboring state. The maximum weekly benefit amount has not changed since 2019."}, "27": {"bill_id": 1654114, "number": "HB50", "change_hash": "6f5bffff6a8c329d58065a1179021d08", "url": "https://legiscan.com/DE/bill/HB50/2023", "status_date": "2023-01-11", "status": 1, "last_action_date": "2023-01-18", "last_action": "Reported Out of Committee (Public Safety & Homeland Security) in House with 5 On Its Merits, 1 Unfavorable", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To Theft.", "description": "This Act creates a separate offense for the theft of mail, including packages, from a residential dwelling. A first offense of mail theft is a class A misdemeanor unless the value of the stolen property is $1,500 or more, in which case it is a class G felony. A second offense of mail theft, within the previous 5 years is a class G felony, regardless of the value of the stolen property."}, "28": {"bill_id": 1662599, "number": "HB51", "change_hash": "732edf3ce1c5199f165947f42e3b7814", "url": "https://legiscan.com/DE/bill/HB51/2023", "status_date": "2023-03-14", "status": 3, "last_action_date": "2023-03-14", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "An Act To Amend Title 21 Of The Delaware Code Relating To Inspection Of Fleet Vehicles.", "description": "This bill allows the fleet inspection program to be applicable to a fleet of 10 or more vehicles (instead of 15) and counts trailers requiring inspection to count as fleet vehicles."}, "29": {"bill_id": 1665765, "number": "HB52", "change_hash": "4bf16a84eb1d97edd303889e88a5080c", "url": "https://legiscan.com/DE/bill/HB52/2023", "status_date": "2023-03-16", "status": 3, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To The Adult Correction Healthcare Review Committee.", "description": "This bill adds a Delaware licensed psychiatrist as a voting member of the Adult Correction Healthcare Review Committee."}, "30": {"bill_id": 1666275, "number": "HB53", "change_hash": "5f23c862db2ea9400567b4007ad806a7", "url": "https://legiscan.com/DE/bill/HB53/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Assigned to Judiciary Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The State Department Of Justice.", "description": "This bill removes the requirement that a head or assistant head of any Division of the State Department of Justice or the Chief Prosecutor of a particular county be a resident of the State of Delaware."}, "31": {"bill_id": 1669467, "number": "HB54", "change_hash": "5b238d9140da555a191a11437f34d918", "url": "https://legiscan.com/DE/bill/HB54/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Assigned to Banking, Business, Insurance & Technology Committee in Senate", "title": "An Act To Amend Title 18, Title 29, And Title 31 Of The Delaware Code Relating To Insurance Coverage Of Epinephrine Autoinjectors.", "description": "Currently, all health insurance plans subject to requirements under Delaware law must include at least 1 formulation of epinephrine autoinjectors on the lowest tier of the carrier&#39;s drug formulary for individuals who are 18 years of age or younger. This Act expands this requirement to all covered individuals, regardless of age, by January 1, 2024."}, "32": {"bill_id": 1669651, "number": "HB55", "change_hash": "b28910ea33f90f09cf7393e670feb5fa", "url": "https://legiscan.com/DE/bill/HB55/2023", "status_date": "2023-03-14", "status": 1, "last_action_date": "2023-03-14", "last_action": "Adopted in lieu of the original bill HB 55, and Assigned to Judiciary Committee in House", "title": "An Act To Amend Title 6 And Title 31 Of The Delaware Code Relating To Individuals Who Are Homeless.", "description": "This Act is the Bill of Rights for Individuals Experiencing Homelessness to ensure that all individuals, regardless of housing status, have equal opportunity to live in decent, safe, sanitary, and healthful accommodations and enjoy equality of opportunities. To that end, this Act sets forth the rights of individuals experiencing homelessness and creates a process by which the State Human and Civil Rights Commission and the Division of Human Relations may accept and investigate complaints of discriminatory treatment, attempt conciliation, and refer enforcement actions to the Department of Justice where necessary."}, "33": {"bill_id": 1669096, "number": "HB56", "change_hash": "9a39c3e493ec1d9db5b74f70fefa5b7a", "url": "https://legiscan.com/DE/bill/HB56/2023", "status_date": "2023-01-19", "status": 1, "last_action_date": "2023-01-25", "last_action": "Not Worked in Committee", "title": "An Act To Amend Titles 14 And 30 Of The Delaware Code Relating To Tax Treatment Of Certain Student Loan Repayments.", "description": "This Act makes a loan repayment under the Speech Language Pathologist Student Loan Repayment Program, the High Needs Educator Loan Payment Program, and the Mental Health Services Student Loan Repayment Program non-taxable for state income tax purposes."}, "34": {"bill_id": 1668732, "number": "HB57", "change_hash": "4b188d47bbfb3f13cf046b4e053bca6f", "url": "https://legiscan.com/DE/bill/HB57/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Assigned to Environment, Energy & Transportation Committee in Senate", "title": "An Act To Amend Title 21 Of The Delaware Code Relating To Speed Exhibitions, Drag Racing, And Other Speed Contests.", "description": "During the 151st General Assembly, House Bill No. 328 was passed updating the law relating to drag racing and other speed contests. This bill makes a small change to that law by specifying that tag-surrender in lieu of impoundment is available as a penalty only for Delaware-registered vehicles."}, "35": {"bill_id": 1682859, "number": "HB58", "change_hash": "8a49841beb71ce4360a51d4503a4bba0", "url": "https://legiscan.com/DE/bill/HB58/2023", "status_date": "2023-03-22", "status": 4, "last_action_date": "2023-03-22", "last_action": "Signed by Governor", "title": "An Act To Amend The Newark City Charter Relating To The Citys Ability To Borrow Money And Incur Indebtedness.", "description": "This Act amends the City of Newark Charter. Specifically, this Act increases the amount the City can borrow for municipal improvements that are directly assessed against adjoining owners of property from $500,000 to $1,000,000. This Act also exempts any short or long-term debt incurred from receipt of government revolving loan funds from the special referendum requirements set forth in the City Charter. This would allow Council to approve such borrowing directly and would eliminate the cost and time associated with holding a referendum."}, "36": {"bill_id": 1725014, "number": "HB59", "change_hash": "7e2d327aac249362e6b7fe122c682192", "url": "https://legiscan.com/DE/bill/HB59/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-02", "last_action": "Introduced and Assigned to Health & Human Development Committee in House", "title": "An Act To Amend Title 16 Of The Delaware Code Relating To Establishing A Program For The Installation Of Residential Drinking Water Purification Systems.", "description": "This Act establishes a residential drinking water purification system program to be administered through the Department of Health and Social Services."}, "37": {"bill_id": 1668915, "number": "HB60", "change_hash": "e038edcff81297ce827baf4b594922f8", "url": "https://legiscan.com/DE/bill/HB60/2023", "status_date": "2023-01-19", "status": 1, "last_action_date": "2023-03-08", "last_action": "Assigned to Appropriations Committee in House", "title": "An Act To Amend Titles 18, 29, And 31 Relating To Breast Cancer Screening And Diagnostic Procedures.", "description": "This Act requires that all insurance policies issued or renewed in this State include coverage of supplemental and diagnostic breast examinations on terms that are at least as favorable as the coverage of annual screening mammograms. The Act covers all group, blanket, and individual health insurance policies as well as the State employee healthcare plan and Medicaid."}, "38": {"bill_id": 1725302, "number": "HB61", "change_hash": "e9f25519004a551d2160ea19611bf261", "url": "https://legiscan.com/DE/bill/HB61/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Assigned to Housing & Land Use Committee in Senate", "title": "An Act To Amend Title 25 Of The Delaware Code Relating To The Delaware Manufactured Home Relocation Authority.", "description": "The Delaware Manufactured Home Relocation Authority administers the Delaware Manufactured Home Relocation Trust Fund. This Act provides members of the board of directors of the Delaware Manufactured Home Relocation Authority with $100 in compensation for each Board meeting a member attends. This compensation may only be paid from money appropriated by the General Assembly for this purpose."}, "39": {"bill_id": 1725139, "number": "HB62", "change_hash": "b3723b9931a015c03b19753ae07a1c84", "url": "https://legiscan.com/DE/bill/HB62/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-02", "last_action": "Introduced and Assigned to Housing Committee in House", "title": "An Act To Amend Title 9 Of The Delaware Code Relating To The Assessment Of Real Property.", "description": "This Act requires that each county reassess the value of real property in the county at least once every 5 years. The first 5-year period starts when the reassessment currently being conducted by each county is completed."}, "40": {"bill_id": 1725116, "number": "HB63", "change_hash": "9bfdcccff24adec375efd16748480557", "url": "https://legiscan.com/DE/bill/HB63/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To Employment Of Pensioners.", "description": "This bill allows pensioners to earn $50,000 (instead of $40,000) before incurring a $1.00 deduction to their state pension for every $2.00 earned over that amount."}, "41": {"bill_id": 1725282, "number": "HB64", "change_hash": "548b56f8b8167e072d9496c3ba7497f8", "url": "https://legiscan.com/DE/bill/HB64/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-15", "last_action": "Tabled in Committee", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To Health Care Insurance And Retirement Benefits.", "description": "This bill authorizes coverage for the spouse of a survivor who qualified to receive a deceased pensioner&#39;s retirement benefits prior to May 15, 2012."}, "42": {"bill_id": 1672710, "number": "HB65", "change_hash": "f166f127f26549f79b8d8f909ff715e6", "url": "https://legiscan.com/DE/bill/HB65/2023", "status_date": "2023-01-20", "status": 1, "last_action_date": "2023-01-26", "last_action": "Amendment HA 1 to HB 65 - Introduced and Placed With Bill", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To Bereavement Leave.", "description": "According to the Mayo Clinic, miscarriages occur in about 20% of all pregnancies, and generally, in the first 12 weeks. According to the Centers for Disease Control, 1 out of every 100 American pregnancies ends in stillbirth. Black women have a significantly higher risk of miscarrying 43% higher when compared to white women. Black mothers are also more than twice as likely to experience stillbirth compared to Hispanic and white mothers."}, "43": {"bill_id": 1725098, "number": "HB66", "change_hash": "18c5d8fce170f9c5b2124a80255d54a6", "url": "https://legiscan.com/DE/bill/HB66/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-02", "last_action": "Introduced and Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Delaware Public Education Profiles.", "description": "Each year, the Department of Education (Department) issues Delaware Public Education Profiles (Education Profiles), which are available on the Departments website as the Delaware Report Card. The Delaware Report Card website provides data for all Delaware public schools, including charter schools, but can be viewed only on the basis of a selected school or school district. This Act ensures that parents and guardians can easily access and use this data to compare schools and school districts by requiring all of the following:"}, "45": {"bill_id": 1725263, "number": "HB68", "change_hash": "91213beac6f75a3f99376d04bf969a0d", "url": "https://legiscan.com/DE/bill/HB68/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Assigned to Corrections & Public Safety Committee in Senate", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To The Delaware Police Training Program.", "description": "This Act clarifies former HB 148 from the 151st General Assembly by defining the start and end date of the 4 year lookback period that determines if a municipality, governmental unit, the University of Delaware, or Delaware State University is subject to reimbursement for an employees training expenses when the employee is hired by another municipality, governmental unit, the University of Delaware, or Delaware State University."}, "46": {"bill_id": 1725158, "number": "HB69", "change_hash": "916b9ef4831f6e1d06c18aa50ac36c45", "url": "https://legiscan.com/DE/bill/HB69/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Banking, Business, Insurance & Technology Committee in Senate", "title": "An Act To Amend Title 4 Of The Delaware Code Relating To Beer Gardens.", "description": "This Act eliminates the requirement of a daily average of no less than 25 full time employees to operate a beer garden. Beer gardens are presently the only liquor establishments that have a statutory staffing requirement. This Act also includes beer gardens along with taprooms and taverns as establishments the Commissioner may deny a license if an existing same establishment is within 1200 feet, by accessible public road in an incorporated city or town, or 9/10 of a mile in an unincorporated or rural area."}, "47": {"bill_id": 1680980, "number": "HB70", "change_hash": "3f066ce78b8d3141672a428d2d1b4f22", "url": "https://legiscan.com/DE/bill/HB70/2023", "status_date": "2023-01-25", "status": 1, "last_action_date": "2023-01-25", "last_action": "Introduced and Assigned to Judiciary Committee in House", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To The Death Penalty.", "description": "This Act eliminates the death penalty in Delaware. As such, the penalty for a person who is convicted of first-degree murder for an offense that was committed after the persons 18th birthday is imprisonment for the remainder of the persons natural life without benefit of probation or parole or any other reduction."}, "48": {"bill_id": 1724996, "number": "HB71", "change_hash": "536215a362fbc337fac82da8b21e361c", "url": "https://legiscan.com/DE/bill/HB71/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Assigned to Health & Social Services Committee in Senate", "title": "An Act To Amend Title 16 Relating To The Lyme Disease Education Oversight Board.", "description": "This bill clarifies that the goal and function of the Lyme Disease Education Oversight Board includes Lyme Disease and other tick-related diseases. This Act supersedes the previous sunset provision that established the Board in House Bill 291 from the 148th General Assembly (80 Del. Laws c. 402 § 1) and extends the Boards existence until 2032 unless otherwise provided by a subsequent act of the General Assembly."}, "49": {"bill_id": 1725222, "number": "HB72", "change_hash": "d11b175de3787f9243e0c858577d9697", "url": "https://legiscan.com/DE/bill/HB72/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend Title 9 Of The Delaware Code Relating To County Bidding Thresholds.", "description": "This bill raises the public bidding thresholds for procurement of goods, contractual services, professional services and public works contracts by county governments to match the bidding thresholds set forth by the State of Delawares Contracting and Purchasing Advisory Council or otherwise set forth by state law. Section 1 of this bill addresses the bidding thresholds set forth in 9 Del C. § 314. First, this bill removes subsection f, which exempted Kent County from subsection a, which will now apply to all counties. Second, this bill grants Sussex County the same power and authority with respect to sole source procurement, emergency needs, contract performance, multiple source contracting as granted to the State under Chapter 69 of Title 29, an authority already granted to the government of New Castle County and Kent County. Finally, this bill grants Sussex County the same power and authority as Kent County and New Castle County to grant contracts without requesting competitive bids and without awarding such contract to the lowest bidder when such contracts are for engineering, legal or other professional services requiring special skills or training. Section 2 of this bill modifies the procedure by which the Financial Officer of Sussex County may award public contracts and aligns it with the procurement procedure set forth in Section 1 of this bill."}, "50": {"bill_id": 1725034, "number": "HB73", "change_hash": "06cb06bc0cf9891f614e599b3c803fd4", "url": "https://legiscan.com/DE/bill/HB73/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-14", "last_action": "Reported Out of Committee (Labor) in House with 3 Favorable, 6 On Its Merits", "title": "An Act To Amend Title 19 Of The Delaware Code Relating To Civil Actions To Recover Overpaid Unemployment Benefits.", "description": "This Act clarifies that when H.B. 149 of the 150th General Assembly was enacted, removing the 5-year statute of limitations for the Department of Labor to bring civil actions to recover unemployment overpayment debts, the General Assembly intended to entirely remove all statutes of limitations notwithstanding any other debt collection statute of limitations in the law or provided in Title 10 of the Delaware Code. This Act will not apply to overpayment debts that accrue 3 years or more prior to the date of enactment."}, "51": {"bill_id": 1725055, "number": "HB74", "change_hash": "50083625c17ee76929693cd18e4665ec", "url": "https://legiscan.com/DE/bill/HB74/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-02", "last_action": "Introduced and Assigned to Judiciary Committee in House", "title": "An Act To Amend Title 16 Of The Delaware Code Relating To Mandatory Reporting Of Child Abuse.", "description": "This Act abrogates the privilege between priest and penitent in a sacramental confession relating to child abuse and neglect. It requires priests to report child abuse and neglect or to give or accept evidence in a judicial proceeding relating to child abuse or neglect."}, "52": {"bill_id": 1682707, "number": "HB75", "change_hash": "1e33be7bc6582cf4ac65768e363c723f", "url": "https://legiscan.com/DE/bill/HB75/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Introduced in House and Assigned to Appropriations Committee", "title": "An Act Making Appropriations For The Expense Of The State Government For The Fiscal Year Ending June 30, 2024; Specifying Certain Procedures, Conditions And Limitations For The Expenditure Of Such Funds; And Amending Certain Pertinent Statutory Provisions.", "description": "This Bill is the Fiscal Year 2024 Appropriations Act."}, "53": {"bill_id": 1682473, "number": "HB76", "change_hash": "8b977585c966c7c2414686746ad96d65", "url": "https://legiscan.com/DE/bill/HB76/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Introduced in House and Assigned to Appropriations Committee", "title": "An Act Making A One-time Supplemental Appropriation For The Fiscal Year Ending June 30, 2024 To The Office Of Management And Budget.", "description": "Governor&#39;s Recommended One-Time Supplemental Bill"}, "54": {"bill_id": 1729256, "number": "HB77", "change_hash": "b741309b561484a3ad4d58a7a2e764e9", "url": "https://legiscan.com/DE/bill/HB77/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Executive Committee in Senate", "title": "An Act Concurring In A Proposed Amendment To § 3, Article Ii Of The Delaware Constitution Relating To The Residency Of The Members Of The General Assembly.", "description": "This Act is the second leg of a constitutional amendment to the Delaware Constitution that would require legislators to remain domiciled in the districts they represent for the entirety of their term of office. The first leg of this constitutional amendment was House Bill No. 395 of the 151st General Assembly, published in Chapter 362 of Volume 83 of the Laws of Delaware. On passage of this second leg by this General Assembly this amendment will become part of the Delaware Constitution."}, "55": {"bill_id": 1729339, "number": "HB78", "change_hash": "76088eb96b9ba8492f57a48876943066", "url": "https://legiscan.com/DE/bill/HB78/2023", "status_date": "2023-03-07", "status": 1, "last_action_date": "2023-03-07", "last_action": "Introduced and Assigned to Public Safety & Homeland Security Committee in House", "title": "An Act To Amend Title 21 And Title 24 Of The Delaware Code Relating To Catalytic Converters.", "description": "This Act updates the definition of a catalytic converter and limits the purchase or sale of a catalytic converter to a licensed automotive recycler or licensed scrap metal processor, and their respective employees and agents. The Act prohibits minors from selling catalytic converters. The Act specifies the amount of time the catalytic converter must be held before sale as well as what contact information must be obtained from the purchaser and seller as well as identification information on the catalytic converter and requires the information be maintained for 1 year. The Act places a 48 hour hold on payments and limits payment form to checks and limits the time of day and location for the sale of a catalytic converter. The Act requires the licensed sellers to make the purchasers and sellers contact information available to the police. This Act makes a catalytic converter, in violation of this chapter, considered contraband and, possession thereof, subject to seizure and forfeiture. This Act is for the purpose of regulating the purchase and sale of catalytic converters and for the purpose of assisting law enforcement in response to the high level of catalytic converter theft that has occurred in Delaware. This Act also makes technical changes to conform existing law to the standards of the Delaware Legislative Drafting Manual."}, "56": {"bill_id": 1730617, "number": "HB79", "change_hash": "64124f0898997a244833dc9a9b2668b7", "url": "https://legiscan.com/DE/bill/HB79/2023", "status_date": "2023-03-08", "status": 1, "last_action_date": "2023-03-15", "last_action": "Tabled in Committee", "title": "An Act To Amend Title 10 Of The Delaware Code Relating To Delinquency And Criminal Proceedings Involving Children.", "description": "In 2022, the General Assembly passed HB115, which prohibits the criminal prosecution of children under the age of 12 and limits proceeding against a minor as an adult to a narrow set of serious crimes alleged to have been committed by children 16 or older. This Act clarifies that children under 12 may not be arrested or detained pending adjudication, except where the alleged crime is one of the enumerated exceptions, and aligns other language in Title 10 with the limitations on transfer of children from Family to Superior Court."}, "57": {"bill_id": 1725241, "number": "HB80", "change_hash": "dd8d48a17b1a9f79398088628aabda42", "url": "https://legiscan.com/DE/bill/HB80/2023", "status_date": "2023-03-02", "status": 1, "last_action_date": "2023-03-16", "last_action": "Assigned to Appropriations Committee in House", "title": "An Act To Amend Title 31 Of The Delaware Code Relating To Coverage Of Doula Services.", "description": "This Act requires that doula services be covered by Medicaid in Delaware by January 1, 2024. It follows up on HB 343 from the 151st General Assembly which required the Division of Medicaid and Medical Assistance to submit a plan for implementing this coverage, and draws on that completed report."}, "58": {"bill_id": 1731976, "number": "HB81", "change_hash": "85b91f01d0df311e82c5c937d3fb7c5f", "url": "https://legiscan.com/DE/bill/HB81/2023", "status_date": "2023-03-09", "status": 1, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Education) in House with 7 Favorable, 4 On Its Merits", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Charter School Student Transportation.", "description": "This Act makes clear that a school district may deny a request from a charter school to have the school district where the charter school is located to transport students residing in that district. If the school district denies the request, the charter school is to receive the payment provided by the State under existing law."}, "59": {"bill_id": 1740090, "number": "HB82", "change_hash": "70b5d15491124b32dd060603f35640fc", "url": "https://legiscan.com/DE/bill/HB82/2023", "status_date": "2023-03-14", "status": 1, "last_action_date": "2023-03-14", "last_action": "Introduced and Assigned to Administration Committee in House", "title": "An Act To Amend Title 15 Of The Delaware Code Relating To Communication Of Election Information.", "description": "This Act requires the Department of Elections to biennially mail a notice to all registered voters informing the registrant of their polling place and containing the following additional information: a brief description of all available methods of voting; the dates and times on which the general and any primary election will be held; deadlines for voter registration for each election and for party changes before a primary; and a brief outline of procedures and requirements and polling places and early voting sites. If the notice is returned as undeliverable the Department is directed to follow a procedure already set forth in Code for attempting to update and verify voting registration records. The notice is to be mailed not later than 30 days before the state primary election."}, "60": {"bill_id": 1740150, "number": "HB83", "change_hash": "e60d83280135d549042b29a5373f9442", "url": "https://legiscan.com/DE/bill/HB83/2023", "status_date": "2023-03-14", "status": 1, "last_action_date": "2023-03-14", "last_action": "Introduced and Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Oral Health Screenings.", "description": "This Act requires every public school and charter school to provide students enrolled in kindergarten, who have not been seen by a dentist by time of school enrollment, with an oral health screening by the last student attendance day of each school year. Notification to the primary teacher and parent or guardian must be done within 7 school days and a copy of the oral health screening results sent home. A referral to a dentist, if required, will be provided by the Bureau of Oral Health and Dental Services. The Division of Public Health (DPH), through the Delaware Smile Check Program, offers school-based oral screenings, at no cost to the school districts, schools, including charter schools, or the students. This Act takes effect for the 2024-2025 school year."}, "61": {"bill_id": 1742269, "number": "HB84", "change_hash": "8aedc97614b0d80b90f5c91a9f8b372c", "url": "https://legiscan.com/DE/bill/HB84/2023", "status_date": "2023-03-15", "status": 1, "last_action_date": "2023-03-15", "last_action": "Introduced and Assigned to Health & Human Development Committee in House", "title": "An Act To Amend Title 16 Of The Delaware Code Relating To Enforcement Of Laws For Protection And Control Of Animals And Barking Dogs.", "description": "This Act clarifies that police officers shall assist the Office of Animal Welfare and Department of Agriculture, as occasion requires, in enforcement of all laws for protection and control of animals. The Act prohibits the owner or person in possession or control of a dog from allowing the dog to bark for an extended period, defined as continuously for 15 minutes or more, or intermittently for 30 minutes or more. The Act exempts barking dogs if someone is trespassing on private property where the dog is located. The Act also exempts animal shelters, pet stores grooming facilities, veterinary offices and animal clinics. The Act also transfers the authority to impose and collect fines and penalties, for violations of laws relating to protection and control of animals, under this title to the enforcing agency. This Act takes effect on January 1, 2024."}, "63": {"bill_id": 1743650, "number": "HB86", "change_hash": "da11f592eb611f1682585a2a86b847de", "url": "https://legiscan.com/DE/bill/HB86/2023", "status_date": "2023-03-17", "status": 1, "last_action_date": "2023-03-17", "last_action": "Introduced and Assigned to Judiciary Committee in House", "title": "An Act To Amend Titles 13 And 29 Of The Delaware Code Relating To Representation Of Indigent Persons In Civil Proceedings.", "description": "This Act establishes a right to counsel for indigent parents in DSCYF custody proceedings. Parent representation will primarily be provided by a legal services entity contracted with the Family Court, but may also be provided by the Office of Defense Services or a private attorney appointed by the Court."}, "64": {"bill_id": 1743607, "number": "HB87", "change_hash": "834d6813f87ec8239b0c60117aa9f489", "url": "https://legiscan.com/DE/bill/HB87/2023", "status_date": "2023-03-17", "status": 1, "last_action_date": "2023-03-17", "last_action": "Introduced and Assigned to Agriculture Committee in House", "title": "An Act To Amend Title 3 Of The Delaware Code Relating To A Delaware Agricultural Production Insurance Assistance Program.", "description": "This Act establishes the Delaware Agricultural Production Assistance Program. The Program will provide a subsidy of up to 30% of the premium for eligible producers multi-peril crop insurance premium, or whole farm revenue protection premium up to a maximum of $10.00 per acre. The subsidy would be directly paid by the Delaware Department of Agriculture to the Federal Crop Insurance Corporation on behalf of Delaware eligible producers. The Department would administer the Program. The Act requires the Department to provide an annual Report to the Chairs of the House and Senate Agriculture Committees."}, "65": {"bill_id": 1743623, "number": "HB88", "change_hash": "ca861fc2aef165be51ddda86a442fe6f", "url": "https://legiscan.com/DE/bill/HB88/2023", "status_date": "2023-03-17", "status": 1, "last_action_date": "2023-03-17", "last_action": "Introduced and Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Candidacy For School Board Member.", "description": "Under Senate Substitute No. 2 for Senate Bill No. 78 (151st), the Commissioner of Elections (Commissioner) must determine that an individual does not have any disqualifying convictions before the individual can be a candidate for election to a school board. This Act clarifies that an individual who meets the filing deadline for candidates for a school board election are provisional candidates until the Commissioner determines if the individual is eligible to be a candidate and requires the Commissioner to disclose the names of provisional candidates."}, "66": {"bill_id": 1743638, "number": "HB89", "change_hash": "ea3693f0ae64cfdbcf3f031a27398552", "url": "https://legiscan.com/DE/bill/HB89/2023", "status_date": "2023-03-17", "status": 1, "last_action_date": "2023-03-17", "last_action": "Introduced and Assigned to Revenue & Finance Committee in House", "title": "An Act To Amend Title 30 Of The Delaware Code And Chapter 118 Of Volume 83 Of The Laws Of Delaware Relating To Personal Income Taxes.", "description": "Section 1 of this Act increases the standard deduction for personal income tax purposes of resident individuals and spouses of this State for tax years beginning after December 31, 2023. Section 3 of this Act increases the monetary filing thresholds resulting from the increases the standard deduction under Section 1."}, "67": {"bill_id": 1743156, "number": "HB90", "change_hash": "d5e11eaf016d7b43948e35deb253b44b", "url": "https://legiscan.com/DE/bill/HB90/2023", "status_date": "2023-03-16", "status": 1, "last_action_date": "2023-03-16", "last_action": "Introduced and Assigned to Economic Development/Banking/Insurance & Commerce Committee in House", "title": "An Act To Amend Title 6 Of The Delaware Code Relating To Medical Debt.", "description": "This Act requires large health-care facilities to provide information to uninsured patients regarding eligibility and the application process for medical assistance. Information must be provided at the time of service or prior to discharge, and again with each billing statement. When patients receive emergency care, information must be provided within 5 days of discharge."}, "68": {"bill_id": 1747132, "number": "HB91", "change_hash": "e0b4a84ae0cd31c09718b0d7bb8f856d", "url": "https://legiscan.com/DE/bill/HB91/2023", "status_date": "2023-03-24", "status": 1, "last_action_date": "2023-03-24", "last_action": "Introduced and Assigned to Public Safety & Homeland Security Committee in House", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To Offenses Involving Property.", "description": "This Act creates a new offense of Aggravated Criminal Mischief with enhanced penalties (class D felony) applicable when an individual knowingly damages or tampers with critical utility infrastructure intending to disrupt utility services. In recent years, the U.S. Department of Homeland Security (DHS) and the FBI have issued repeated warnings about domestic terrorists and extremist groups targeting critical utility infrastructure. Bulletins issued through DHS National Terrorism Advisory System in 2022 warned of a heightened threat environment based, in part, on continued calls for violence directed at U.S. critical infrastructure. Physical and computerized attacks on electric utility equipment have reached a 10-year high in 2022. Recent attacks in Washington and North Carolina have caused substantial outages and damage to the power grids in both states."}, "69": {"bill_id": 1747036, "number": "HB92", "change_hash": "d7d3d270c103f2db60da26d0404d57f0", "url": "https://legiscan.com/DE/bill/HB92/2023", "status_date": "2023-03-24", "status": 1, "last_action_date": "2023-03-24", "last_action": "Introduced and Assigned to Public Safety & Homeland Security Committee in House", "title": "An Act To Amend Title 21 Of The Delaware Code Relating To Rules Of The Road.", "description": "This Act requires drivers to change lanes or reduce their speed while approaching a stationary vehicle displaying warning signals, including vehicle hazard warning lights, road flares, traffic cones, cautions signs, or any non-vehicular warning signs."}, "71": {"bill_id": 1747083, "number": "HB114", "change_hash": "0c1a27fc8034a015ed0aff23638d6bdf", "url": "https://legiscan.com/DE/bill/HB114/2023", "status_date": "2023-03-24", "status": 1, "last_action_date": "2023-03-24", "last_action": "Introduced and Assigned to Health & Human Development Committee in House", "title": "An Act To Amend Titles 16 And 25 Of The Delaware Code Relating To Recovery Housing.", "description": "Substance use disorder constitutes a severe threat to the health and welfare of the citizens of Delaware. Recovery residences address the needs of individuals in recovery from substance use disorder by providing a safe and healthy living environment and a community of supportive recovering peers to which residents are accountable. Recovery residences support the recovery of individuals with substance use disorder and help prevent relapse, criminal justice system involvement, and overdose. Ensuring the certification of recovery residences according to nationally recognized evidence-based standards protects residents and communities from the harm caused by poorly managed or fraudulent recovery residences."}, "72": {"bill_id": 1651089, "number": "HR1", "change_hash": "bb89b018adc3fdb483dbcbd4a9509879", "url": "https://legiscan.com/DE/bill/HR1/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-10", "last_action": "Passed In House by Voice Vote", "title": "Relating To The Election Of The Speaker Of The House Of Representatives.", "description": "This resolution resolves that Peter C. Schwartzkopf be elected as Speaker of the House of Representatives."}, "73": {"bill_id": 1650885, "number": "HR2", "change_hash": "bb3bc9f5192c15fd53b78188851afebe", "url": "https://legiscan.com/DE/bill/HR2/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-10", "last_action": "Passed In House by Voice Vote", "title": "Relating To The Election Of Officers Of The House Of Representatives.", "description": "This Resolution designates Richard L. Puffer as Chief Clerk of the House of Representatives and Dolores Michels as Assistant Chief Clerk of the House of Representative to serve at the pleasure of the House of Representatives."}, "74": {"bill_id": 1650603, "number": "HR3", "change_hash": "d8b0a85e80cdcce88e2ca18517dfc729", "url": "https://legiscan.com/DE/bill/HR3/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-10", "last_action": "Passed In House by Voice Vote", "title": "Relating To The Temporary Rules Of The House Of Representatives Of The 152nd General Assembly.", "description": "This resolution creates the Temporary Rules of the House of Representatives."}, "75": {"bill_id": 1650814, "number": "HR4", "change_hash": "6788f856557518c1c045475b3c0b9e94", "url": "https://legiscan.com/DE/bill/HR4/2023", "status_date": "2023-01-10", "status": 1, "last_action_date": "2023-01-10", "last_action": "Passed In House by Voice Vote", "title": "Relating To Permanent Procedures Of The House Of Representatives Of The 152nd General Assembly Of The State Of Delaware For Ethics Violations.", "description": "This Resolution sets forth the rules of procedure for ethics violations in the House of Representatives."}, "77": {"bill_id": 1682549, "number": "HR6", "change_hash": "820eb19173a9e23736d4a3762e55d074", "url": "https://legiscan.com/DE/bill/HR6/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Passed In House by Voice Vote", "title": "Establishing An Internet Sports Lottery Legislative Working Group.", "description": "This House Resolution creates an Internet Sports Lottery Legislative Working Group to evaluate and make recommendations on authorizing an internet sports lottery in Delaware."}, "78": {"bill_id": 1740028, "number": "HR7", "change_hash": "9899223db64c30533c0e9ce3a8e8baf0", "url": "https://legiscan.com/DE/bill/HR7/2023", "status_date": "2023-03-14", "status": 1, "last_action_date": "2023-03-14", "last_action": "Introduced and Assigned to Rules Committee in House", "title": "Relating To The Temporary Rules Of The House Of Representatives Of The 152nd General Assembly Of The State Of Delaware.", "description": "This amendment to the House Rules requires a three-fifths vote of the members of the House in order to suspend the House Rules."}, "79": {"bill_id": 1742369, "number": "HR8", "change_hash": "15b8a41ae48ece6227d8a39e9750f525", "url": "https://legiscan.com/DE/bill/HR8/2023", "status_date": "2023-03-15", "status": 1, "last_action_date": "2023-03-15", "last_action": "Introduced and Assigned to Rules Committee in House", "title": "Amending The Temporary Rules Of The House Of Representatives Of The 152nd General Assembly.", "description": "This Resolution amends the Temporary Rules of the House of Representatives of the 152nd General Assembly to require legislation assigned to a committee be acted on by the committee unless the House prime sponsor or floor manager of the legislation requests the committee to not act on the legislation. If the legislation is not acted on by the committee within 12 legislative days, the legislation must be placed on the agenda for the committees next meeting time assigned under Rule 33(a) or a date agreed to by the Chair of the committee and the House prime sponsor or floor manager of the legislation and must be heard and acted on at that meeting. The Chief Clerk shall send notice of legislation reaching its twelfth legislative day in committee without action to the Chair of the committee and the House prime sponsor or floor manager of the legislation."}, "80": {"bill_id": 1656499, "number": "HCR1", "change_hash": "7cd51bc92e8c15f6bf4506adbeab499c", "url": "https://legiscan.com/DE/bill/HCR1/2023", "status_date": "2023-01-12", "status": 2, "last_action_date": "2023-01-12", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing The Month Of January 2023 As &quot;human Trafficking Awareness Month&quot; In Delaware.", "description": "This Concurrent Resolution recognizes January 2023 as Human Trafficking Awareness Month in Delaware"}, "81": {"bill_id": 1666106, "number": "HCR2", "change_hash": "a8f0256fef61f2c8136185c2790080a4", "url": "https://legiscan.com/DE/bill/HCR2/2023", "status_date": "2023-01-24", "status": 2, "last_action_date": "2023-01-24", "last_action": "Passed By Senate. Votes: 15 YES 2 NO 4 NOT VOTING", "title": "Commemorating January 22nd, 2023 As The 50th Anniversary Of The United States Supreme Court Ruling In Roe V. Wade", "description": "This Concurrent Resolution commemorates January 22nd, 2023 as the 50th Anniversary of the United States Supreme Court ruling in Roe v. Wade."}, "82": {"bill_id": 1665594, "number": "HCR3", "change_hash": "8aacecc615655acd931e1ac05fe049eb", "url": "https://legiscan.com/DE/bill/HCR3/2023", "status_date": "2023-01-18", "status": 2, "last_action_date": "2023-01-18", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Designating January 23, 2023, As &quot;maternal Health Awareness Day&quot; In The State Of Delaware.", "description": "This House Concurrent Resolution designates January 23, 2023, as &quot;Maternal Health Awareness Day&quot; in the State of Delaware."}, "83": {"bill_id": 1680476, "number": "HCR4", "change_hash": "30b2e45f989bcc088336aba4147f20d8", "url": "https://legiscan.com/DE/bill/HCR4/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Recognizing February 12, 2023 As &quot;world Cholangiocarcinoma Day&quot; In Delaware.", "description": "Cholangiocarcinoma, also known as bile duct cancer, is a cancer that occurs in the bile ducts in or outside the liver. This Resolution recognizes February 12, 2023 as &quot;World Cholangiocarcinoma Day&quot; in Delaware."}, "84": {"bill_id": 1679981, "number": "HCR5", "change_hash": "247d1b58a2775ce0eb01810530c4eda8", "url": "https://legiscan.com/DE/bill/HCR5/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Designating January 22-28, 2023 As Certified Registered Nurse Anesthetists&#39; Week In The State Of Delaware.", "description": "This concurrent resolution designates January 22-28, 2023 as Certified Registered Nurse Anesthetists&#39; (CRNA) Week in the State of Delaware."}, "85": {"bill_id": 1680230, "number": "HCR6", "change_hash": "7b07f16cf31e989df16fc39e62c48d9b", "url": "https://legiscan.com/DE/bill/HCR6/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Recognizing Delaware Saves Week 2023.", "description": "This Concurrent Resolution recognizes the week of February 27th as Delaware Saves Week."}, "86": {"bill_id": 1682779, "number": "HCR7", "change_hash": "2aed12abfd504820f0480d9e070048b2", "url": "https://legiscan.com/DE/bill/HCR7/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing January 27th, 2023 As International Holocaust Remembrance Day.", "description": "This Concurrent Resolution recognizes January 27th, 2023 as International Holocaust Remembrance Day."}, "87": {"bill_id": 1729175, "number": "HCR8", "change_hash": "91c0123da4bfcd06456e6af24cfa23a7", "url": "https://legiscan.com/DE/bill/HCR8/2023", "status_date": "2023-03-07", "status": 1, "last_action_date": "2023-03-07", "last_action": "Passed In House by Voice Vote", "title": "Requesting The Delaware State Fire School To Develop A Program For The Disposal Of Aqueous Film Forming Foam Currently In The Possession Of The State Of Delaware Fire Companies And Departments.", "description": "This Concurrent Resolution requests the Delaware State Fire School propose a plan for the safe disposal of aqueous film forming foam (AFFF), due to the per- and polyfluoroalkyl substances (PFAS) they contain from Delaware Fire Departments and companies. The Delaware State Fire School is to provide a report to the President Pro Tempore, the Speaker of the House of Representatives, the Office of the Controller General, and the Director of the Office of Management and Budget. The report is also to include the cost of disposal and the cost to obtain safe, viable, alternatives. The concept would be to fund this disposal foam and remove it from the Delaware Fire Service by a one-time exchange of this foam voluntarily and allowing the Fire Service the opportunity to replace AFFF with a new compliant supply at no cost to them. This report would establish a cost line item for the 2023-24 Bond Bill."}, "88": {"bill_id": 1729007, "number": "HCR9", "change_hash": "247ee794feb5a00321ad0d4535bafe80", "url": "https://legiscan.com/DE/bill/HCR9/2023", "status_date": "2023-03-07", "status": 2, "last_action_date": "2023-03-07", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Designating March 2023 As Womens History Month In Delaware And Honoring The Leadership And Achievements Of Women Throughout Our States Rich History.", "description": "This resolution designates March 2023 as Womens History Month in Delaware to raise awareness and celebrate the contributions of women in our society, and for the greater good of our nation."}, "89": {"bill_id": 1683025, "number": "HCR10", "change_hash": "31618efed9409432da5fb2c22f997581", "url": "https://legiscan.com/DE/bill/HCR10/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Honoring The Leadership And Achievements Of African Americans And Urging The Celebration Of Black History Month.", "description": "This House Concurrent Resolution honors and recognizes the leadership and achievements of African Americans and urges the celebration of Black History Month."}, "90": {"bill_id": 1732291, "number": "HCR11", "change_hash": "b9c816c93dc1e9b343aaf32a477a227b", "url": "https://legiscan.com/DE/bill/HCR11/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing March 2023 As Social Work Month In The State Of Delaware.", "description": "This Resolution recognizes the pertinent work of social workers throughout Delaware and the entire country, encourages the creation and expansion of Social Work programs, and recognizes March 2023 as Social Work Month in the State of Delaware."}, "91": {"bill_id": 1730779, "number": "HCR12", "change_hash": "452ccb085bf155d4f54560233ecbf79e", "url": "https://legiscan.com/DE/bill/HCR12/2023", "status_date": "2023-03-08", "status": 2, "last_action_date": "2023-03-08", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Designating March 8th, 2023 As International Womens Day In Delaware.", "description": "This Concurrent Resolution designates March 8th, 2023 as International Womens Day in Delaware."}, "92": {"bill_id": 1730457, "number": "HCR13", "change_hash": "87b163ab8a3190ab8ae323f07c8155f5", "url": "https://legiscan.com/DE/bill/HCR13/2023", "status_date": "2023-03-08", "status": 2, "last_action_date": "2023-03-08", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Recognizing The Month Of March 2023 As National Developmental Disability Month In Delaware.", "description": "This Concurrent Resolution recognizes the month of March 2023 as &quot;National Developmental Disability Month&quot; in Delaware."}, "93": {"bill_id": 1732618, "number": "HCR14", "change_hash": "b399ca32775f9226392f8f0290b7f306", "url": "https://legiscan.com/DE/bill/HCR14/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing March 10th As Harriet Tubman Day.", "description": "This Concurrent Resolution recognizes March 10th as &quot;Harriet Tubman Day&quot;."}, "94": {"bill_id": 1739963, "number": "HCR15", "change_hash": "e4b51b05220089f93ea7d6e8c72cc8ec", "url": "https://legiscan.com/DE/bill/HCR15/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Designating March 14, 2023 As &quot;equal Pay Day&quot; In The State Of Delaware.", "description": "This House Concurrent Resolution designates March 14, 2023 as &quot;Equal Pay Day&quot; in the State of Delaware."}, "95": {"bill_id": 1739995, "number": "HCR16", "change_hash": "a33370fb3e7401145aad5e76c946c1fd", "url": "https://legiscan.com/DE/bill/HCR16/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Directing The Delaware Department Of Education To Issue A Report Analyzing The Benefits Of Virtual Learning In A Post-covid Learning Environment.", "description": "This Concurrent Resolution directs the Department of Education to issue a report assessing the advantages and disadvantages of virtual learning for kindergarten through grade 12 students in a post-COVID learning environment, to include a review of all current virtual learning options in the State."}, "96": {"bill_id": 1743244, "number": "HCR17", "change_hash": "513e5bfde9784c175bcc27de81684aa4", "url": "https://legiscan.com/DE/bill/HCR17/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing March 21, 2023 &quot;rock Your Socks For World Down Syndrome Day.&quot;", "description": "This House Concurrent Resolution designates the 21st day of the Month of March, 2023 as Rock Your Socks for World Down Syndrome Day and celebrates the beauty and contributions that people with Down Syndrome make in Delaware."}, "97": {"bill_id": 1743343, "number": "HCR18", "change_hash": "845277bc4957986f8ea35ee3fb2a9c5f", "url": "https://legiscan.com/DE/bill/HCR18/2023", "status_date": "2023-03-16", "status": 6, "last_action_date": "2023-03-16", "last_action": "Defeated By House. Votes: 11 YES 26 NO 2 NOT VOTING 2 ABSENT", "title": "Designating March 23, 2023 As National Atheists Day In Delaware.", "description": "This Concurrent Resolution designates March 23, 2023 as National Atheists&#39; Day in Delaware."}, "98": {"bill_id": 1743308, "number": "HCR19", "change_hash": "7b8f878aeb8ac81b4acf0dc3ce277187", "url": "https://legiscan.com/DE/bill/HCR19/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing The Easterseals/cai Volleyball Challenge And The Volleyball Ambassador, Carolyn Jerzak In The 17th Year Of Democrat And Republican Team Participation.", "description": "This resolution recognizes the Easterseals/CAI Volleyball Challenge occurring March 25 at William Penn High School and March 26 at Delaware State University, an event that raises funds for an organization providing services and support to Delawareans with disabilities and senior citizens and their families."}, "100": {"bill_id": 1743187, "number": "HCR25", "change_hash": "1e06b5f0f47b8fb2e8ff051aa5db0c41", "url": "https://legiscan.com/DE/bill/HCR25/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Commemorating The 25th Anniversary Of The Good Friday Agreement And Celebration Of St. Patrick&#39;s Day.", "description": "This concurrent resolution commemorates the 25th Anniversary of the Good Friday Agreement and celebrates St. Patrick&#39;s Day."}, "101": {"bill_id": 1665934, "number": "HCR40", "change_hash": "1d4d9bae52329c3bfa7f3648bb090326", "url": "https://legiscan.com/DE/bill/HCR40/2023", "status_date": "2023-01-24", "status": 2, "last_action_date": "2023-01-24", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Extending The Work Of The Delaware Justice 40 Oversight Committee.", "description": "This Resolution reauthorizes the work of and extends the final report deadline for the Delaware Justice 40 Oversight Committee."}, "102": {"bill_id": 1680857, "number": "HJR1", "change_hash": "39b04bc543dc7cd3ff7a5f2027f82c88", "url": "https://legiscan.com/DE/bill/HJR1/2023", "status_date": "2023-03-16", "status": 3, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Establishing A Task Force To Improve School-based Mentoring And Literacy Education Efforts In Delaware.", "description": "This Joint Resolution creates a bi-partisan School Mentoring and Literacy Task Force, designed to expand volunteer mentoring and literacy education in Delaware schools ,with a report due on June 1, 2023."}, "103": {"bill_id": 1669283, "number": "SB1", "change_hash": "16fbd20a49e15ee226d64b5cab5161f6", "url": "https://legiscan.com/DE/bill/SB1/2023", "status_date": "2023-03-23", "status": 1, "last_action_date": "2023-03-23", "last_action": "was introduced and adopted in lieu of SB 1", "title": "An Act To Amend Title 25 Of The Delaware Code Relating To The Residential Landlord-tenant Code.", "description": "This Act is a substitute for Senate Bill No. 1. Like Senate Bill No. 1, this Act creates a right to representation for tenants in evictions and other landlord-tenant actions."}, "104": {"bill_id": 1732729, "number": "SB3", "change_hash": "ae95891b1c377ec35ca66359de64ad8f", "url": "https://legiscan.com/DE/bill/SB3/2023", "status_date": "2023-03-09", "status": 1, "last_action_date": "2023-03-09", "last_action": "Introduced and Assigned to Executive Committee in Senate", "title": "An Act Proposing An Amendment To Article V Of The Delaware Constitution Relating To Voting.", "description": "This Act is the first leg of a constitutional amendment to eliminate the limitations on when an individual may vote absentee and authorizes the General Assembly to enact general laws providing the circumstances, rules, and procedures for absentee voting in this State. This Act is in response to the Supreme Courts decision in Albence v. Higgins, 2022 Del. LEXIS 377 (Del. 2022)."}, "105": {"bill_id": 1724165, "number": "SB4", "change_hash": "4690b5d47d3d719656944fe41070ebc9", "url": "https://legiscan.com/DE/bill/SB4/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-01", "last_action": "Introduced and Assigned to Corrections & Public Safety Committee in Senate", "title": "An Act To Amend Title 11, Title 13, And Title 29 Of The Delaware Code Relating To The Criminal Justice System, Including Probation.", "description": "This Act modernizes Delawares criminal justice system, especially its probation system, by doing the following:"}, "107": {"bill_id": 1672245, "number": "SB24", "change_hash": "b174713de837314d7aadb74de5003c20", "url": "https://legiscan.com/DE/bill/SB24/2023", "status_date": "2023-01-20", "status": 1, "last_action_date": "2023-01-20", "last_action": "Introduced and Assigned to Education Committee in Senate", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To The Seizure Safe Schools Act.", "description": "This Act requires all schools with a student diagnosed with a seizure disorder to train at least 2 employees in the administration of rescue medication or treatment prescribed to treat a student with a seizure disorder. Training includes the administration of a manual dose of prescribed electrical stimulation using a Vagus Nerve Stimulator magnet. A school nurse employed full-time by a school is not required to meet these training requirements but may serve as 1 of the 2 required employees that are trained in the administration of seizure rescue medications."}, "108": {"bill_id": 1651651, "number": "SB26", "change_hash": "62c3d272b6d92712d4b4fc8ac7674bac", "url": "https://legiscan.com/DE/bill/SB26/2023", "status_date": "2023-01-24", "status": 2, "last_action_date": "2023-01-25", "last_action": "Assigned to Administration Committee in House", "title": "An Act Concurring In A Proposed Amendment To Article V Of The Delaware Constitution Relating To Elections.", "description": "This Act is the second leg of a constitutional amendment that would update the minimum voting age in the Delaware Constitution from twenty-one years to eighteen years. The first leg of this constitutional amendment was Senate Bill No. 294 of the 151st General Assembly, which became Chapter 350 of Volume 83 of the Laws of Delaware. On passage of this second leg by this General Assembly this amendment will become part of the Delaware Constitution."}, "109": {"bill_id": 1652071, "number": "SB27", "change_hash": "20a6524c6dd9bdcc3438cd8293f6aa6a", "url": "https://legiscan.com/DE/bill/SB27/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-03-14", "last_action": "Reported Out of Committee (Labor) in House with 9 Favorable, 1 On Its Merits", "title": "An Act To Amend Title 10 Of The Delaware Code Relating To Limitation Of Actions For Work, Labor, Or Personal Services.", "description": "This Act increases the statute of limitations for filing an action for recovery upon a claim for unpaid wages from 1 year to 2 years, making it consistent with the statute of limitations under the federal Fair Labor Standards Act, 29 U.S.C. §§ 201, et seq. Many employees who are terminated spend the first period of unemployment attempting to secure other employment. After this focus on finding employment ends, 1 year may have passed or be about to pass, preventing employees who are owed wages from a previous employer from seeking legal redress."}, "110": {"bill_id": 1657318, "number": "SB28", "change_hash": "00e76d78f21a1555e0a25340b047edee", "url": "https://legiscan.com/DE/bill/SB28/2023", "status_date": "2023-01-26", "status": 4, "last_action_date": "2023-01-26", "last_action": "Signed by Governor", "title": "An Act To Amend Title 24 Of The Delaware Code And Chapter 420 Of Volume 83 Of The Laws Of Delaware Relating To Dentistry And Dental Hygiene.", "description": "This Act provides that if a dentist holds a community health license to care for underserved populations through a federally-qualified health center or a government-operated dental clinic and continues to practice in compliance with § 1132B(b) of Title 24 of the Delaware Code, the dentists license is renewable and shall be renewed biennially by the State Board of Dentistry and Dental Hygiene."}, "111": {"bill_id": 1656965, "number": "SB29", "change_hash": "6c6f624ec3cea106c9b9c00adee77434", "url": "https://legiscan.com/DE/bill/SB29/2023", "status_date": "2023-01-26", "status": 4, "last_action_date": "2023-01-26", "last_action": "Signed by Governor", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The State Employee Benefits Consolidation Act.", "description": "To foster sustainability in state retiree healthcare benefits and the development of a plan for strong benefits beyond the current Medicare Supplement plan offered through January 1, 2024, this Act does all of the following:"}, "112": {"bill_id": 1667826, "number": "SB30", "change_hash": "21f8ed02ae86fba21ee7767b6f385dd0", "url": "https://legiscan.com/DE/bill/SB30/2023", "status_date": "2023-01-18", "status": 1, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Agriculture) in Senate with 1 Favorable, 6 On Its Merits", "title": "An Act To Amend Title 7 Of The Delaware Code Relating To Silviculture.", "description": "This Act clarifies what constitutes a sawmill under Delaware law and adds definitions related to agriculture and silviculture. This Act recognizes forest products as unadulterated materials and makes clear their importance to support a thriving industry that maintains sustainable and healthy forests. This Act also makes technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual."}, "113": {"bill_id": 1667611, "number": "SB31", "change_hash": "77158fc4a7442ddc1ed5256cd05cf7d9", "url": "https://legiscan.com/DE/bill/SB31/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Health & Human Development) in House with 9 On Its Merits", "title": "An Act To Amend Title 18 Of The Delaware Code Relating To Primary Care Coverage.", "description": "This Act corrects a technical error in SB 227 (149th General Assembly) by establishing requirements for group and blanket health insurance plans that align with existing requirements for individual and State employee health insurance plans. As introduced, SB 227 specified that coverage for chronic care management under all 3 of these health insurance plan types cannot be subject to patient deductibles, copayments, or fees. Senate Amendment 1 to SB 227 made various intentional changes to SB 227 but also accidentally deleted the line that applied this chronic care management requirement to group and blanket plans. SB 227, as amended, passed both chambers unanimously. As a result, since January 1, 2019, there has been an unintentional difference in the requirements between the plan types. This Act corrects that divergence."}, "114": {"bill_id": 1667755, "number": "SB32", "change_hash": "92429140501be2c1bf1039a66b2b7e26", "url": "https://legiscan.com/DE/bill/SB32/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-15", "last_action": "Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Education.", "description": "The bill adds visual impairments including blindness to the list of programs to be conducted on a 12-month schedule."}, "115": {"bill_id": 1667683, "number": "SB33", "change_hash": "6db0dbff085ac849f5a9ff5363e409a2", "url": "https://legiscan.com/DE/bill/SB33/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-15", "last_action": "Assigned to Judiciary Committee in House", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Department Of Services For Children, Youth And Their Families.", "description": "This bill adopts a key recommendation of the Child Protection Accountability Commission Caseloads and Workloads final report approved on November 20, 2019, that Division of Family Services (DFS) caseload standards be reduced from 18 to 12 families per worker. Due to the volume of work generated by a caseload of 18 families, workers are significantly restricted in the time they can spend on critical case activities such as family engagement, assessment of safety, and face-to-face contact with children and families."}, "116": {"bill_id": 1681110, "number": "SB34", "change_hash": "38ad0cc9686618ea15f87eaa7a77fc7f", "url": "https://legiscan.com/DE/bill/SB34/2023", "status_date": "2023-01-25", "status": 1, "last_action_date": "2023-03-15", "last_action": "Reported Out of Committee (Judiciary) in Senate with 6 Favorable", "title": "An Act To Amend Title 24 And Title 28 Of The Delaware Code Relating To Public Accommodations.", "description": "On March 1, 1875, the federal Civil Rights Act was enacted. Following the end of the Civil War and the adoption of the Thirteenth and Fourteenth Amendments, the goal of the Civil Rights Act of 1875 was to guarantee Blacks equal treatment in places of public accommodation and on public transportation."}, "117": {"bill_id": 1672514, "number": "SB35", "change_hash": "827d986bf5c8765621d9906519c55d43", "url": "https://legiscan.com/DE/bill/SB35/2023", "status_date": "2023-01-26", "status": 4, "last_action_date": "2023-01-26", "last_action": "Signed by Governor", "title": "An Act To Amend The Laws Of Delaware Relating To The Bond And Capital Improvements Act Of The State Of Delaware And Certain Of Its Authorities For The Fiscal Year Ending June 30, 2023.", "description": "This Act amends the Fiscal Year 2023 Bond and Capital Improvements Act to (1) authorize the use of School Safety and Security Funds for school extracurricular activities; (2) authorize local funding to support Enhanced Minor Capital Improvements and the remediation of lead contaminated drinking water infrastructures; (3) adjust the procurement thresholds for the issuance of formal bids or RFPs; (4) authorize the Department of Transportation to use Community Transportation Funds for one-time reimbursements for various projects; (5) make changes to the Criminal Legal System Imposed Debt Study Group; (6) authorize the Department of Transportation Reprogramming Transfer; (7) authorize funding to complete the facility drainage project of Absalom Jones Performing Arts Center; (8) authorize the donation of the Division of Communications Shelter to the University of Delaware; (9) authorize the use of funding until the new Troop 6 facility is complete and available for occupancy; (10) allow New Castle County Vocational School District to proceed with construction of new athletic fields; (11) authorize the use of Irrigation System Conversion funds to reimburse a new poultry house demolition assistance program; (12) clarify the calculation of 3% limit of GF net revenue estimate for finance capital projects is applied to revenues identified in the revenue resolution for the fiscal year of the budget being adopted; (13) authorize Fort DuPont Redevelopment and Preservation Corporation to use funds for capital projects; (14) authorize Municipal Infrastructure Funds to be used for the North Bayshore Drainage Improvements; (15) authorize the Office of Management and Budget to engage in a pilot program to include Community Workforce Agreements; (16) authorize the Department of Transportation to engage in a Community Workforce Agreement for no more than two large public works projects; and (17) require a report from the Office of Management and Budget regarding State Facilities Market Pressure."}, "118": {"bill_id": 1683535, "number": "SB36", "change_hash": "818abc1e8857a05a6c70294751448c4b", "url": "https://legiscan.com/DE/bill/SB36/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Introduced and Assigned to Corrections & Public Safety Committee in Senate", "title": "An Act To Amend Title 11 And Title 16 Of The Delaware Code Relating To 911 Dispatchers.", "description": "This Act provides a definition for 911 Dispatchers. While referenced in other sections of the Code, including being identified as a first responder in § 4319 of Title 11 for purposes of confidentiality of communications by first responders for critical incident stress management services, Dispatchers have not otherwise been defined."}, "119": {"bill_id": 1683200, "number": "SB37", "change_hash": "3f1255b34ecbfef0802ff0c505de5856", "url": "https://legiscan.com/DE/bill/SB37/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Introduced and Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The State Dog.", "description": "This act designates rescue dogs as the official state dog."}, "120": {"bill_id": 1683420, "number": "SB38", "change_hash": "627eb7cd1288c0bb655da5a6a406da55", "url": "https://legiscan.com/DE/bill/SB38/2023", "status_date": "2023-03-15", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Administration Committee in House", "title": "An Act Concurring In An Proposed Amendment To § 1, Article Xvi Of The Delaware Constitution Relating To The Procedure For Notice To The Public Of A Proposed Amendment To The Delaware Constitution.", "description": "This Act is the second leg of an constitutional amendment to the Delaware Constitution to enable the General Assembly to designate who is responsible for providing notice of a proposed amendment to the Constitution and how the notice is disseminated. This change gives the General Assembly flexibility in the dissemination of the notice, particularly as technology advances. This Act also changes the timeframe of dissemination from 3 months to between 120 and 90 days. The first leg of the constitutional amendment was House Bill No. 130 of the 151st General Assembly, which became Chapter 147 of Volume 83 of the Laws of Delaware. On passage of this second leg by this General Assembly this amendment will become part of the Delaware Constitution"}, "121": {"bill_id": 1683650, "number": "SB39", "change_hash": "33d3554d79e054d6a8090d2ddeed3740", "url": "https://legiscan.com/DE/bill/SB39/2023", "status_date": "2023-03-15", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Administration Committee in House", "title": "An Act Concurring In A Proposed Amendment To Article Ii Of The Delaware Constitution Relating To Limitations On The Time And Frequency Of Legislative Sessions.", "description": "This Act is the second leg of a constitutional amendment that would prohibit the regular session of the General Assembly from extending beyond 5:00 p.m. on the last day of June, unless the session is recalled by the Governor or the presiding officers of both Houses. This changes the time beyond which a regular session of the General Assembly may not extend from midnight on June 30 to 5:00 p.m., which changes the time at which the presiding officers of both Houses must act to recall the General Assembly into special session. This means the General Assembly no longer has to remain in session until midnight to recall itself into special session. The first leg of this constitutional amendment was House Bill 411 of the 151st General Assembly published in Chapter 324 of Volume 83 of the Laws of Delaware. On passage of this second leg by this General Assembly this amendment will become part of the Delaware Constitution."}, "122": {"bill_id": 1682629, "number": "SB40", "change_hash": "c82aef1a47e0e2f8d973ba8830dbcf12", "url": "https://legiscan.com/DE/bill/SB40/2023", "status_date": "2023-01-26", "status": 1, "last_action_date": "2023-01-26", "last_action": "Introduced and Assigned to Capital Improvement Committee in Senate", "title": "A Bond And Capital Improvements Act Of The State Of Delaware And Certain Of Its Authorities For The Fiscal Year Ending June 30, 2024; Authorizing The Issuance Of General Obligation Bonds Of The State; Appropriating Funds From The Transportation Trust Fund; Authorizing The Issuance Of Revenue Bonds Of The Delaware Transportation Authority; Appropriating Special Funds Of The Delaware Transportation Authority; Appropriating General Funds Of The State; Reprogramming Certain Funds Of The State; Specifying Certain Procedures, Conditions And Limitations For The Expenditure Of Such Funds; And Amending Certain Statutory Provisions.", "description": "This Bill is the Fiscal Year 2024 Bond and Capital Improvements Act."}, "123": {"bill_id": 1683311, "number": "SB41", "change_hash": "1a5a23b1a77701d3f909d302adbaa804", "url": "https://legiscan.com/DE/bill/SB41/2023", "status_date": "2023-03-15", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Administration Committee in House", "title": "An Act Concurring In Proposed Amendments To The Delaware Constitution Relating To Technical Corrections.", "description": "This Act is the second leg of an amendment to the Delaware Constitution to make necessary technical corrections identified by the General Assembly&#39;s Division of Research. The first leg of this constitutional amendment was House Bill 452 of the 151st General Assembly published in Chapter 351 of Volume 83 of the Laws of Delaware. On passage of this second leg by this General Assembly this amendment will become part of the Delaware Constitution. Specifically, these technical corrections consist of the following:"}, "124": {"bill_id": 1684635, "number": "SB42", "change_hash": "35226dbfb7d93da8b8631923e498bca1", "url": "https://legiscan.com/DE/bill/SB42/2023", "status_date": "2023-01-27", "status": 1, "last_action_date": "2023-03-16", "last_action": "Reported Out of Committee (Finance) in Senate with 5 On Its Merits", "title": "An Act To Amend Title 18 And Title 29 Of The Delaware Code Relating To Burial Benefits.", "description": "Section 1 of this Act increases the burial benefit for individuals eligible to receive a pension under the State Employees Pension Plan (Chapter 55 of Title 29 of the Delaware Code) from $7,000 to $10,000. The burial benefit has not been increased since 2001 (See 73 Del. Laws, c. 146, § 5)."}, "125": {"bill_id": 1713715, "number": "SB43", "change_hash": "7c11943daaf91e4e1f159a14672d7c94", "url": "https://legiscan.com/DE/bill/SB43/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-03-08", "last_action": "Assigned to Finance Committee in Senate", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To The Display Of Human Trafficking Public Awareness Signs.", "description": "This Act adds additional State facilities and categories of establishments to § 787 of Title 11 which would be required to display public awareness signs about human trafficking. The additional State facilities and categories are as follows:"}, "126": {"bill_id": 1713573, "number": "SB44", "change_hash": "8aa62072535f663e2caa475c67a35b90", "url": "https://legiscan.com/DE/bill/SB44/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-03-15", "last_action": "Assigned to Finance Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Office Of New Americans.", "description": "This Act establishes the Office of New Americans to help improve the lives and economic prosperity of new Americans who come to Delaware and of all Delawareans generally."}, "127": {"bill_id": 1713646, "number": "SB45", "change_hash": "020ff27acf9a4092b7b1157052c738fb", "url": "https://legiscan.com/DE/bill/SB45/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-02-17", "last_action": "Introduced and Assigned to Labor Committee in Senate", "title": "An Act To Amend Title 19 Of The Delaware Code Relating To Unemployment Compensation.", "description": "Under current Delaware law, if a labor dispute constitutes a lockout, employees are immediately eligible for unemployment benefits. Additionally, current law permits an individual to collect unemployment benefits beginning the third week of a labor dispute, other than a lockout."}, "128": {"bill_id": 1713223, "number": "SB46", "change_hash": "14c5f45e46347e6e442e5a734c07aaf7", "url": "https://legiscan.com/DE/bill/SB46/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-02-17", "last_action": "Introduced and Assigned to Judiciary Committee in Senate", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To Missing Persons.", "description": "According to the National Center for Missing and Exploited Children, an estimated 800,000 children are reported missing each year."}, "129": {"bill_id": 1713293, "number": "SB47", "change_hash": "50ff024636dc175fe533b20645368890", "url": "https://legiscan.com/DE/bill/SB47/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-17", "last_action": "Assigned to Sunset Committee (Policy Analysis & Government Accountability) Committee in House", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Council On Libraries.", "description": "This Act is the result of the Joint Legislative Oversight and Sunset Committee&#39;s review of the Council on Libraries (&quot;Council&quot;). This Act updates the Council&#39;s membership composition, defines quorum, and adds other standard provisions, including member compensation and removal."}, "130": {"bill_id": 1713782, "number": "SB48", "change_hash": "787bd42b8f09e349426626387e2b5322", "url": "https://legiscan.com/DE/bill/SB48/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-17", "last_action": "Assigned to Sunset Committee (Policy Analysis & Government Accountability) Committee in House", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Delaware Public Library Technology Assistance Act.", "description": "This Act is a result of the Joint Legislative Oversight and Sunset Committee&#39;s review of the Council on Libraries. This Act repeals the Delaware Public Library Technology Assistance Act because Delaware Division of Libraries no longer issues technology grants."}, "131": {"bill_id": 1713365, "number": "SB49", "change_hash": "a4241204964f989da4ec9e320d09eb86", "url": "https://legiscan.com/DE/bill/SB49/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-15", "last_action": "Assigned to Sunset Committee (Policy Analysis & Government Accountability) Committee in House", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Governor&#39;s Commission On Community And Volunteer Services.", "description": "This Act is a result of the Joint Legislative Oversight and Sunset Committee&#39;s review of the Governor&#39;s Commission on Community and Volunteer Services (&quot;Commission&quot;). This Act does the following:"}, "132": {"bill_id": 1713432, "number": "SB50", "change_hash": "13365d4ce38926f4156f44db2721abbe", "url": "https://legiscan.com/DE/bill/SB50/2023", "status_date": "2023-03-15", "status": 2, "last_action_date": "2023-03-16", "last_action": "Assigned to Sunset Committee (Policy Analysis & Government Accountability) Committee in House", "title": "An Act To Amend Title 2 Of The Delaware Code Relating To The Advisory Council On Walkability And Pedestrian Awareness.", "description": "This Act is a result of the Joint Legislative and Oversight Committee&#39;s review of the Advisory Council on Walkability and Pedestrian Awareness (&quot;Council&quot;). This Act codifies the Council, which was first established under Governor Ruth Ann Minner&#39;s Executive Order No. 83 (2006), disbanded in 2008, and re-established under Governor Jack Markell&#39;s Executive Order No. 54 (2015). This Act also updates the Council&#39;s membership, purpose, and goals to reflect current practices and needs."}, "133": {"bill_id": 1713502, "number": "SB51", "change_hash": "64ba5c47521f37c6d3e5fc39d3b8d12a", "url": "https://legiscan.com/DE/bill/SB51/2023", "status_date": "2023-02-17", "status": 1, "last_action_date": "2023-02-17", "last_action": "Introduced and Assigned to Environment, Energy & Transportation Committee in Senate", "title": "An Act To Amend Title 16 Of The Delaware Code Relating To The Use Of Single-service Plastic Implements And Polystyrene Containers In Food Establishments.", "description": "This Act prohibits food establishments from providing consumers with ready-to-eat food or beverages in polystyrene foam containers or with single-service plastic coffee stirrers, cocktail picks, or sandwich picks. It also prohibits food establishments from providing single-service plastic straws, unless requested by a consumer. These restrictions take effect on July 1, 2025."}, "134": {"bill_id": 1723857, "number": "SB52", "change_hash": "1f61850e7407b50b05401f9589462a82", "url": "https://legiscan.com/DE/bill/SB52/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-01", "last_action": "Introduced and Assigned to Health & Social Services Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The Sterile Needle And Syringe Exchange Program.", "description": "This Act directs the States current needle exchange program to take a needs-based approach."}, "135": {"bill_id": 1724243, "number": "SB53", "change_hash": "1fe4113e5e0b6d9c240cc1fa175ed1df", "url": "https://legiscan.com/DE/bill/SB53/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-01", "last_action": "Introduced and Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend The Charter Of The Town Of Selbyville Relating To Elections.", "description": "This Act amends the Charter of the Town of Selbyville (Selbyville) by doing all of the following:"}, "136": {"bill_id": 1724318, "number": "SB54", "change_hash": "d18f1f8304347a1da6b94730ccfb2ff8", "url": "https://legiscan.com/DE/bill/SB54/2023", "status_date": "2023-03-16", "status": 3, "last_action_date": "2023-03-16", "last_action": "Passed By House. Votes: 39 YES 2 ABSENT", "title": "An Act To Amend Title 26 Of The Delaware Code Relating To Net Metering.", "description": "This bill extends the effective date of certain provisions of Section 1014 of Title 26 of the Delaware Code for utilities regulated by the Public Service Commission."}, "137": {"bill_id": 1723708, "number": "SB55", "change_hash": "2bc48c461f502f81f1095c12eda90750", "url": "https://legiscan.com/DE/bill/SB55/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-08", "last_action": "Reported Out of Committee (Health & Social Services) in Senate with 7 Favorable", "title": "An Act To Amend Title 29 Of The Delaware Code Establishing The Delaware Rare Disease Advisory Council.", "description": "This bill establishes the Delaware Rare Disease Advisory Council which, among other things, is intended to educate medical professionals, government agencies, legislators, and the public about rare diseases. There are about 7,000 known rare diseases, and they create major public health challenges. The Advisory Council is charged with engaging in activities intended to benefit rare disease patients in Delaware, including encouraging and securing funding for the development of new treatments for rare diseases."}, "138": {"bill_id": 1723932, "number": "SB56", "change_hash": "47802136b5b2faaf6f9269a91a41bb5b", "url": "https://legiscan.com/DE/bill/SB56/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-10", "last_action": "Assigned to Natural Resources & Energy Committee in House", "title": "An Act To Amend Title 26 Of The Delaware Code Relating To The Public Service Commission.", "description": "This is an omnibus bill that updates several aspects of the Delaware Public Utility Code, Title 26, including the following: (a) Expanding the public notice options for the Public Service Commission in order to reduce costs, increase transparency, and raise public awareness of Commission proceedings; (b) Amending the statute which sets the salary of Commissioners to provide for a salary as appropriated in the annual State Operating Budget; (c) Increasing the utility assessment rate; and (d) Eliminating references to the Water Supply Coordinating Council, which reached its sunset date of January 31, 2022."}, "139": {"bill_id": 1723782, "number": "SB57", "change_hash": "c62414d0085bcd029683b7c1475bd888", "url": "https://legiscan.com/DE/bill/SB57/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-01", "last_action": "Introduced and Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend Title 15 Of The Delaware Code Relating To Presidential Electors.", "description": "In Chiafalo v. Washington, 140 S.Ct. 2316 (2020), the United States Supreme Court made clear that states have the authority to remove or punish presidential electors who do not adhere to their obligation to vote faithfully for their parties candidates."}, "140": {"bill_id": 1724009, "number": "SB58", "change_hash": "a23e5e41ecaa04079d5b477480e14bb6", "url": "https://legiscan.com/DE/bill/SB58/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-08", "last_action": "Assigned to Finance Committee in Senate", "title": "An Act Relating To The Removal Of Copay Requirements For Delaware Families In Need.", "description": "Since the COVID-19 public health emergency, the Department has not charged copays for Delaware Families earning up to 200% of the federal poverty level and has reimbursed purchase of care providers for 15 absent days per child per month. These practices have been successful in stabilizing families and providing early learning programs for Delaware&#39;s needy families and children."}, "141": {"bill_id": 1724090, "number": "SB59", "change_hash": "a327333242edeac46ae7f278d83ab3c6", "url": "https://legiscan.com/DE/bill/SB59/2023", "status_date": "2023-03-01", "status": 1, "last_action_date": "2023-03-08", "last_action": "Assigned to Finance Committee in Senate", "title": "An Act To Establish A Statewide Rate Of Purchase Of Care For Child Care Providers.", "description": "This bill directs the Department to pay a statewide rate to all child care providers that is aligned with the New Castle County rate through existing program funds. This service provides support for families with children birth to 12 years of age with access to child care to enable the caretaker to hold a job, obtain training or meet the special needs of the parent or child. The bill would pay licensed child care providers statewide at the reimbursement rate of New Castle County as determined by the 2021 Delaware Local Child Care Market Rate Survey."}, "142": {"bill_id": 1729525, "number": "SB60", "change_hash": "e171ceedd8812afb44dd4ae20354d224", "url": "https://legiscan.com/DE/bill/SB60/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-17", "last_action": "Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To School Employee Leave.", "description": "This Act provides teachers and other school employees with the same protection to be absent without a loss of pay as State merit employees for all of the following reasons:"}, "143": {"bill_id": 1729707, "number": "SB61", "change_hash": "d8d0c278d8a4cf7aab2bdb8d8e3b8fb5", "url": "https://legiscan.com/DE/bill/SB61/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-17", "last_action": "Assigned to Education Committee in House", "title": "An Act To Amend Title 14 Of The Delaware Code Relating To Absences Of School Employees.", "description": "Teachers and other school employees (school employees) do not accrue annual leave that can be used on a flexible basis. Under current law, school employees may only use 3 days of sick leave for personal reasons and may be absent for 5 days after the death of an immediate family member and for 1 day only, on the day of the funeral, after the death of a near relative."}, "144": {"bill_id": 1732675, "number": "SB62", "change_hash": "10fcb9db1d2d7fd3d21184a84007674a", "url": "https://legiscan.com/DE/bill/SB62/2023", "status_date": "2023-03-09", "status": 1, "last_action_date": "2023-03-09", "last_action": "Introduced and Assigned to Banking, Business, Insurance & Technology Committee in Senate", "title": "An Act To Amend Title 18 Of The Delaware Code Relating To Travel Insurance.", "description": "This Act makes minor changes to licensing and registration of limited lines travel insurance producers and travel retailers and establishes a comprehensive framework for the sale and marketing of travel insurance. Specifically, the legislation establishes uniform meanings of key terms; allows travel products to continue to be offered in a manner that provides a seamless consumer experience and cost-saving efficiencies; clarifies impermissible and prohibited sales practices, and the applicability of the states unfair trade practices law; requires several consumer disclosures; clarifies that travel insurance may be sold via individual, group, or blanket policies; clarifies current practice with respect to premium taxes; and clarifies that travel insurance is generally classified and filed as an inland marine line of insurance."}, "145": {"bill_id": 1732504, "number": "SB63", "change_hash": "736a5d56703f89955efc4e4079967a59", "url": "https://legiscan.com/DE/bill/SB63/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-17", "last_action": "Assigned to Agriculture Committee in House", "title": "An Act To Amend Title 9 Of The Delaware Code Relating To Farms.", "description": "This bill updates the criteria for agriculture, horticulture, or forestry land use."}, "146": {"bill_id": 1732564, "number": "SB64", "change_hash": "fdd888385e1bd0985f74f0a4953c3dfa", "url": "https://legiscan.com/DE/bill/SB64/2023", "status_date": "2023-03-09", "status": 1, "last_action_date": "2023-03-09", "last_action": "Introduced and Assigned to Elections & Government Affairs Committee in Senate", "title": "An Act To Amend Title 29 Of The Delaware Code Relating To The State Lottery.", "description": "This Act promotes increased capital investment at Delaware casinos by restructuring the table games licensing fee reduction currently received by video lottery agents to allow capital investments greater than the minimum amounts required under § 4815(b)(3)a. of Title 29 of the Delaware Code to count toward the allowable license fee reductions. For ease of administration, this Act also aligns time periods for both table games and video lottery calculations."}, "147": {"bill_id": 1746227, "number": "SB65", "change_hash": "487fe84a8256085bd01bec7877adc3e1", "url": "https://legiscan.com/DE/bill/SB65/2023", "status_date": "2023-03-23", "status": 1, "last_action_date": "2023-03-23", "last_action": "Introduced and Assigned to Judiciary Committee in Senate", "title": "An Act To Amend Title 10 Of The Delaware Code Relating To Expenditure Of Real Estate Transfer Tax Proceeds.", "description": "This bill adds workforce and affordable housing programs to the current list of realty transfer tax eligible expenditures for New Castle, Kent, and Sussex Counties."}, "148": {"bill_id": 1746115, "number": "SB66", "change_hash": "e087451ea88e0c6bf9c65c91bea94248", "url": "https://legiscan.com/DE/bill/SB66/2023", "status_date": "2023-03-23", "status": 1, "last_action_date": "2023-03-23", "last_action": "Introduced and Assigned to Health & Social Services Committee in Senate", "title": "An Act To Amend Title 20 Of The Delaware Code Relating To The Public Health Emergency Planning Commission.", "description": "This Act adds the Senate Minority Leader and the House Minority Leader as members of the Public Health Emergency Planning Commission (Commission)."}, "149": {"bill_id": 1746172, "number": "SB67", "change_hash": "1acb7bef220f70571d8c8e788ccfeb7d", "url": "https://legiscan.com/DE/bill/SB67/2023", "status_date": "2023-03-23", "status": 1, "last_action_date": "2023-03-23", "last_action": "Introduced and Assigned to Judiciary Committee in Senate", "title": "An Act To Amend Title 11 Of The Delaware Code Relating To Misconduct By Public Officials.", "description": "This Act updates the crime of official misconduct to ensure appropriate accountability of public servants who abuse their positions of power and public trust. The statute establishes a grade in the penalty for the official misconduct to be commensurate to the gravity of the misconduct. In addition, this statute conforms the discrimination language to the language used in the Hate Crimes statute. It also makes technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual."}, "150": {"bill_id": 1651022, "number": "SR1", "change_hash": "96b7fd4b1ab20666ede056384cc9eb9f", "url": "https://legiscan.com/DE/bill/SR1/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Relating To The Roll Of The Members Of The Senate.", "description": "This Resolution establishes the roll of members of the Senate of the 152nd General Assembly."}, "151": {"bill_id": 1651157, "number": "SR2", "change_hash": "d17c91d9b3d1d2d28cb332e401183da4", "url": "https://legiscan.com/DE/bill/SR2/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Relating To The Rules Of The Delaware State Senate.", "description": "This Resolution enacts the Rules of the Senate for the 152nd General Assembly until further action of the Senate."}, "152": {"bill_id": 1650472, "number": "SR3", "change_hash": "2046558079c20086c9a475aca1c04e10", "url": "https://legiscan.com/DE/bill/SR3/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Relating To The Election Of The President Pro Tempore.", "description": "This Resolution elects David P. Sokola to be the President Pro Tempore of the Senate of the 152nd General Assembly."}, "153": {"bill_id": 1650673, "number": "SR4", "change_hash": "35d68abdb56d369bd38f98e8418aea1b", "url": "https://legiscan.com/DE/bill/SR4/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Relating To The Office Of The Secretary Of The Senate.", "description": "This Resolution elects Ryan C. Dunphy to be the Secretary of the Senate of the 152nd General Assembly."}, "154": {"bill_id": 1650536, "number": "SR5", "change_hash": "ca3341f8500107bd7353039e1e8c5770", "url": "https://legiscan.com/DE/bill/SR5/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Appointing A Committee To Notify The Governor That The Senate Is Organized.", "description": "Appointing A Committee To Notify The Governor That The Senate Is Organized."}, "155": {"bill_id": 1650953, "number": "SR6", "change_hash": "9bcd61660d07af8ba9750663a20d4dbf", "url": "https://legiscan.com/DE/bill/SR6/2023", "status_date": "2023-01-10", "status": 2, "last_action_date": "2023-01-10", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Appointing A Committee To Notify The House Of Representatives That The Senate Is Organized.", "description": "Appointing A Committee To Notify The House Of Representatives That The Senate Is Organized."}, "156": {"bill_id": 1679019, "number": "SR7", "change_hash": "07d0bf41b71880f43973e797551168e9", "url": "https://legiscan.com/DE/bill/SR7/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Relating To The Delaware State Senate Rules Of Procedure For Ethics Violations.", "description": "This Resolution enacts the Delaware State Senate Rules of Procedure for Ethics Violations."}, "157": {"bill_id": 1681233, "number": "SR8", "change_hash": "324fbe7ccbb688483ba6e2c1c5c9e329", "url": "https://legiscan.com/DE/bill/SR8/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed By Senate. Votes: 19 YES 2 ABSENT", "title": "Recognizing And Celebrating The Chinese New Year 2023.", "description": "This Senate Resolution recognizes and celebrates the Chinese New Year 2023."}, "158": {"bill_id": 1683108, "number": "SR9", "change_hash": "8a165c73abf19f82921e77c93e66af0c", "url": "https://legiscan.com/DE/bill/SR9/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed By Senate. Votes: 13 YES 6 NO 1 NOT VOTING 1 ABSENT", "title": "Urging Members Of The United States Congress To Enact Federal Legislation Granting Statehood To The People Of Washington, D.c.", "description": "This Senate Resolution urges the United States Congress to enact legislation granting statehood to the people of Washington, D.C."}, "159": {"bill_id": 1729091, "number": "SR10", "change_hash": "ccd2221f30ecdad1ec68cbb04a724a82", "url": "https://legiscan.com/DE/bill/SR10/2023", "status_date": "2023-03-07", "status": 2, "last_action_date": "2023-03-07", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Recognizing Senator Nicole Poore, Her Son Luke Poore, And Their Family For Historic Success In Delaware Wrestling.", "description": "This resolution recognizes Senator Nicole Poore, her son Luke Poore, and the entire Poore wrestling family for historic success in Delaware wrestling."}, "160": {"bill_id": 1732138, "number": "SR11", "change_hash": "46128c664e2562a54c302abdde98e3c1", "url": "https://legiscan.com/DE/bill/SR11/2023", "status_date": "2023-03-09", "status": 2, "last_action_date": "2023-03-09", "last_action": "Passed By Senate. Votes: 15 YES 1 NO 4 NOT VOTING 1 ABSENT", "title": "Urging Our Federal Delegation To Support Legislation To Deschedule Marijuana.", "description": "This Senate Resolution urges our federal delegation to support legislation to deschedule marijuana."}, "161": {"bill_id": 1654594, "number": "SCR1", "change_hash": "745596faf048739ae7b217bf24275895", "url": "https://legiscan.com/DE/bill/SCR1/2023", "status_date": "2023-01-11", "status": 2, "last_action_date": "2023-01-12", "last_action": "Stricken in Senate", "title": "Providing For A Joint Session Of The Senate And The House Of Representatives To Be Convened For The Purpose Of Hearing An Address By The Honorable John C. Carney, Jr., Governor Of The State Of Delaware.", "description": "This Concurrent Resolution provides for Joint Session of the Senate and the House of Representatives to be convened for the purpose of hearing an address by the Honorable John C. Carney, Jr., Governor of the State of Delaware."}, "162": {"bill_id": 1655069, "number": "SCR2", "change_hash": "572a14166868dc4ee566b4af2fe28e1f", "url": "https://legiscan.com/DE/bill/SCR2/2023", "status_date": "2023-01-11", "status": 2, "last_action_date": "2023-01-12", "last_action": "Passed In House by Voice Vote", "title": "Recognizing January 9, 2023, As &quot;law Enforcement Appreciation Day&quot; In Delaware.", "description": "This Concurrent Resolution recognizes January 9, 2023, as &quot;Law Enforcement Appreciation Day&quot; in the State of Delaware."}, "163": {"bill_id": 1658964, "number": "SCR3", "change_hash": "575509144781fbc1dd80f6960c475056", "url": "https://legiscan.com/DE/bill/SCR3/2023", "status_date": "2023-01-19", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed In House by Voice Vote", "title": "Requesting That The Division Of Substance Abuse And Mental Health Assess The Feasibility Of Replacing The Delaware Psychiatric Center.", "description": "This Senate Concurrent Resolution requests that the Division of Substance Abuse and Mental Health assess the feasibility of replacing the Delaware Psychiatric Centers (DPC) facilities, including gathering input regarding DPCs current and future needs, and provide a report detailing the findings of this work by December 31, 2023."}, "165": {"bill_id": 1656272, "number": "SCR5", "change_hash": "2e4cf478df6985152297383b6dfaf445", "url": "https://legiscan.com/DE/bill/SCR5/2023", "status_date": "2023-01-12", "status": 2, "last_action_date": "2023-01-12", "last_action": "Passed In House by Voice Vote", "title": "Honoring The Life And Work Of Dr. Martin Luther King, Jr. On The Occasion Of Dr. Martin Luther King Jr. Day&quot;.", "description": "This Senate Concurrent Resolution honors and recognizes the leadership, achievements, and sacrifices of Dr. Martin Luther King, Jr. and urges all citizens of the First State to participate fittingly in the observance of Dr. Martin Luther King, Jr. Day on January 16, 2023."}, "166": {"bill_id": 1680602, "number": "SCR6", "change_hash": "4937852fba6f53678a7f44f98ede2f61", "url": "https://legiscan.com/DE/bill/SCR6/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed In House by Voice Vote", "title": "Designating The Week Of February 27 To March 5, 2023 As &quot;eating Disorders Awareness And Prevention Week&quot; In Delaware.", "description": "This Senate Concurrent Resolution designates the week of February 27 to March 5, 2023, as &quot;Eating Disorders Awareness and Prevention Week&quot; in Delaware and encourages the Department of Health and Social Services to research methods to raise awareness of, prevent, and treat eating disorders."}, "167": {"bill_id": 1677629, "number": "SCR7", "change_hash": "78214e28483ea6c9cb45f19b49d047a2", "url": "https://legiscan.com/DE/bill/SCR7/2023", "status_date": "2023-01-24", "status": 2, "last_action_date": "2023-01-24", "last_action": "Passed In House by Voice Vote", "title": "Designating February 28, 2023, As &quot;rare Disease Day&quot; In The State Of Delaware.", "description": "This Senate Concurrent Resolution recognizes February 28, 2023, as &quot;Rare Disease Day&quot; in Delaware."}, "168": {"bill_id": 1677954, "number": "SCR8", "change_hash": "60ae914f32cfbbe927a2fae25e0e882e", "url": "https://legiscan.com/DE/bill/SCR8/2023", "status_date": "2023-01-24", "status": 2, "last_action_date": "2023-01-25", "last_action": "Passed In House by Voice Vote", "title": "Recognizing January 2023 As &quot;national Mentoring Month&quot; In The State Of Delaware.", "description": "This resolution recognizes January 2023 as &quot;National Mentoring Month&quot; in the State of Delaware."}, "169": {"bill_id": 1680730, "number": "SCR9", "change_hash": "a8a4498d350d601c2d64169e285df374", "url": "https://legiscan.com/DE/bill/SCR9/2023", "status_date": "2023-01-25", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed In House by Voice Vote", "title": "Recognizing March 2, 2023 As &quot;delaware Giving Day.&quot;", "description": "This resolution recognizes March 2, 2023, as &quot;Delaware Giving Day.&quot;"}, "170": {"bill_id": 1682943, "number": "SCR10", "change_hash": "aba08d8d4aeaf102e1fff88ce2db268d", "url": "https://legiscan.com/DE/bill/SCR10/2023", "status_date": "2023-01-26", "status": 2, "last_action_date": "2023-01-26", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Designating The Week Of January 22 - 28, 2023, As &quot;school Choice Week&quot; In The State Of Delaware.", "description": "This Senate Concurrent Resolution designates January 22-28, 2023, as &quot;School Choice Week&quot; in the State of Delaware."}, "171": {"bill_id": 1739932, "number": "SCR11", "change_hash": "d5980749d662b5bc7afce7e980a4cf7f", "url": "https://legiscan.com/DE/bill/SCR11/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Passed In House by Voice Vote", "title": "Recognizing March 18, 2023 As National Public Defense Day.", "description": "This Resolution recognizes March 18, 2023, as National Public Defense Day."}, "172": {"bill_id": 1740057, "number": "SCR12", "change_hash": "f1a00997c533ee97c8a7e2fb3bdcb2b3", "url": "https://legiscan.com/DE/bill/SCR12/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Passed In House by Voice Vote", "title": "Declaring Gun Violence A Public Health Crisis.", "description": "This Senate Concurrent Resolution declares that gun violence is a public health crisis, that ending the gun violence devastating Delaware is a policy priority, and supporting policy and legislative solutions that will make schools safe, confront armed hate and extremism, prevent suicide, and center and support survivors of gun violence."}, "173": {"bill_id": 1728923, "number": "SCR13", "change_hash": "1b24742547110d3d4983631d7d5ce56b", "url": "https://legiscan.com/DE/bill/SCR13/2023", "status_date": "2023-03-08", "status": 3, "last_action_date": "2023-03-08", "last_action": "Passed By Senate. Votes: 21 YES", "title": "Directing The Department Of Education To Review And Provide Recommendations On Mandatory Educator Trainings.", "description": "This Concurrent Resolution requests the Department of Education conduct a review of mandatory trainings for educators and report back to the General Assembly their findings and recommendations."}, "174": {"bill_id": 1740121, "number": "SCR14", "change_hash": "6781e1f0f7e44014d75234382dff1def", "url": "https://legiscan.com/DE/bill/SCR14/2023", "status_date": "2023-03-14", "status": 2, "last_action_date": "2023-03-14", "last_action": "Passed In House by Voice Vote", "title": "Recognizing March 14, 2023, As &quot;pi Day&quot; In Delaware.", "description": "This Senate Concurrent Resolution designates March 14, 2023, as Pi Day in the State of Delaware."}, "175": {"bill_id": 1743131, "number": "SCR15", "change_hash": "0d25acd396290ed0075d2acc55eda5fb", "url": "https://legiscan.com/DE/bill/SCR15/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Passed In House by Voice Vote", "title": "Proclaiming The Month Of April 2023 As Sikh Awareness And Appreciation Month In The State Of Delaware.", "description": "This Senate Concurrent Resolution proclaims the month of April 2023 as Sikh Awareness and Appreciation Month in the State of Delaware."}, "176": {"bill_id": 1743278, "number": "SCR20", "change_hash": "f2587f4ba47cb30c294ce7481faf184d", "url": "https://legiscan.com/DE/bill/SCR20/2023", "status_date": "2023-03-16", "status": 2, "last_action_date": "2023-03-16", "last_action": "Passed By Senate. Votes: 20 YES 1 ABSENT", "title": "Recognizing March 25th As &quot;greek Independence Day&quot; In Delaware.", "description": "This resolution recognizes March 25th as Greek Independence Day in Delaware."}}