{"session": {"session_id": 1999, "state_id": 50, "year_start": 2023, "year_end": 2023, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023 Regular Session", "session_name": "2023 General Session"}, "416": {"bill_id": 1659337, "number": "SF0117", "change_hash": "6cebdfeceea54523875a78620a761d6a", "url": "https://legiscan.com/WY/bill/SF0117/2023", "status_date": "2023-02-24", "status": 6, "last_action_date": "2023-02-24", "last_action": "Did not Consider for Introduction", "title": "Parental rights in education.", "description": "AN ACT relating to education; specifying procedures and requirements for school districts to provide parents notice of information regarding students and the rights of parents to make decisions regarding their children; specifying that school districts cannot prohibit parental notification and involvement in critical decisions involving students; prohibiting classroom discussion about sexual orientation or gender identity as specified; specifying training requirements for school districts; specifying procedures for resolving parent concerns and complaints; specifying duties for school district boards of trustees and the state board of education; providing for a cause of action; requiring rulemaking; and providing for effective dates."}, "443": {"bill_id": 1672878, "number": "SF0144", "change_hash": "9554fe7290fd678da3c2ebb998faa9f6", "url": "https://legiscan.com/WY/bill/SF0144/2023", "status_date": "2023-02-27", "status": 6, "last_action_date": "2023-02-27", "last_action": "COW:H Did not consider for COW", "title": "Chloe's law-children gender change prohibition.", "description": "AN ACT relating to public health and safety; prohibiting physicians from performing procedures for children related to gender transitioning and gender reassignment; providing an exception; providing that gender transitioning and reassignment procedures are grounds for suspension or revocation of a physician's or health care provider's license; prohibiting insurance coverage for children for gender transitioning and reassignment procedures; providing definitions; specifying applicability; requiring rulemaking; and providing for effective dates."}}