{"session": {"session_id": 962, "state_id": 17, "year_start": 2012, "year_end": 2012, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2012 1st Special Session", "session_name": "2012 Special Session"}, "0": {"bill_id": 435607, "number": "HB1", "change_hash": "c966138ebc2e3b71c33995e5c00b964a", "url": "https://legiscan.com/KY/bill/HB1/2012/X1", "status_date": "2012-04-24", "status": 4, "last_action_date": "2012-04-24", "last_action": "signed by Governor (Acts Chapter 1)", "title": "AN ACT relating to controlled substances and making an appropriation therefor.", "description": "Create a new section of KRS Chapter 218A to provide ownership and operational standards for pain clinics; create a new section of KRS Chapter 218A to require sharing of reports of illegal controlled substance prescribing or dispensing activity and to require that boards that regulate prescribers and dispensers of controlled substances have mandatory prescribing and dispensing standards, limitation caps on the amount of certain substances which can be dispensed, processes for expedited action on controlled substance related complaints against their licensees, sharing and retrieving mechanisms for interstate disciplinary data on licensees, mandatory disciplinary standards for in-state and out-of-state controlled substance misconduct by licensees, continuing education requirements for licensees, access to expert advice when reviewing complaints, the ability to accept anonymous complaints, and that the boards cooperate with each other and with the boards of other states; create a new section of KRS Chapter 218A to establish statutory practice requirements for those who prescribe certain controlled substances; amend KRS 218A.202 to set requirements for KASPER registration, usage, and access; amend KRS 218A.240 to establish new standards for the proactive use of KASPER data; amend KRS 218A.245 to include language facilitating the linkage of KASPER data to the prescription monitoring programs of other states; create a new section of KRS Chapter 72 to require blood testing for controlled substances in certain coroners case's; amend KRS 72.280 to expand the contents of the annual drug overdose statewide report; create a new section of KRS Chapter 15 to allow the Attorney General to ensure that boards licensing prescribers and dispensers of controlled substances are acting in compliance with their statutory directives; amend KRS 311.530 and 314.121 to allow the Governor to place persons with pain management and addiction disorder expertise on the Kentucky Board of Medical licensure and the Board of Nursing; create a new section of KRS Chapter 315 to require reporting of lost or stolen deliveries of controlled substances; include noncodified provisions transferring the KASPER program and its associated personnel to the Attorney General, allowing for a legislative oversight committee during the 2012 interim, and allowing the Attorney General to access National Mortgage Settlement proceeds to fund KASPER."}, "1": {"bill_id": 435557, "number": "HB2", "change_hash": "f5bc329699c58c442a2bc27078cdced9", "url": "https://legiscan.com/KY/bill/HB2/2012/X1", "status_date": "2012-05-02", "status": 4, "last_action_date": "2012-05-02", "last_action": "signed by Governor (Acts Chapter 2)", "title": "AN ACT relating to appropriations providing financing and conditions for the operations, maintenance, support, and functioning of the Transportation Cabinet of the Commonwealth of Kentucky.", "description": "The Transportation Cabinet Budget: appropriate from the General Fund, Restricted Funds, Federal Funds, and Road Fund $2,378,634,600 in fiscal year 2012-2013 and $2,400,384,200 in fiscal year 2013-2014 for operating costs; appropriate from Restricted Funds, Federal Funds, Bond Funds, Road Fund, and Investment Income for various capital projects; require the Secretary of the Transportation Cabinet to produce a document detailing the 2012-2014 Biennial Highway Construction Program and the Highway Preconstruction Program; provide debt service to the General Administration and Support budget unit; require the Transportation Cabinet to continue the SAFE Patrol Program; appropriate General Fund moneys for riverport improvement; allow the Transportation Cabinet to receive funds and services for the Adopt-A-Highway Litter Program; provide funds for operational costs and debt service for the Aviation budget unit; provide funds for Economic Development Road lease-rental payments; provide that no portion of the revenues to the state Road Fund accrue to the Debt Payment Acceleration Fund account; provide that excess funds be transferred to the State Construction Account; provide debt service for Grant Anticipation Revenue Vehicle (GARVEE) Bonds; provide funds for the State-Supported Construction Program, Biennial Highway Construction Program, Highway Construction Contingency Account, and the Kentucky Pride Fund; authorize projects in the 2010-2012 Biennial Highway Construction Plan to continue into the 2012-2014 biennium; provide funds for the Kentucky Transportation Center and new highway equipment purchases; authorize the Transportation Cabinet to match federal highway moneys; prioritize projects should any additional federal highway moneys become available; authorize the Transportation Cabinet to continue the Cash Management Plan and to make programmatic adjustments; provide for carry forward of any unexpended Road Fund appropriations in the Highways budget unit for various programs; authorize use of design/build procurement methods for the Louisville-Southern Indiana Ohio River Bridges Project; provide funds for federal construction projects, the State Resurfacing Program, and highways maintenance; authorize the Kentucky Public Transportation Infrastructure Authority to act as the developing and issuing authority on the Louisville-Southern Indiana Ohio River Bridges Project and authorize funding for two years of the project; require a financial plan for the Brent Spence Bridge Project and prohibit authorization of funds until after Federal Highway Administration approval; provide for the transfer of Road Fund resources for judgments; authorize the Transportation Cabinet to maximize the use of Toll Credits; provide funds for nonpublic school transportation; provide funds for the County Road Aid Program, the Rural Secondary Program, the Municipal Road Aid Program, and the Energy Recovery Road Fund; provide debt service to the Vehicle Regulation budget unit; provide that excess costs imposed on county clerks in connection with Road Fund tax administration are necessary government expenses; provide for Capital Construction Fund appropriations and reauthorizations; provide for the expiration of existing line-item capital construction projects; require that excess bond proceeds investment income be used to pay debt service; authorize various capital projects; specify funds transfers."}, "2": {"bill_id": 435511, "number": "HCR5", "change_hash": "463f870b967c18ac5d9c29349bf09607", "url": "https://legiscan.com/KY/bill/HCR5/2012/X1", "status_date": "2012-04-20", "status": 4, "last_action_date": "2012-04-20", "last_action": "received in House", "title": "Adjourn the 2012 Extraordinary Session of the General Assembly sine die.", "description": "Adjourn the 2012 Extraordinary Session of the General Assembly sine die."}, "4": {"bill_id": 435414, "number": "SB2", "change_hash": "00c4d2c634797aba7bb5158cc370e641", "url": "https://legiscan.com/KY/bill/SB2/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to road projects and declaring an emergency.", "description": "Set out the fiscal year 2012-2014 Biennial Highway Construction Plan; EMERGENCY."}, "5": {"bill_id": 435366, "number": "SB3", "change_hash": "3a9c9c0ec5efdbb9c602d12bd4c10d58", "url": "https://legiscan.com/KY/bill/SB3/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to legislative pay and declaring an emergency.", "description": "Amend KRS 6.190 and 6.211 to establish that compensation and expenses are awarded to members of the General Assembly only for days during a session when the house to which the member is elected is convened and the member is recorded as being present; EMERGENCY."}, "6": {"bill_id": 435316, "number": "SB4", "change_hash": "085df0f3ec45285278b5d9dff320def3", "url": "https://legiscan.com/KY/bill/SB4/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to controlled substances and declaring an emergency.", "description": "Create a new section of KRS Chapter 218A to provide ownership and operational standards for pain clinics; amend KRS 218A.202 to move operation of the KASPER system to the Attorney General's office, with changes to the access and operation standards for the system; amend KRS 218A.240 to conform; amend KRS 218A.245 to allow the Attorney General to utilize a multistate organization to facilitate the exchange of KASPER data; create a new section of KRS Chapter 218A to require various licensing boards to establish by regulation recommended guidelines for prescribing, dispensing, and KASPER usage, continuing education standards, training requirements for operators of narcotic treatment programs, procedures for expedited reviews of complaints against licensees, interstate background checks, disciplinary standards for criminal and civil misconduct by licensees, and limits on in office dispensing for certain controlled substances; create a new section of KRS Chapter 218A to allow the acceptance of anonymous complaints; create a new section of KRS Chapter 72 to increase instances of controlled substance testing in deaths that are coroners cases; amend KRS 72.280 to expand the annual drug overdose death report; create a new section of KRS Chapter 315 to require signature only delivery for certain drug shipments and to create required reporting requirements for lost or stolen drug shipments; create new sections of KRS Chapter 15 to move the KASPER system to the Attorney General's Office, with provisions for the utilization of the system on that office; create new sections of KRS Chapter 218A to adopt the Prescription Monitoring Program compact, with appointments being made by the Governor subject to Senate confirmation; include non-codified provisions require the transfer of KASPER equipment, personnel, and funds to the Attorney General, establishing a legislative oversight task force during the 2012 interim, and allowing National Mortgage Settlement Funding to be used to support KASPER operations."}, "7": {"bill_id": 435267, "number": "SB5", "change_hash": "b620f93b4115ae9d6d5721c4a7eeebc1", "url": "https://legiscan.com/KY/bill/SB5/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to criminal matters.", "description": "Amend KRS 500.050, relating to time limitations for the Penal Code, to make technical correction changing \"must\" to \"shall.\""}, "8": {"bill_id": 435218, "number": "SB6", "change_hash": "61331f66b31c6627fe4fb862fd9bdb3c", "url": "https://legiscan.com/KY/bill/SB6/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to the administration of personnel.", "description": "Amend KRS 18A.015 to make technical changes."}, "9": {"bill_id": 435168, "number": "SB7", "change_hash": "8d7745740ae87f7a11414c1451c2a3af", "url": "https://legiscan.com/KY/bill/SB7/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "AN ACT relating to transportation.", "description": "Amend KRS 186.6401, to include the Transportation Cabinet as an agency that can promulgate administrative regulations identifying individuals who must submit to a skills test prior to being issued an operator's license; amend KRS 186.020, 189.125, and 281A.080 to make technical corrections."}, "10": {"bill_id": 435124, "number": "SJR5", "change_hash": "6f21cd2aab90ba84d223ac822e238bcb", "url": "https://legiscan.com/KY/bill/SJR5/2012/X1", "status_date": "2012-04-16", "status": 1, "last_action_date": "2012-04-17", "last_action": "returned to Committee on Committees (S)", "title": "Set out the last four years of the Six-Year Road Plan.", "description": "Set out the last four years of the Six-Year Road Plan."}}