{"session": {"session_id": 1708, "state_id": 17, "year_start": 2019, "year_end": 2019, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2019 1st Special Session", "session_name": "2019 Special Session"}, "0": {"bill_id": 1271800, "number": "HB1", "change_hash": "955d33a4bb19c0b558617d425247013c", "url": "https://legiscan.com/KY/bill/HB1/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "signed by Governor (Acts ch. 1)", "title": "AN ACT relating to the Kentucky Employees Retirement System and declaring an emergency.", "description": "Amend KRS 61.522 to provide a one-time window where quasi-governmental agencies may voluntarily cease participation in the Kentucky Employees Retirement System (KERS) effective June 30, 2020, for nonhazardous employees by paying the actuarial costs of ceasing participation by lump-sum or installments; provide that an eligible KERS employer may request an estimate of the cost of ceasing participation in the system; provide that a ceasing quasi-governmental employer may elect to allow current employees who entered KERS prior to 1/1/2014 (Tier I and II employees), to continue to participate in the system after June 30, 2020, by paying the additional actuarial costs; provide that employees of the ceasing employer who are no longer participating in KERS shall participate in a defined contribution plan established by the employer; vary assumed rate of return/discount rate used to determine cessation costs from 3% to 4.5% based upon employers decisions regarding payment type (lump-sum vs. installments) and whether or not the employer allows Tier I and II employees to participate in KERS after June 30, 2020; require lump-sum payments for ceasing participation to be paid within one year; establish a maximum installment period of 30 years with interest at the assumed rate of return; establish installment payment amounts that are the higher of FY 2019-2020 employer contributions or the amount determined by multiplying 49.47% of pay by annual average payroll over prior 60 months in which contributions were paid and increasing the dollar value by 1.5% annually, except that if an employer cannot pay off its costs within 30 years and has elected for its Tier I and II employees to continue participating in KERS after June 30, 2020, the base payment amount will be adjusted to ensure payment within 30 years; provide that KERS quasi-governmental agencies receiving General Fund assistance to pay the higher employer rates will continue to receive the assistance until all costs are paid; amend KRS 61.675 to provide that if a KERS employer has elected to pay the costs of ceasing participation by installments and is delinquent for 90 days or more in making payments, the systems: shall not allow future service credit accruals if the employer's employees are participating in the system after the cessation date until such time payments are up to date; may file action in Franklin Circuit Court to collect delinquent funds; and shall notify the Finance & Administration Cabinet who may choose to withhold state appropriations to the ceasing employer until such time the payments are made; amend KRS 18A.225 and 18A.205 to provide that a ceasing KERS employer who participated in the state health and life insurance plans prior to ceasing participation may continue to participate in the plans after ceasing participation; provide that a ceasing KERS employer under subsection (8) of Section 1 of this Act may finance costs including financing the costs through bond issues; provide that the KERS employer contribution rate shall be 49.47% of pay in FY 2019-2020, retroactive to July 1, 2019, for Regional Mental Health Programs, Local and District Health Departments, domestic violence shelters, rape crisis centers, child advocacy centers, state-supported universities and community colleges, and any other agency eligible to voluntarily cease participating in the Kentucky Employees Retirement System pursuant to KRS 61.522; include nonseverability provisions; EMERGENCY."}, "1": {"bill_id": 1271793, "number": "HB2", "change_hash": "c61ce09e3de3b2facf69271b2860770b", "url": "https://legiscan.com/KY/bill/HB2/2019/X1", "status_date": "2019-07-19", "status": 1, "last_action_date": "2019-07-19", "last_action": "posted in committee", "title": "AN ACT relating to retirement costs for Kentucky Retirement Systems employers, making an appropriation therefor, and declaring an emergency.", "description": "Amend KRS 61.510 to define for the Kentucky Employees Retirement System (KERS) \"quasi-governmental employer\" and \"governmental employer\"; define quasi-governmental employers as Mental Health/Mental Retardation Boards, Local and District Health Departments, domestic violence shelters, rape crisis centers, child advocacy centers, state supported universities and community colleges participating in KERS, and any other agency eligible to voluntarily cease participation in KERS pursuant to KRS 61.522; define governmental employer as any other KERS employer who is not a quasi-governmental employer; make technical amendments to conform to court decision regarding 2018 RS SB 151 as it relates to the unfunded liability amortization method; repeal reenact, and amend KRS 61.565 to provide that from July 1, 2019, to June 30, 2044, the KERS nonhazardous employer contribution rate for quasi-governmental employers shall be 49.47% of pay and for governmental employers shall be the full actuarially required contribution rate, including the costs for keeping the KERS quasi-governmental employer rate at 49.47% of pay; provide that of the total employer rate paid by quasi-governmental employers and governmental employers, the amount paid to the retiree health fund from July 1, 2019, to June 30, 2024, shall be the normal cost of the fund not to exceed 2.21% of pay and that any other funding that would have otherwise been paid to the retiree health fund shall be paid into the pension fund; provide that the amount paid by KERS quasi-governmental and governmental employers from July 1, 2019, to June 30, 2044, in terms of dollars shall not be less than the dollar amount paid by the employer in fiscal year 2018-2019; make technical amendments to conform to court decision regarding 2018 RS SB 151; amend KRS 61.670 to provide that in evaluating the assumed rate of return and discount rate used in the annual valuation and actuarial experience study, the Kentucky Retirement Systems (KRS) board and consulting actuary shall consider investment returns over a period greater than 20 years and shall not adjust the assumed rate of return or discount rate by more than 0.25% per year; provide that actuarial reports sent by the KRS to the Legislative Research Commission (LRC) shall upon receipt by LRC be distributed to all members of the General Assembly; set the employer contribution rate at 49.47% of pay for fiscal year 2019-2020 for KERS employers who are mental health/mental retardation boards, local and district health departments, domestic violence shelters, rape crisis centers, child advocacy centers, state-supported universities and community colleges, and any other agency eligible to voluntarily cease participating in the Kentucky Employees Retirement System, make retroactive to July 1, 2019; APPROPRIATION; EMERGENCY."}, "2": {"bill_id": 1271799, "number": "HB3", "change_hash": "447d2dcc7109c960332cbf327217c8c8", "url": "https://legiscan.com/KY/bill/HB3/2019/X1", "status_date": "2019-07-19", "status": 1, "last_action_date": "2019-07-19", "last_action": "posted in committee", "title": "AN ACT relating to employer contribution rates for the Kentucky Employees Retirement System for fiscal year 2019-2020, making an appropriation therefor, and declaring an emergency.", "description": "Freeze the employer contribution rate of 49.47 percent for the fiscal year beginning on July 1, 2019, for pension and health insurance for nonhazardous duty employees participating in the Kentucky Employees Retirement System who are employed by mental health/mental retardation boards, local and district health departments, domestic violence shelters, rape crisis centers, child advocacy centers, state-supported universities and community colleges, and any other agency eligible to voluntarily cease participating in the Kentucky Employees Retirement System; APPROPRIATION; RETROACTIVE; EMERGENCY."}, "3": {"bill_id": 1271795, "number": "HR1", "change_hash": "04c7cc046a9fb5f81895932447d164a9", "url": "https://legiscan.com/KY/bill/HR1/2019/X1", "status_date": "2019-07-19", "status": 4, "last_action_date": "2019-07-19", "last_action": "adopted by voice vote", "title": "A RESOLUTION adopting the Rules of Procedure for the 2019 Extraordinary Session of the House of Representatives.", "description": "Adopt Rules of Procedure for the 2019 Extraordinary Session of the House of Representatives."}, "4": {"bill_id": 1271790, "number": "HR2", "change_hash": "ca89c8492b7be162273bd80e114941a2", "url": "https://legiscan.com/KY/bill/HR2/2019/X1", "status_date": "2019-07-19", "status": 4, "last_action_date": "2019-07-19", "last_action": "adopted by voice vote", "title": "A RESOLUTION extending an invitation to the pastors of Frankfort churches to open daily sessions of the 2019 Extraordinary Session with prayer.", "description": "Invite pastors of Frankfort churches to open daily sessions of the 2019 Extraordinary Session with prayer."}, "5": {"bill_id": 1271796, "number": "HR3", "change_hash": "a58d99b8a860ee5fb488fbb730ed38a3", "url": "https://legiscan.com/KY/bill/HR3/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Greater Louisville Inc. upon being named 2019 Chamber of Commerce of the Year.", "description": "Honor Greater Louisville Inc. upon being named 2019 Chamber of Commerce of the Year."}, "6": {"bill_id": 1271804, "number": "HR4", "change_hash": "7b7dd5c8de150be0a44144d506c968ba", "url": "https://legiscan.com/KY/bill/HR4/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Charles Michael \"Mike\" Driscoll.", "description": "Adjourn in honor and loving memory of Charles Michael \"Mike\" Driscoll."}, "7": {"bill_id": 1271803, "number": "HR5", "change_hash": "b18cefaae1d6d72ac7b784496f30d37a", "url": "https://legiscan.com/KY/bill/HR5/2019/X1", "status_date": "2019-07-20", "status": 4, "last_action_date": "2019-07-20", "last_action": "adopted by voice vote", "title": "A RESOLUTION recognizing the Murray-Calloway County Chamber of Commerce for being named 2019 National Chamber of the Year for its size category.", "description": "Recognize the Murray-Calloway County Chamber of Commerce for being named 2019 National Chamber of the Year for its size category."}, "8": {"bill_id": 1271792, "number": "HR6", "change_hash": "01609cf3d07ba74f9db2f7d3e6424437", "url": "https://legiscan.com/KY/bill/HR6/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Bobby Neil Anderson.", "description": "Adjourn in honor and loving memory of Bobby Neil Anderson."}, "9": {"bill_id": 1271791, "number": "HR7", "change_hash": "d366351912db038aea1989af0a73fa56", "url": "https://legiscan.com/KY/bill/HR7/2019/X1", "status_date": "2019-07-20", "status": 4, "last_action_date": "2019-07-20", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Clyde W. Middleton.", "description": "Adjourn in honor and loving memory of Clyde W. Middleton."}, "10": {"bill_id": 1271807, "number": "HR8", "change_hash": "c1d2d19f600b6bf71b5cd28de7ed0837", "url": "https://legiscan.com/KY/bill/HR8/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Kentucky Chamber of Commerce President and CEO Dave Adkisson upon his retirement.", "description": "Honor Kentucky Chamber of Commerce President and CEO Dave Adkisson upon his retirement."}, "11": {"bill_id": 1271801, "number": "HR9", "change_hash": "f03791c6fd838a855d18f7acf64124e9", "url": "https://legiscan.com/KY/bill/HR9/2019/X1", "status_date": "2019-07-22", "status": 4, "last_action_date": "2019-07-22", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the life and accomplishments of William \"Bud\" Gregory Jr.", "description": "Honor the life and accomplishments of William \"Bud\" Gregory Jr."}, "12": {"bill_id": 1271834, "number": "HR10", "change_hash": "3b4ac521c749fcc883836c200518e94b", "url": "https://legiscan.com/KY/bill/HR10/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Judy Piazza on the occasion of her retirement.", "description": "Honor Judy Piazza on the occasion of her retirement."}, "13": {"bill_id": 1271831, "number": "HR11", "change_hash": "af61228594ae8faf1b0cc4f7659cbfb1", "url": "https://legiscan.com/KY/bill/HR11/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor of Joani Clark upon the occasion of her retirement.", "description": "Adjourn the House of Representatives in honor of Joani Clark upon the occasion of her retirement."}, "14": {"bill_id": 1271838, "number": "HR12", "change_hash": "4fae35bacc6bec0458811ce7007444d9", "url": "https://legiscan.com/KY/bill/HR12/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor of Tommy Yankey upon the occasion of his retirement.", "description": "Adjourn the House of Representatives in honor of Tommy Yankey upon the occasion of his retirement."}, "15": {"bill_id": 1271835, "number": "HR13", "change_hash": "9924127c2cc399cedab586b0642100d4", "url": "https://legiscan.com/KY/bill/HR13/2019/X1", "status_date": "2019-07-22", "status": 4, "last_action_date": "2019-07-22", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Kenneth Ray \"Ken\" Baird.", "description": "Adjourn in honor and loving memory of Kenneth Ray Baird."}, "16": {"bill_id": 1271837, "number": "HR14", "change_hash": "629e7013e548945fb979f352d8181c5a", "url": "https://legiscan.com/KY/bill/HR14/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the 100th anniversary of the Beaumont Inn on July 22, 2019.", "description": "Honor the 100th anniversary of the Beaumont Inn on July 22, 2019."}, "17": {"bill_id": 1271832, "number": "HR15", "change_hash": "1aa10d79f7d5da32634e1345f21bb39b", "url": "https://legiscan.com/KY/bill/HR15/2019/X1", "status_date": "2019-07-22", "status": 4, "last_action_date": "2019-07-22", "last_action": "adopted by voice vote", "title": "A RESOLUTION urging the Attorney General of the Commonwealth of Kentucky to join in a legal cause of action filed by the State of Alabama against the United States Department of Commerce and the Bureau of the Census, an agency within the United States Department of Commerce, or to initiate a separate legal cause of action on behalf of the citizens of the Commonwealth of Kentucky regarding the \"actual Enumeration\" of the population of the Commonwealth and the United States.", "description": "Urge the Attorney General of Kentucky to join with Alabama in its lawsuit against the U.S. Department of Commerce and the Bureau of the Census to vacate and set aside the use of the Residence Rule insofar as it permits or requires the inclusion of the number of illegal aliens in the population figures utilized to apportion the U.S. House of Representatives and the Electoral College votes among the States, or to initiate an independent lawsuit on behalf of the citizens of Kentucky seeking the same relief."}, "18": {"bill_id": 1271839, "number": "HR16", "change_hash": "714b7a81bdc8f4bcd81da300892e850b", "url": "https://legiscan.com/KY/bill/HR16/2019/X1", "status_date": "2019-07-22", "status": 4, "last_action_date": "2019-07-22", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House in honor and loving memory of Money Ed Cummins.", "description": "Adjourn the House in loving memory and honor of Money Ed Cummins."}, "19": {"bill_id": 1271836, "number": "HR17", "change_hash": "68350f65a6b90b3ccac390ddaf4cd06a", "url": "https://legiscan.com/KY/bill/HR17/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the Laurel County Health Department for receiving the Small Local Health Department of the Year award from the National Association of County and City Health Officials.", "description": "Honor the Laurel County Health Department for receiving the Small Local Health Department of the Year award from the National Association of County and City Health Officials."}, "20": {"bill_id": 1271828, "number": "HR18", "change_hash": "2641157396f6624628b965a086a663bd", "url": "https://legiscan.com/KY/bill/HR18/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Senator Ray B. White.", "description": "Adjourn the House of Representatives in honor and loving memory of Senator Ray B. White."}, "21": {"bill_id": 1271830, "number": "HR19", "change_hash": "0e1ca6a0aea94cb81635f5bfb2393cca", "url": "https://legiscan.com/KY/bill/HR19/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House in honor and loving memory of Maurice \"Big Moe\" Day.", "description": "Adjourn the House in honor and loving memory of Maurice \"Big Moe\" Day."}, "22": {"bill_id": 1271878, "number": "HR20", "change_hash": "aa177e1d70e2ecdacafd11094f8500e3", "url": "https://legiscan.com/KY/bill/HR20/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Fredrick Anthony Meyer Jr.", "description": "Adjourn the House of Representatives in honor and loving memory of Fredrick Anthony Meyer Jr."}, "23": {"bill_id": 1271873, "number": "HR21", "change_hash": "2956a4265fd017f9cead904ac118748b", "url": "https://legiscan.com/KY/bill/HR21/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor of Charles Adrian Redmon upon the occasion of his 102nd birthday.", "description": "Adjourn the House of Representatives in honor of Charles Adrian Redmon upon the occasion of his 102nd birthday."}, "24": {"bill_id": 1271881, "number": "HR22", "change_hash": "164a74c89c1c11054752f59a438f0d59", "url": "https://legiscan.com/KY/bill/HR22/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Gina Rigsby on the occasion of her retirement.", "description": "Honor Gina Rigsby on the occasion of her retirement."}, "25": {"bill_id": 1272004, "number": "HR23", "change_hash": "a656ab6dd87af09cc64981fc87d59297", "url": "https://legiscan.com/KY/bill/HR23/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Deloris A. \"Sandy\" Cook.", "description": "Adjourn the House of Representatives in honor and loving memory of Deloris A. \"Sandy\" Cook."}, "26": {"bill_id": 1272008, "number": "HR24", "change_hash": "4dd65b9a913d987d6c238a66fc974786", "url": "https://legiscan.com/KY/bill/HR24/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Joan Callahan.", "description": "Adjourn in honor and loving memory of Joan Callahan."}, "27": {"bill_id": 1272006, "number": "HR25", "change_hash": "3b9f2c4437d6fd93b2f664d5d57f0f14", "url": "https://legiscan.com/KY/bill/HR25/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Jerry G. English.", "description": "Adjourn the House of Representatives in honor and loving memory of Jerry G. English."}, "28": {"bill_id": 1271999, "number": "HR26", "change_hash": "c555c61abe6cc282738d0ea5524207b8", "url": "https://legiscan.com/KY/bill/HR26/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION recognizing and honoring Robert Jenkins upon his retirement from the Legislative Research Commission for his many years of dedicated service to the Kentucky General Assembly.", "description": "Recognize and honor Robert Jenkins upon his retirement from LRC."}, "29": {"bill_id": 1272022, "number": "HR27", "change_hash": "f917b09bda4787296528396d529d448f", "url": "https://legiscan.com/KY/bill/HR27/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring David Coles upon his retirement from the Legislative Research Commission.", "description": "Honor David Coles upon his retirement from the Legislative Research Commission."}, "30": {"bill_id": 1272003, "number": "HR29", "change_hash": "28d2eeadc70864ca97dc86328ea43002", "url": "https://legiscan.com/KY/bill/HR29/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the service of Rotary Club International and declaring October 24, 2019 as World Polio Day.", "description": "Honoring Rotary Club International and declaring October 24th, 2019 as World Polio Day."}, "31": {"bill_id": 1272001, "number": "HR30", "change_hash": "5276297234c8221392926c236a236688", "url": "https://legiscan.com/KY/bill/HR30/2019/X1", "status_date": "2019-07-24", "status": 1, "last_action_date": "2019-07-24", "last_action": "failed 22-47", "title": "A RESOLUTION supporting the inclusion of all residents in the 2020 U.S. Census count.", "description": "Express support for the inclusion of all residents in the 2020 U.S. Census count to apportion Congressional districts and legislative districts, and to ensure the fair and equitable distribution of federal funds to Kentucky based upon census-driven data."}, "32": {"bill_id": 1272018, "number": "HR31", "change_hash": "d92bcb6d4a7725edda429ab93363a842", "url": "https://legiscan.com/KY/bill/HR31/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Eric Elliott on the occasion of his retirement.", "description": "Honor Eric Elliott on the occasion of his retirement."}, "33": {"bill_id": 1272010, "number": "HR32", "change_hash": "0376cf84365441d6649c6c0d98da4604", "url": "https://legiscan.com/KY/bill/HR32/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the House of Representatives in honor and loving memory of Jimmy Stone, and encouraging a speedy recovery for Chad Harper.", "description": "Adjourn in honor and loving memory of Jimmy Stone, and encourage a speedy recovery for Chad Harper."}, "34": {"bill_id": 1272012, "number": "HR33", "change_hash": "1f654b0657656671004d76787b623f87", "url": "https://legiscan.com/KY/bill/HR33/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Susan Cunningham upon the occasion of her retirement.", "description": "Adjourn in honor of Susan Cunningham."}, "35": {"bill_id": 1272020, "number": "HCR28", "change_hash": "d20af909bba7fab78c88324206d7d78a", "url": "https://legiscan.com/KY/bill/HCR28/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A CONCURRENT RESOLUTION adjourning the 2019 Extraordinary Session of the General Assembly sine die.", "description": "Adjourn the 2019 Extraordinary Session of the General Assembly sine die."}, "36": {"bill_id": 1271805, "number": "SR1", "change_hash": "8d5bca180982804aacb83d927971c73a", "url": "https://legiscan.com/KY/bill/SR1/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Clyde W. Middleton.", "description": "Adjourn in honor and loving memory of Clyde W. Middleton."}, "37": {"bill_id": 1271806, "number": "SR2", "change_hash": "fc57b98fd962dbe363fed7a8ff02065f", "url": "https://legiscan.com/KY/bill/SR2/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Ernest C. Taylor.", "description": "Adjourn in honor and loving memory of Ernest C. Taylor."}, "38": {"bill_id": 1271794, "number": "SR3", "change_hash": "0df0020adbab91cee639433978b3bd34", "url": "https://legiscan.com/KY/bill/SR3/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in loving memory and honor of Charles Michael \"Mike\" Driscoll.", "description": "Adjourn in honor and loving memory of Charles Michael \"Mike\" Driscoll."}, "40": {"bill_id": 1271798, "number": "SR5", "change_hash": "de1dd09cea70ef64d54f8b4cedcc3b3a", "url": "https://legiscan.com/KY/bill/SR5/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Grayson County Magistrate Robby Higdon.", "description": "Adjourn in honor and loving memory of Grayson County Magistrate Robby Higdon."}, "41": {"bill_id": 1271808, "number": "SR6", "change_hash": "ff52f4f8a34406f12549e453c78a2b1f", "url": "https://legiscan.com/KY/bill/SR6/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of \"King\" Kelly Coleman.", "description": "Adjourn the Senate in honor and loving memory of \"King\" Kelly Coleman."}, "42": {"bill_id": 1271797, "number": "SR7", "change_hash": "73e757db391adcc0068f0e7e4bfeed00", "url": "https://legiscan.com/KY/bill/SR7/2019/X1", "status_date": "2019-07-22", "status": 4, "last_action_date": "2019-07-22", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring Margaret Mary Magdalene Somers Ballard upon the occasion of her 100th birthday.", "description": "A resolution honoring Margaret Mary Magdalene Somers Ballard upon the occasion of her 100th birthday."}, "44": {"bill_id": 1271827, "number": "SR9", "change_hash": "7eff29063a28c3f02c72e8cc90d34e2f", "url": "https://legiscan.com/KY/bill/SR9/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the charitable work of Father Jim Sichko.", "description": "Honor the charitable work of Father Jim Sichko."}, "45": {"bill_id": 1271829, "number": "SR10", "change_hash": "dc1f99678012d2f60a808ea58788e8b1", "url": "https://legiscan.com/KY/bill/SR10/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of John H. Sizemore.", "description": "Adjourn in honor and loving memory of John H. Sizemore."}, "47": {"bill_id": 1271872, "number": "SR12", "change_hash": "9a78a043daeb2cbc482749a835cab95c", "url": "https://legiscan.com/KY/bill/SR12/2019/X1", "status_date": "2019-07-23", "status": 4, "last_action_date": "2019-07-23", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Jerry G. English.", "description": "Adjourn the Senate in honor and loving memory of Jerry G. English."}, "50": {"bill_id": 1271876, "number": "SR15", "change_hash": "15f3107e09c180e18bd807b1d2f11f26", "url": "https://legiscan.com/KY/bill/SR15/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Jared Lorenzen.", "description": "Adjourn the Senate in honor of Jared Lorenzen."}, "56": {"bill_id": 1271882, "number": "SR21", "change_hash": "572277dbe79210160a60938cfca56808", "url": "https://legiscan.com/KY/bill/SR21/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Dr. Christopher Ryan Maynard.", "description": "Adjourn the Senate in honor and loving memory of Dr. Christopher Ryan Maynard."}, "58": {"bill_id": 1272014, "number": "SR24", "change_hash": "558d27bf12532cde1bd1f3bd0b3241ad", "url": "https://legiscan.com/KY/bill/SR24/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION honoring the V.L. and Tennie Harless family for their contributions to Martin County and to the United States of America.", "description": "Honor the V.L. and Tennie Harless family."}, "59": {"bill_id": 1272024, "number": "SR25", "change_hash": "f3e0bcb5253787ef41f2ebc042ab6d74", "url": "https://legiscan.com/KY/bill/SR25/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor and loving memory of Mary Ann Matthews.", "description": "Adjourn the Senate in honor and loving memory of Mary Ann Mathews."}, "60": {"bill_id": 1272021, "number": "SR26", "change_hash": "53b5995230a43e18a113f867b2632195", "url": "https://legiscan.com/KY/bill/SR26/2019/X1", "status_date": "2019-07-24", "status": 4, "last_action_date": "2019-07-24", "last_action": "adopted by voice vote", "title": "A RESOLUTION adjourning the Senate in honor of Charles Beach III and his 50 years of banking excellence.", "description": "Honor Charles Beach III for his 50 years of banking."}}