{"session": {"session_id": 1755, "state_id": 28, "year_start": 2020, "year_end": 2020, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "1st Special Session", "session_title": "2020 1st Special Session", "session_name": "31st Special Session (2020)"}, "0": {"bill_id": 1372854, "number": "AB1", "change_hash": "441144ac165aa90bddd378226c09a056", "url": "https://legiscan.com/NV/bill/AB1/2020/X1", "status_date": "2020-07-09", "status": 1, "last_action_date": "2020-07-20", "last_action": "No further action taken.", "title": "Revises provisions relating to public employment. (BDR 23-11)", "description": "AN ACT relating to programs for public personnel; temporarily increasing the limitation on the amount of annual leave that certain state employees are authorized to carry forward to the next calendar year; providing for a 1-month suspension during Fiscal Year 2020-2021 of the payment of subsidies by the State to the Public Employees&#39; Benefits Program for group insurance for certain active and retired public officers and employees; requiring state employees to take a certain number of hours of unpaid furlough leave during Fiscal Year 2020-2021; providing exceptions to the furlough requirement; providing that employees who take certain furlough leave are held harmless in the accumulation of service credit and reported salary for retirement under the Public Employees&#39; Retirement System; prohibiting the granting of any merit pay increases to state employees during Fiscal Year 2020-2021; and providing other matters properly relating thereto."}, "1": {"bill_id": 1372844, "number": "AB2", "change_hash": "aa42b370744caa8847c4d4aee851f996", "url": "https://legiscan.com/NV/bill/AB2/2020/X1", "status_date": "2020-07-09", "status": 1, "last_action_date": "2020-07-20", "last_action": "No further action taken.", "title": "Temporarily removes a requirement for year-end balances of certain local school precincts to be carried forward as restricted fund balances. (BDR S-17)", "description": "AN ACT relating to large school districts; temporarily removing a requirement for the year-end balances of local school precincts in a large school district to be carried forward as a restricted fund balance; and providing other matters properly relating thereto."}, "2": {"bill_id": 1372900, "number": "AB3", "change_hash": "ec6f1c10b6a23523e6ab33a279cadde8", "url": "https://legiscan.com/NV/bill/AB3/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "Chapter 5.", "title": "Makes various changes relating to state financial administration. (BDR S-8)", "description": "AN ACT relating to state financial administration; reducing certain appropriations and other money budgeted for Fiscal Year 2020-2021; authorizing certain sums appropriated to the Department of Health and Human Services to be transferred among the various budget accounts of the Department under certain circumstances; requiring the transfer of certain money to the State General Fund; revising various provisions relating to the authority for such transfers; authorizing certain expenditures; temporarily suspending the transfer from the State General Fund to the Account to Stabilize the Operation of the State Government for Fiscal Year 2020-2021; temporarily increasing the limitation on the amount of annual leave that certain state employees are authorized to carry forward to the next calendar year; providing for a 1-month suspension during Fiscal Year 2020-2021 of the payment of subsidies by the State to the Public Employees&#39; Benefits Program for group insurance for certain active and retired public officers and employees; requiring state employees to take a certain number of hours of unpaid furlough leave during a certain period of Fiscal Year 2020-2021; providing exceptions and requirements relating to the furlough leave; and providing other matters properly relating thereto."}, "3": {"bill_id": 1373848, "number": "AB4", "change_hash": "7291efa00132d1d135b0602ad00a4846", "url": "https://legiscan.com/NV/bill/AB4/2020/X1", "status_date": "2020-07-16", "status": 2, "last_action_date": "2020-07-20", "last_action": "No further action taken.", "title": "Revises provisions relating to the tax on the net proceeds of minerals extracted and the use thereof. (BDR 32-25)", "description": "AN ACT relating to governmental financial administration; revising the formula for determining the measure of the tax on the net proceeds of minerals; creating the Supplemental Support for Classroom Instruction Account; requiring the transfer of a portion of the tax on the net proceeds of minerals to the Account; providing for the use of money in the Account; making an appropriation; and providing other matters properly relating thereto."}, "4": {"bill_id": 1372820, "number": "AR1", "change_hash": "d36168bc790bccb53a9aae2af186daba", "url": "https://legiscan.com/NV/bill/AR1/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 5.", "title": "Amends the Standing Rules of the Assembly of the 80th Session of the Nevada Legislature. (BDR R-7)", "description": "Amending the Standing Rules of the Assembly of the 80th Session of the Nevada Legislature."}, "5": {"bill_id": 1372815, "number": "AR2", "change_hash": "477837777f3aab81f20d8f0e40db4442", "url": "https://legiscan.com/NV/bill/AR2/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 6.", "title": "Adopts Special Rules of the Assembly for the 31st Special Session of the Nevada Legislature concerning the use of remote-technology systems by members of the Assembly. (BDR R-16)", "description": "Adopting Special Rules of the Assembly for the 31st Special Session of the Nevada Legislature concerning the use of remote-technology systems by members of the Assembly."}, "6": {"bill_id": 1372821, "number": "AR3", "change_hash": "6207b0f0a613155d08336126d6c3fcfb", "url": "https://legiscan.com/NV/bill/AR3/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 7.", "title": "Provides for the appointment of the Assembly attaches. (BDR R-4)", "description": "Providing for the appointment of the Assembly attaches."}, "7": {"bill_id": 1372813, "number": "AR4", "change_hash": "89b7f9fea7029e62295e94c1604e63d7", "url": "https://legiscan.com/NV/bill/AR4/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 8.", "title": "Provides that no allowances will be paid for the 31st Special Session of the Nevada Legislature for periodicals, stamps, stationery or communications. (BDR R-6)", "description": "Providing that no allowances will be paid for the 31st Special Session of the Nevada Legislature for periodicals, stamps, stationery or communications."}, "8": {"bill_id": 1373850, "number": "AR5", "change_hash": "9cca2b5a7bbcb791a891c57cd3580cd0", "url": "https://legiscan.com/NV/bill/AR5/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "File No. 14.", "title": "Expresses appreciation to the Assembly staff for their service during the 31st Special Session of the Nevada Legislature. (BDR R-21)", "description": "Expressing appreciation to the Assembly staff for their service during the 31st Special Session of the Nevada Legislature."}, "9": {"bill_id": 1372814, "number": "ACR1", "change_hash": "24904b2f88771e05b10214c032c2454b", "url": "https://legiscan.com/NV/bill/ACR1/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 9.", "title": "Adopts the Joint Rules of the Senate and Assembly for the 31st Special Session of the Nevada Legislature. (BDR R-1)", "description": "Adopting the Joint Rules of the Senate and Assembly for the 31st Special Session of the Nevada Legislature."}, "10": {"bill_id": 1373851, "number": "ACR2", "change_hash": "4b856c4b52705499ea961f0056678394", "url": "https://legiscan.com/NV/bill/ACR2/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "File No. 13.", "title": "Expresses appreciation to the staff of the Legislative Counsel Bureau for their service during the 31st Special Session of the Nevada Legislature. (BDR R-20)", "description": "Expressing appreciation to the staff of the Legislative Counsel Bureau for their service during the 31st Special Session of the Nevada Legislature."}, "11": {"bill_id": 1373313, "number": "AJR1", "change_hash": "7c55e8781d1550f79a38cbc82bdb0f86", "url": "https://legiscan.com/NV/bill/AJR1/2020/X1", "status_date": "2020-07-17", "status": 4, "last_action_date": "2020-07-17", "last_action": "File No. 10.", "title": "Urges the President and Congress of the United States to provide flexible funding for state, local and tribal governments to account for anticipated public budget shortfalls as a result of the COVID-19 pandemic. (BDR R-18)", "description": "Urging the President and Congress of the United States to provide flexible funding for state, local and tribal governments to account for anticipated public budget shortfalls as a result of the COVID-19 pandemic."}, "12": {"bill_id": 1372819, "number": "SB1", "change_hash": "35d193a0e8a63255b6b7856978f22606", "url": "https://legiscan.com/NV/bill/SB1/2020/X1", "status_date": "2020-07-17", "status": 4, "last_action_date": "2020-07-17", "last_action": "Approved by the Governor. Chapter 3.", "title": "Revises provisions relating to capital improvement projects. (BDR S-9)", "description": "AN ACT relating to projects of capital improvement; revising the funding for certain projects; and providing other matters properly relating thereto."}, "13": {"bill_id": 1372823, "number": "SB2", "change_hash": "61acd71c3cb45df6cf0c48813983d6a7", "url": "https://legiscan.com/NV/bill/SB2/2020/X1", "status_date": "2020-07-17", "status": 4, "last_action_date": "2020-07-17", "last_action": "Approved by the Governor. Chapter 2.", "title": "Temporarily authorizes certain changes to eligibility requirements for the Governor Guinn Millennium Scholarship. (BDR 34-13)", "description": "AN ACT relating to education; temporarily authorizing the Board of Regents of the University of Nevada to waive or modify certain requirements for eligibility to receive a Governor Guinn Millennium Scholarship in response to a state of emergency or declaration of disaster; and providing other matters properly relating thereto."}, "14": {"bill_id": 1372862, "number": "SB3", "change_hash": "13add66ab00ebd4912c8110cc49c6055", "url": "https://legiscan.com/NV/bill/SB3/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "Approved by the Governor. Chapter 4.", "title": "Revises provisions governing governmental financial administration. (BDR 32-10)", "description": "AN ACT relating to governmental financial administration; temporarily accelerating the collection of a portion of the tax upon the net proceeds of minerals; temporarily requiring persons who extract minerals to pay a portion of the tax on the net proceeds of the estimated royalties that will be paid for certain years; temporarily altering the allocation of a portion of the proceeds of the basic governmental services tax; requiring the Department of Taxation to allow for the payment of delinquent taxes, fees or assessments without a penalty for a limited period in certain circumstances; and providing other matters properly relating thereto."}, "15": {"bill_id": 1372901, "number": "SB4", "change_hash": "7fc0c660ea40a194229c8fe1d02ac4d9", "url": "https://legiscan.com/NV/bill/SB4/2020/X1", "status_date": "2020-07-17", "status": 4, "last_action_date": "2020-07-17", "last_action": "Approved by the Governor. Chapter 1.", "title": "Temporarily revises provisions governing public borrowing. (BDR 30-19)", "description": "AN ACT relating to state securities; authorizing the State Board of Finance to issue interim debentures for a temporary period to fund the general operations of the State under certain circumstances; temporarily revising provisions governing payments made from the Consolidated Bond Interest and Redemption Fund; temporarily revising provisions governing the fixing of interest rates for certain state securities; temporarily revising provisions governing the issuance of interim debentures; and providing other matters properly relating thereto."}, "16": {"bill_id": 1372818, "number": "SR1", "change_hash": "a0a3c121021d0e01b92afb3060ceb256", "url": "https://legiscan.com/NV/bill/SR1/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 1.", "title": "Adopts the Rules of the Senate for the 31st Special Session of the Nevada Legislature. (BDR R-2)", "description": "Adopting the Rules of the Senate for the 31st Special Session of the Nevada Legislature."}, "17": {"bill_id": 1372817, "number": "SR2", "change_hash": "ae851fbc3a8a82cff70ce5624aa57d96", "url": "https://legiscan.com/NV/bill/SR2/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 2.", "title": "Provides that no allowances will be paid for the 31st Special Session of the Nevada Legislature for periodicals, stamps, stationery or communications. (BDR R-5)", "description": "Providing that no allowances will be paid for the 31st Special Session of the Nevada Legislature for periodicals, stamps, stationery or communications."}, "18": {"bill_id": 1372816, "number": "SR3", "change_hash": "93cd17bbd2a7cec46e902d0bb07aa79d", "url": "https://legiscan.com/NV/bill/SR3/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 3.", "title": "Recognizes the appointment of the Senate staff. (BDR R-3)", "description": "Recognizing the appointment of the Senate staff."}, "19": {"bill_id": 1372822, "number": "SR4", "change_hash": "a5f33456810db004ea7f9ab69810fb47", "url": "https://legiscan.com/NV/bill/SR4/2020/X1", "status_date": "2020-07-10", "status": 4, "last_action_date": "2020-07-10", "last_action": "File No. 4.", "title": "Adopts Special Rules of the Senate for the 31st Special Session of the Nevada Legislature concerning the use of remote-technology systems by members of the Senate. (BDR R-15)", "description": "Adopting Special Rules of the Senate for the 31st Special Session of the Nevada Legislature concerning the use of remote-technology systems by members of the Senate."}, "20": {"bill_id": 1373849, "number": "SR5", "change_hash": "8ae30f18d0e1a1d50b61991509c686a1", "url": "https://legiscan.com/NV/bill/SR5/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "File No. 12.", "title": "Expresses appreciation to the Senate staff for their service during the 31st Special Session of the Nevada Legislature. (BDR R-23)", "description": "Expressing appreciation to the Senate staff for their service during the 31st Special Session of the Nevada Legislature."}, "21": {"bill_id": 1373847, "number": "SCR1", "change_hash": "e2a168bf560057f69fce94bf021f8162", "url": "https://legiscan.com/NV/bill/SCR1/2020/X1", "status_date": "2020-07-20", "status": 4, "last_action_date": "2020-07-20", "last_action": "File No. 11.", "title": "Expresses appreciation to persons and organizations who offered their services and assistance during the 31st Special Session of the Nevada Legislature. (BDR R-22)", "description": "Expressing appreciation to persons and organizations who offered their services and assistance during the 31st Special Session of the Nevada Legislature."}}