{"session": {"session_id": 1754, "state_id": 28, "year_start": 2021, "year_end": 2021, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021 Regular Session", "session_name": "81st Legislature (2021)"}, "279": {"bill_id": 1482570, "number": "AB280", "change_hash": "90d7a26ba17b8ca4827c7d857648a239", "url": "https://legiscan.com/NV/bill/AB280/2021", "status_date": "2021-06-04", "status": 4, "last_action_date": "2021-06-04", "last_action": "Approved by the Governor. Chapter 386.", "title": "Revises provisions relating to public restrooms. (BDR 54-132)", "description": "AN ACT relating to public restrooms; requiring places of public accommodation, public buildings and facilities owned by a public body, certain areas leased by or on behalf of a public body and certain leased areas within a state park that provide a single-stall restroom to the public to make the single-stall restroom as inclusive and accessible as possible to a person of any gender identity or expression; revising provisions relating to the signage for such single-stall restrooms; requiring certain governmental entities to include in their building codes or, if applicable, adopt by ordinance a requirement that certain buildings and facilities used by the public that contain a single-stall restroom which is available to the public be as inclusive and accessible as possible to a person of any gender identity or expression and prohibiting certain signage on such restrooms; providing a penalty; making an appropriation; and providing other matters properly relating thereto."}, "642": {"bill_id": 1442717, "number": "SB109", "change_hash": "1d624a72bb7b570c5e8a537d33b0d436", "url": "https://legiscan.com/NV/bill/SB109/2021", "status_date": "2021-06-11", "status": 4, "last_action_date": "2021-06-11", "last_action": "Chapter 489.", "title": "Revises provisions relating to the collection of certain information by governmental agencies. (BDR 19-95)", "description": "AN ACT relating to governmental agencies; requiring governmental agencies to request from certain persons information related to sexual orientation and gender identity or expression; providing, with certain exceptions, that such information is confidential; requiring a governmental agency to annually report certain information related to sexual orientation and gender identity or expression to the Director of the Legislative Counsel Bureau; and providing other matters properly relating thereto."}}