{"session": {"session_id": 1095, "state_id": 49, "year_start": 2014, "year_end": 2014, "prefile": 0, "sine_die": 1, "prior": 1, "special": 1, "session_tag": "3rd Special Session", "session_title": "2014 3rd Special Session", "session_name": "January 2014 Special Session"}, "0": {"bill_id": 621600, "number": "AB1", "change_hash": "1dca1dc71e0e311dbe9a891755b4d899", "url": "https://legiscan.com/WI/bill/AB1/2014/X3", "status_date": "2014-02-11", "status": 2, "last_action_date": "2014-03-24", "last_action": "Failed to concur in pursuant to Senate Joint Resolution 1", "title": "Reducing the lowest individual income tax rate; providing technical college property tax relief aid; establishing a technical college district revenue limit; the carry-back of net operating losses; the sales and use tax exemption for commercial printing; the jobs tax credit; the electronic medical records credit; the manufacturing and agriculture credit; the research credit; the state historic rehabilitation credit; the relocated business credit; and making an appropriation. (FE)", "description": "Relating to: reducing the lowest individual income tax rate; providing technical college property tax relief aid; establishing a technical college district revenue limit; the carry-back of net operating losses; the sales and use tax exemption for commercial printing; the jobs tax credit; the electronic medical records credit; the manufacturing and agriculture credit; the research credit; the state historic rehabilitation credit; the relocated business credit; and making an appropriation. (FE)"}, "1": {"bill_id": 621603, "number": "AB2", "change_hash": "2f01b69e08d63d667183bc2ca458b13a", "url": "https://legiscan.com/WI/bill/AB2/2014/X3", "status_date": "2014-03-17", "status": 4, "last_action_date": "2014-03-17", "last_action": "Published 3-18-2014", "title": "Workforce training grants to technical colleges, workforce training grants for collaborative projects among school districts, technical colleges, and businesses, workforce training grants and services to enhance employment opportunities for persons with disabilities, and making an appropriation. (FE)", "description": "Relating to: workforce training grants to technical colleges, workforce training grants for collaborative projects among school districts, technical colleges, and businesses, workforce training grants and services to enhance employment opportunities for persons with disabilities, and making an appropriation. (FE)"}}