{"session": {"session_id": 1821, "state_id": 49, "year_start": 2021, "year_end": 2022, "prefile": 0, "sine_die": 1, "prior": 1, "special": 0, "session_tag": "Regular Session", "session_title": "2021-2022 Regular Session", "session_name": "2021-2022 Regular Session"}, "469": {"bill_id": 1520004, "number": "AB470", "change_hash": "b4d63e4b7c02a82757749bc630882b10", "url": "https://legiscan.com/WI/bill/AB470/2021", "status_date": "2022-03-15", "status": 6, "last_action_date": "2022-03-15", "last_action": "Failed to pass pursuant to Senate Joint Resolution 1", "title": "Eliminating criminal defenses of adequate provocation, self-defense, or not guilty by reason of mental disease or defect if the claim is based on the victim's gender identity or sexual orientation.", "description": "An Act to renumber and amend 971.15 (2); and to create 939.44 (3), 939.48 (5m) and 971.15 (2) (b) of the statutes; Relating to: eliminating criminal defenses of adequate provocation, self-defense, or not guilty by reason of mental disease or defect if the claim is based on the victim's gender identity or sexual orientation."}, "561": {"bill_id": 1523549, "number": "AB562", "change_hash": "3e7bb5700e97b2a3e84e64f7db5ba13e", "url": "https://legiscan.com/WI/bill/AB562/2021", "status_date": "2022-03-15", "status": 6, "last_action_date": "2022-03-15", "last_action": "Failed to pass pursuant to Senate Joint Resolution 1", "title": "Gender identity and sexual orientation programs in public schools.", "description": "An Act to create 118.018 of the statutes; Relating to: gender identity and sexual orientation programs in public schools."}, "1282": {"bill_id": 1508877, "number": "AJR53", "change_hash": "f1bb03c1eea12ebb86667ca77df6a371", "url": "https://legiscan.com/WI/bill/AJR53/2021", "status_date": "2022-03-15", "status": 6, "last_action_date": "2022-03-15", "last_action": "Failed to adopt pursuant to Senate Joint Resolution 1", "title": "Equality of rights on the basis of sex, gender identity, race, color, sexual orientation, disability, religion, national origin, marital status, family status, age, ancestry, or any other immutable characteristic and creating a private cause of action for violations of those rights by state actors (first consideration).", "description": "To create section 27 of article I of the constitution; Relating to: equality of rights on the basis of sex, gender identity, race, color, sexual orientation, disability, religion, national origin, marital status, family status, age, ancestry, or any other immutable characteristic and creating a private cause of action for violations of those rights by state actors (first consideration)."}}